{
  "title": "1.4: Комбинации Свойств",
  "summary": "Научитесь комбинировать несколько свойств частиц (цвет, размер, масштаб) для создания сложных эффектов",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь комбинировать несколько свойств частиц (цвет, размер и масштаб) для создания сложных, динамических эффектов. Вы создадите полную систему частиц с нуля, используя Возраст, Время жизни, соотношение возраста и математические операции - для создания частиц, которые изменяют цвет, растут в размере и масштабируются неравномерно со временем. Этот урок демонстрирует силу комбинирования нескольких свойств вместе.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте SystemBlock - это корень вашей системы частиц",
    "Создайте CreateParticleBlock для эмиссии частиц с начальным цветом и размером",
    "Добавьте PointShapeBlock для эмиссии частиц из одной точки",
    "Добавьте UpdatePositionBlock для обработки движения частиц",
    "Получите Position и ScaledDirection, сложите их и подключите к UpdatePositionBlock",
    "Получите Возраст и Время жизни частицы используя ParticleInputBlock",
    "Вычислите соотношение возраста: Возраст / Время жизни используя ParticleMathBlock (операция Divide)",
    "Вычислите инвертированное соотношение возраста: 1 - ageRatio для эффектов затухания",
    "Добавьте UpdateColorBlock после UpdatePositionBlock",
    "Создайте сложный переход цвета, используя ParticleConverterBlock",
    "Установите красный компонент для увеличения с возрастом (ageRatio)",
    "Установите зеленый компонент для затухания с возрастом (ageRatioInverted)",
    "Установите синий компонент для затухания с возрастом, умноженный на 0.5",
    "Подключите цвет из ParticleConverterBlock к UpdateColorBlock",
    "Добавьте UpdateSizeBlock с расчетом роста: baseSize * (1 + growthAmount * ageRatio)",
    "Добавьте UpdateScaleBlock с неравномерным масштабированием",
    "Установите масштаб X для уменьшения: baseX * (1 - ageRatio)",
    "Установите масштаб Y для увеличения: baseY * (1 + ageRatio)",
    "Преобразуйте масштаб X и Y в Vector2 используя ParticleConverterBlock",
    "Подключите Vector2 масштаб к UpdateScaleBlock",
    "Соедините все блоки обновления: CreateParticle → PointShape → UpdatePosition → UpdateColor → UpdateSize → UpdateScale → SystemBlock",
    "Добавьте ParticleTextureSourceBlock для предоставления текстуры",
    "Наблюдайте, как все свойства работают вместе для создания целостного, динамического эффекта"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "UpdateScaleBlock",
      "description": "Обновляет масштаб частиц. Масштаб влияет на визуальный размер частицы независимо от свойства размера. Это позволяет неравномерное масштабирование (разные значения X и Y).",
      "properties": [
        {
          "name": "name",
          "value": "'Update scale'",
          "description": "Отображаемое имя блока"
        },
        {
          "name": "scale",
          "value": "Vector2 input",
          "description": "Значение масштаба. Должно быть Vector2 для неравномерного масштабирования (разные значения X и Y)."
        }
      ]
    },
    {
      "name": "ParticleConverterBlock",
      "description": "Преобразует отдельные значения float в Vector2, Vector3 или Color4. В этом уроке мы используем его для создания Color4 из отдельных компонентов R, G, B, A и Vector2 для масштаба.",
      "properties": [
        {
          "name": "xIn, yIn, zIn, wIn",
          "value": "Float inputs",
          "description": "Отдельные входы float для компонентов X, Y, Z, W (для Vector2, Vector3 или Color4)"
        },
        {
          "name": "colorOut",
          "value": "Color4 output",
          "description": "Итоговый вывод Color4 (из xIn=R, yIn=G, zIn=B, wIn=A)"
        },
        {
          "name": "xyOut",
          "value": "Vector2 output",
          "description": "Итоговый вывод Vector2 (из xIn=X, yIn=Y)"
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Этот урок демонстрирует, как комбинировать несколько свойств частиц вместе. Ключевая концепция заключается в том, что свойства могут быть вычислены с использованием того же соотношения возраста, но с разными формулами. Для цвета мы используем ageRatio напрямую для красного (увеличивается) и (1 - ageRatio) для зеленого/синего (затухает). Для размера мы вычисляем: baseSize * (1 + growthAmount * ageRatio), создавая рост от baseSize до 3 * baseSize. Для масштаба мы используем разные формулы для X и Y: scaleX = baseX * (1 - ageRatio) делает частицы шире, scaleY = baseY * (1 + ageRatio) делает частицы выше. Это создает неравномерное масштабирование, при котором частицы становятся шире, но выше со временем. Комбинируя все эти свойства, мы создаем богатые, динамические эффекты, которые изменяются несколькими способами одновременно.",
  "objectivesTitle": "Цели Обучения",
  "objectives": [
    "Комбинировать несколько свойств частиц (цвет, размер, масштаб) вместе",
    "Использовать ParticleConverterBlock для создания Color4 и Vector2 из отдельных компонентов",
    "Применять разные формулы к разным свойствам, используя то же соотношение возраста",
    "Создавать неравномерное масштабирование с UpdateScaleBlock",
    "Понять, как свойства взаимодействуют при комбинировании"
  ],
  "commonMistakesTitle": "Частые Ошибки",
  "commonMistakes": [
    {
      "mistake": "Использование неправильного порядка компонентов в ParticleConverterBlock",
      "explanation": "ParticleConverterBlock ожидает компоненты в определенном порядке: для Color4 это R, G, B, A (xIn, yIn, zIn, wIn), для Vector2 это X, Y (xIn, yIn).",
      "solution": "Для Color4: xIn = Красный, yIn = Зеленый, zIn = Синий, wIn = Альфа. Для Vector2: xIn = X, yIn = Y. Проверьте тип выхода (colorOut vs xyOut), чтобы убедиться в правильном сопоставлении."
    },
    {
      "mistake": "Использование Vector3 для UpdateScaleBlock вместо Vector2",
      "explanation": "UpdateScaleBlock требует вход Vector2 (масштаб X и Y), а не Vector3. Использование Vector3 вызовет ошибку.",
      "solution": "Используйте ParticleConverterBlock с xyOut для создания Vector2 для UpdateScaleBlock. Предоставьте только компоненты X и Y."
    },
    {
      "mistake": "Применение той же формулы ко всем свойствам",
      "explanation": "Разные свойства могут использовать разные формулы с тем же соотношением возраста. Использование той же формулы везде создает однообразные, скучные эффекты.",
      "solution": "Используйте ageRatio для свойств, которые должны увеличиваться, (1 - ageRatio) для свойств, которые должны уменьшаться. Смешивайте и комбинируйте формулы для интересных эффектов."
    }
  ],
  "homeworkTitle": "Практические Упражнения",
  "homework": [
    "Попробуйте разные комбинации цветов, используя ParticleConverterBlock",
    "Экспериментируйте с разными формулами роста для размера",
    "Создайте равномерное масштабирование (X и Y масштабируются одинаково)",
    "Попробуйте обратить эффекты масштаба (X увеличивается, Y уменьшается)",
    "Комбинируйте рост размера с переходами цвета для более драматических эффектов",
    "Экспериментируйте с разными математическими операциями для создания уникальных комбинаций свойств",
    "Попробуйте создать частицы, которые уменьшаются в размере, но растут в масштабе"
  ]
}

