{
  "title": "1.4: Комбинации Свойств",
  "summary": "Научитесь комбинировать несколько свойств частиц (цвет, размер, масштаб) для создания сложных эффектов",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь комбинировать несколько свойств частиц (цвет, размер и масштаб) для создания сложных, динамических эффектов. Вы создадите полную систему частиц с нуля, используя Возраст, Время жизни, соотношение возраста и математические операции - для создания частиц, которые изменяют цвет, растут в размере и масштабируются неравномерно со временем. Этот урок демонстрирует силу комбинирования нескольких свойств вместе.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте <filter-value>System</filter-value> блок - это корень вашей системы частиц",
    "Добавьте <filter-value>Texture</filter-value> блок для предоставления текстуры частицам и подключите к System блоку",
    "Загрузите <textures>flare.png</textures> с помощью кнопки загрузки в свойствах Texture блока",
    "Добавьте <filter-value>CreateParticle</filter-value> блок для эмиссии частиц и подключите к System блоку",
    "Добавьте <filter-value>Color4</filter-value> блок и установите его значение на оранжевый (R: 1, G: 0.5, B: 0, A: 1)",
    "Подключите выход Color4 блока к входу color блока CreateParticle",
    "Добавьте <filter-value>Float</filter-value> блок и установите его значение на 0.3",
    "Подключите выход Float блока к входу size блока CreateParticle",
    "Добавьте <filter-value>BoxShape</filter-value> блок для эмиссии частиц из объема куба и подключите между CreateParticle и System блоками",
    "Добавьте <filter-value>UpdatePosition</filter-value> блок для обработки движения частиц и подключите между BoxShape и System блоками",
    "Добавьте <filter-value>Position</filter-value> блок для получения текущей позиции",
    "Добавьте <filter-value>ScaledDirection</filter-value> блок для получения масштабированного направления",
    "Добавьте математический <filter-value>Add</filter-value> блок и подключите Position и ScaledDirection блоки к левому и правому входам соответственно",
    "Подключите результат из математического блока к входу position блока UpdatePosition",
    "Добавьте <filter-value>Age</filter-value> блок для получения возраста частицы",
    "Добавьте <filter-value>Lifetime</filter-value> блок для получения времени жизни частицы",
    "Добавьте математический <filter-value>Divide</filter-value> блок для вычисления соотношения возраста и подключите Age блок к левому входу и Lifetime блок к правому входу",
    "Добавьте <filter-value>Float</filter-value> блок со значением 1.0",
    "Добавьте математический <filter-value>Subtract</filter-value> блок для вычисления инвертированного соотношения возраста и подключите Float(1.0) блок к левому входу и соотношение возраста из Divide блока к правому входу",
    "Добавьте <filter-value>UpdateColor</filter-value> блок после UpdatePosition блока и подключите между UpdatePosition и System блоками",
    "Добавьте <filter-value>Converter</filter-value> блок для создания сложного перехода цвета",
    "Подключите соотношение возраста из Divide блока к входу X (Red) блока Converter",
    "Подключите инвертированное соотношение возраста из Subtract блока к входу Y (Green) блока Converter",
    "Добавьте <filter-value>Float</filter-value> блок со значением 0.5 и подключите к левому входу математического <filter-value>Multiply</filter-value> блока",
    "Подключите инвертированное соотношение возраста к правому входу Multiply блока, затем подключите результат к входу Z (Blue) блока Converter",
    "Подключите выход Converter блока к входу color блока UpdateColor",
    "Добавьте <filter-value>UpdateSize</filter-value> блок после UpdateColor блока и подключите между UpdateColor и System блоками",
    "Добавьте <filter-value>Float</filter-value> блок со значением 0.3 для базового размера",
    "Добавьте <filter-value>Float</filter-value> блок со значением 0.5 для количества роста",
    "Добавьте математический <filter-value>Multiply</filter-value> блок и подключите Float количества роста к левому входу и соотношение возраста к правому входу",
    "Добавьте математический <filter-value>Add</filter-value> блок и подключите Float(1.0) к левому входу и результат из Multiply блока к правому входу",
    "Добавьте еще один математический <filter-value>Multiply</filter-value> блок и подключите Float базового размера к левому входу и результат из Add блока к правому входу",
    "Подключите итоговый результат к входу size блока UpdateSize",
    "Добавьте <filter-value>UpdateScale</filter-value> блок после UpdateSize блока и подключите между UpdateSize и System блоками",
    "Добавьте <filter-value>Float</filter-value> блок со значением 1.0 для базового масштаба X",
    "Добавьте математический <filter-value>Subtract</filter-value> блок и подключите Float базового масштаба X к левому входу и соотношение возраста к правому входу",
    "Добавьте <filter-value>Float</filter-value> блок со значением 1.0 для базового масштаба Y",
    "Добавьте математический <filter-value>Add</filter-value> блок и подключите Float базового масштаба Y к левому входу и соотношение возраста к правому входу",
    "Добавьте <filter-value>Converter</filter-value> блок для преобразования масштаба X и Y в Vector2",
    "Подключите результат из Subtract блока (масштаб X) к входу X блока Converter",
    "Подключите результат из Add блока (масштаб Y) к входу Y блока Converter",
    "Подключите выход Vector2 блока Converter к входу scale блока UpdateScale",
    "Наблюдайте, как все свойства работают вместе для создания целостного, динамического эффекта"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "Update Scale Block",
      "description": "Обновляет масштаб частиц. Масштаб влияет на визуальный размер частицы независимо от свойства размера. Это позволяет неравномерное масштабирование (разные значения X и Y). В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "Name",
          "value": "Update scale",
          "description": "Отображаемое имя блока. Установите это в панели свойств справа от редактора."
        },
        {
          "name": "Scale",
          "value": "Vector2 input",
          "description": "Значение масштаба. Должно быть Vector2 для неравномерного масштабирования (разные значения X и Y). Подключите выход Vector2 блока Converter к этому входу."
        }
      ]
    },
    {
      "name": "Converter Block",
      "description": "Преобразует отдельные значения float в Vector2, Vector3 или Color4. В этом уроке мы используем его для создания Color4 из отдельных компонентов R, G, B, A и Vector2 для масштаба. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "Inputs (X, Y, Z, W)",
          "value": "Float inputs",
          "description": "Отдельные входы float для компонентов X, Y, Z, W. Для Color4: X=Red, Y=Green, Z=Blue, W=Alpha. Для Vector2: X=X, Y=Y. Установите это в панели свойств справа от редактора."
        },
        {
          "name": "Color Output",
          "value": "Color4 output",
          "description": "Итоговый вывод Color4 (из X=Red, Y=Green, Z=Blue, W=Alpha). Используйте этот выход при создании цветов."
        },
        {
          "name": "Vector2 Output",
          "value": "Vector2 output",
          "description": "Итоговый вывод Vector2 (из X=X, Y=Y). Используйте этот выход при создании 2D векторов для масштаба."
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Этот урок демонстрирует, как комбинировать несколько свойств частиц вместе. Ключевая концепция заключается в том, что свойства могут быть вычислены с использованием того же соотношения возраста, но с разными формулами. Для цвета мы используем ageRatio напрямую для красного (увеличивается) и (1 - ageRatio) для зеленого/синего (затухает). Для размера мы вычисляем: baseSize * (1 + growthAmount * ageRatio), создавая рост от baseSize до 3 * baseSize. Для масштаба мы используем разные формулы для X и Y: scaleX = baseX * (1 - ageRatio) делает частицы шире, scaleY = baseY * (1 + ageRatio) делает частицы выше. Это создает неравномерное масштабирование, при котором частицы становятся шире, но выше со временем. Комбинируя все эти свойства, мы создаем богатые, динамические эффекты, которые изменяются несколькими способами одновременно.",
  "objectivesTitle": "Цели Обучения",
  "objectives": [
    "Комбинировать несколько свойств частиц (цвет, размер, масштаб) вместе",
    "Использовать Converter блок для создания Color4 и Vector2 из отдельных компонентов",
    "Применять разные формулы к разным свойствам, используя то же соотношение возраста",
    "Создавать неравномерное масштабирование с Update Scale блоком",
    "Понять, как свойства взаимодействуют при комбинировании"
  ],
  "commonMistakesTitle": "Частые Ошибки",
  "commonMistakes": [
    {
      "mistake": "Использование неправильного порядка компонентов в Converter блоке",
      "explanation": "Converter блок ожидает компоненты в определенном порядке: для Color4 это R, G, B, A (X, Y, Z, W входы), для Vector2 это X, Y (X, Y входы).",
      "solution": "Для Color4: X вход = Красный, Y вход = Зеленый, Z вход = Синий, W вход = Альфа. Для Vector2: X вход = X, Y вход = Y. Проверьте тип выхода (Color Output vs Vector2 Output) в панели свойств, чтобы убедиться в правильном сопоставлении."
    },
    {
      "mistake": "Использование Vector3 для Update Scale блока вместо Vector2",
      "explanation": "Update Scale блок требует вход Vector2 (масштаб X и Y), а не Vector3. Использование Vector3 вызовет ошибку.",
      "solution": "Используйте Converter блок с Vector2 Output для создания Vector2 для Update Scale блока. Предоставьте только компоненты X и Y в Converter блок."
    },
    {
      "mistake": "Применение той же формулы ко всем свойствам",
      "explanation": "Разные свойства могут использовать разные формулы с тем же соотношением возраста. Использование той же формулы везде создает однообразные, скучные эффекты.",
      "solution": "Используйте ageRatio для свойств, которые должны увеличиваться, (1 - ageRatio) для свойств, которые должны уменьшаться. Смешивайте и комбинируйте формулы для интересных эффектов."
    }
  ],
  "homeworkTitle": "Практические Упражнения",
  "homework": [
    "Попробуйте разные комбинации цветов, используя Converter блок",
    "Экспериментируйте с разными формулами роста для размера",
    "Создайте равномерное масштабирование (X и Y масштабируются одинаково)",
    "Попробуйте обратить эффекты масштаба (X увеличивается, Y уменьшается)",
    "Комбинируйте рост размера с переходами цвета для более драматических эффектов",
    "Экспериментируйте с разными математическими операциями для создания уникальных комбинаций свойств",
    "Попробуйте создать частицы, которые уменьшаются в размере, но растут в масштабе"
  ]
}

