{
  "title": "1.2: Базовые Свойства",
  "summary": "Научитесь обновлять цвет и размер частиц с помощью простых постоянных значений",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь использовать Update Color и Update Size блоки для изменения свойств частиц. Мы начнем с простых постоянных значений - пока без временных расчетов. Вы создадите полную систему частиц с нуля с обновлениями цвета и размера.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте <filter-value>System</filter-value> блок - это корень вашей системы частиц",
    "Добавьте <filter-value>Texture</filter-value> блок для предоставления текстуры частицам и подключите к System блоку",
    "Загрузите <textures>flare.png</textures> с помощью кнопки загрузки в свойствах Texture блока",
    "Добавьте <filter-value>CreateParticle</filter-value> блок для эмиссии частиц и подключите к System блоку",
    "Добавьте <filter-value>Color4</filter-value> блок и установите его значение на оранжевый (R: 1, G: 0.5, B: 0, A: 1)",
    "Подключите выход Color4 блока к входу color блока CreateParticle",
    "Добавьте <filter-value>Float</filter-value> блок и установите его значение на 0.3",
    "Подключите выход Float блока к входу size блока CreateParticle",
    "Добавьте <filter-value>BoxShape</filter-value> блок для эмиссии частиц из объема куба и подключите между CreateParticle и System блоками",
    "Добавьте <filter-value>UpdatePosition</filter-value> блок для обработки движения частиц и подключите между BoxShape и System блоками",
    "Добавьте <filter-value>Position</filter-value> блок для получения текущей позиции и подключите к UpdatePosition блоку",
    "Добавьте <filter-value>ScaledDirection</filter-value> блок для получения масштабированного направления",
    "Добавьте математический <filter-value>Add</filter-value> блок для объединения позиции и направления и подключите Position и ScaledDirection блоки к левому и правому входам соответственно",
    "Подключите результат из математического блока к входу position блока UpdatePosition",
    "Добавьте <filter-value>UpdateColor</filter-value> блок после UpdatePosition блока и подключите между UpdatePosition и System блоками",
    "Добавьте <filter-value>InitialColor</filter-value> блок и подключите его выход к входу color блока UpdateColor",
    "Добавьте <filter-value>UpdateSize</filter-value> блок после UpdateColor блока и подключите между UpdateColor и System блоками",
    "Добавьте еще один <filter-value>Float</filter-value> блок со значением 0.3 и подключите к входу size блока UpdateSize",
    "Наблюдайте, как частицы теперь имеют постоянный цвет и размер на протяжении всей жизни"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "Update Color Block",
      "description": "Обновляет цвет частиц каждый кадр. В этом уроке мы используем его с постоянным значением цвета. В следующих уроках мы научимся изменять цвет со временем. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "Name",
          "value": "Update color",
          "description": "Отображаемое имя блока. Установите это в панели свойств справа от редактора."
        },
        {
          "name": "Color",
          "value": "Color4 input",
          "description": "Цвет для применения к частице. Может быть постоянным значением Color4 или контекстным значением, таким как Initial Color. Подключите Input блок или Color4 блок к этому входу."
        }
      ]
    },
    {
      "name": "Update Size Block",
      "description": "Обновляет размер частиц каждый кадр. В этом уроке мы используем его с постоянным значением размера. В следующих уроках мы научимся изменять размер со временем. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "Name",
          "value": "Update size",
          "description": "Отображаемое имя блока. Установите это в панели свойств справа от редактора."
        },
        {
          "name": "Size",
          "value": "Float input",
          "description": "Значение размера для применения. Может быть постоянным значением или вычисленным с помощью математических операций. Подключите Float блок или результат Math блока к этому входу."
        }
      ]
    },
    {
      "name": "Input Block (Initial Color)",
      "description": "Получает начальный цвет частицы при ее создании. Это контекстное значение, которое запоминает цвет из Create Particle блока. В визуальном редакторе вы можете найти этот блок в списке блоков и установить его контекстное значение на Initial Color в панели свойств справа.",
      "properties": [
        {
          "name": "Contextual Value",
          "value": "Initial Color",
          "description": "Тип контекстных данных - Initial Color в данном случае. Установите это в панели свойств справа от редактора."
        }
      ]
    },
    {
      "name": "Box Shape Block",
      "description": "Испускает частицы из объема куба. Используется в этом уроке для создания частиц из видимой области куба. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "Name",
          "value": "Box emitter",
          "description": "Отображаемое имя эмиттера. Установите это в панели свойств справа от редактора."
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Этот урок знакомит с Update Color и Update Size блоками. Эти блоки позволяют нам изменять свойства частиц каждый кадр. В этом уроке мы используем постоянные значения - цвет и размер не изменяются со временем. Это основа для более сложных эффектов, которые мы изучим в следующих уроках. Ключевая концепция - цепочка блоков обновления: каждый блок получает частицу от предыдущего блока, изменяет ее и передает следующему блоку.",
  "objectivesTitle": "Цели Обучения",
  "objectives": [
    "Научиться использовать Update Color и Update Size блоки",
    "Понять, как цепочка нескольких блоков обновления работает вместе",
    "Использовать Input блок с контекстным значением Initial Color для поддержания цвета частицы",
    "Применять постоянные значения к свойствам частиц",
    "Понять цепочку блоков обновления: Update Position → Update Color → Update Size"
  ],
  "commonMistakesTitle": "Частые Ошибки",
  "commonMistakes": [
    {
      "mistake": "Цепочка блоков обновления в неправильном порядке",
      "explanation": "Блоки обновления должны быть соединены в определенном порядке. Update Position должен идти первым, затем Update Color, затем Update Size.",
      "solution": "Соединяйте блоки в порядке: Update Position → Update Color → Update Size → System. Соединяйте выход каждого блока со входом следующего блока, перетаскивая соединения в редакторе."
    },
    {
      "mistake": "Использование неправильного контекстного значения для цвета",
      "explanation": "Initial Color получает цвет, установленный при создании частицы. Использование Position или Direction вызовет ошибки.",
      "solution": "Используйте Input блок с контекстным значением Initial Color для Update Color блока, когда хотите сохранить оригинальный цвет частицы. Установите это в панели свойств справа."
    },
    {
      "mistake": "Не соединение блоков обновления с System блоком",
      "explanation": "Блоки обновления должны быть соединены с System блоком, иначе они не будут выполняться.",
      "solution": "Всегда соединяйте все блоки обновления с System блоком. Перетащите соединение от выхода последнего блока обновления к входу particle System блока."
    }
  ],
  "homeworkTitle": "Практические Упражнения",
  "homework": [
    "Попробуйте разные значения цвета (красный, синий, зеленый и т.д.)",
    "Экспериментируйте с разными значениями размера (0.1, 0.5, 1.0 и т.д.)",
    "Попробуйте использовать разные формы эмиттеров (Box Shape, Cone Shape и т.д.)",
    "Комбинируйте разные цвета и размеры, чтобы увидеть, как они влияют на визуальный вид"
  ]
}

