{
  "title": "1.1: Первая Эмиссия",
  "summary": "Создайте свою первую систему частиц с базовыми блоками",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь создавать простую систему частиц, используя Редактор Частиц. Мы начнем с основных блоков: System, Update Position и Create Particle.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте <filter-value>System</filter-value> блок - это корень вашей системы частиц",
    "Добавьте <filter-value>Texture</filter-value> блок для предоставления текстуры частицам и подключите к System блоку",
    "Загрузите <textures>flare.png</textures> с помощью кнопки загрузки в свойствах Texture блока",
    "Добавьте <filter-value>CreateParticle</filter-value> блок для эмиссии частиц и подключите к System блоку",
    "Добавьте <filter-value>BoxShape</filter-value> блок для эмиссии частиц из объема куба и подключите между CreateParticle и System блоками",
    "Добавьте <filter-value>UpdatePosition</filter-value> блок для обработки движения частиц и подключите между BoxShape и System блоками",
    "Добавьте <filter-value>Position</filter-value> блок для получения текущей позиции и подключите к UpdatePosition блоку",
    "Добавьте <filter-value>ScaledDirection</filter-value> блок для получения масштабированного направления",
    "Добавьте математический <filter-value>Add</filter-value> блок для объединения позиции и направления и подключите Position и ScaledDirection блоки к левому и правому входам соответственно",
    "Подключите результат из математического блока к входу position блока UpdatePosition"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "System Block",
      "description": "Корневой блок любой системы частиц. Управляет общими свойствами системы и подключается ко всем блокам, связанным с частицами. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "Name",
          "value": "System",
          "description": "Отображаемое имя системы частиц. Установите это в панели свойств справа от редактора."
        }
      ]
    },
    {
      "name": "Update Position Block",
      "description": "Обновляет позицию частиц каждый кадр. Этот блок необходим для любого движения частиц. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "Name",
          "value": "Update position",
          "description": "Отображаемое имя блока. Установите это в панели свойств справа от редактора."
        }
      ]
    },
    {
      "name": "Create Particle Block",
      "description": "Создает новые частицы. Этот блок отвечает за эмиссию частиц. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "Name",
          "value": "Create particle",
          "description": "Отображаемое имя блока. Установите это в панели свойств справа от редактора."
        }
      ]
    },
    {
      "name": "Box Shape Block",
      "description": "Определяет эмиттер в форме куба. Частицы будут создаваться в объеме этого куба. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "Name",
          "value": "Box emitter",
          "description": "Отображаемое имя эмиттера. Установите это в панели свойств справа от редактора."
        }
      ]
    },
    {
      "name": "Input Block",
      "description": "Получает контекстные данные частиц, такие как позиция, скорость или возраст. В этом уроке мы используем его для получения текущей позиции и масштабированного направления. В визуальном редакторе вы можете найти этот блок в списке блоков и установить его контекстное значение в панели свойств справа.",
      "properties": [
        {
          "name": "Contextual Value",
          "value": "Position / Scaled Direction",
          "description": "Тип контекстных данных для получения. Установите это в панели свойств справа от редактора."
        }
      ]
    },
    {
      "name": "Math Block",
      "description": "Выполняет математические операции над данными частиц. Мы используем его для сложения векторов позиции и направления. В визуальном редакторе вы можете найти этот блок в списке блоков и установить его операцию в панели свойств справа.",
      "properties": [
        {
          "name": "Operation",
          "value": "Add",
          "description": "Математическая операция для выполнения (Add, Subtract, Multiply, Divide и т.д.). Установите это в панели свойств справа от редактора."
        }
      ]
    },
    {
      "name": "Texture Source Block",
      "description": "Предоставляет текстуру для частиц. Это определяет, как частицы выглядят при рендеринге. В визуальном редакторе вы можете найти этот блок в списке блоков и загрузить текстуру с помощью кнопки загрузки в панели свойств справа.",
      "properties": [
        {
          "name": "Texture URL",
          "value": "https://assets.babylonjs.com/core/textures/flare.png",
          "description": "URL изображения текстуры для использования. Загрузите это с помощью кнопки загрузки в панели свойств справа от редактора."
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Код создает NodeParticleSystemSet и строит граф связанных блоков. Каждый блок имеет определенную функцию, и они связаны визуально в редакторе.",
  "objectivesTitle": "Цели Обучения",
  "objectives": [
    "Понять базовую структуру системы частиц",
    "Научиться соединять блоки визуально в редакторе",
    "Создавать частицы с помощью Create Particle и Box Shape блоков",
    "Использовать Input блоки для получения контекстных данных частиц, таких как Position и Scaled Direction",
    "Применять математические операции для объединения позиции и направления с помощью Math блоков",
    "Понять поток частиц: Create Particle → Box Shape → Update Position → System"
  ],
  "commonMistakesTitle": "Частые Ошибки",
  "commonMistakes": [
    {
      "mistake": "Забывание соединить блоки в правильном порядке",
      "explanation": "Блоки должны быть соединены в логическом порядке. Create Particle блок должен соединяться с формой, затем с блоками обновления, и наконец с System блоком.",
      "solution": "Следуйте цепочке: Create Particle → Box Shape → Update Position → System. Соединяйте выход каждого блока со входом следующего блока, перетаскивая соединения в редакторе."
    },
    {
      "mistake": "Использование неправильного контекстного значения в Input блоке",
      "explanation": "Input блоки могут получать разные типы данных (Position, Direction, Age и т.д.). Использование неправильного типа даст неверные результаты.",
      "solution": "Проверьте контекстное значение в панели свойств Input блока справа. Убедитесь, что оно соответствует тому, что вам нужно (Position, Scaled Direction и т.д.)."
    },
    {
      "mistake": "Не соединение конечного результата с System блоком",
      "explanation": "System блок - это корень системы частиц. Если блоки обновления не соединены с ним, частицы не будут обновляться.",
      "solution": "Всегда соединяйте последний блок обновления (Update Position) с System блоком. Перетащите соединение от выхода Update Position к входу particle System блока."
    }
  ],
  "homeworkTitle": "Упражнения для Практики",
  "homework": [
    "Попробуйте изменить Box Shape блок на другую форму (Cone, Sphere и т.д.)",
    "Экспериментируйте с разными URL текстур в Texture блоке",
    "Измените операцию Math блока, чтобы увидеть, как это влияет на движение частиц",
    "Добавьте больше частиц, настроив параметры Create Particle блока в панели свойств"
  ]
}