{
  "title": "3.3: Притягиватели",
  "summary": "Научитесь создавать притягиватели частиц, которые притягивают частицы к определенным точкам в пространстве",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь использовать блок UpdateAttractor для создания притягивателей, которые притягивают частицы к определенным точкам в пространстве. Притягиватели полезны для создания эффектов, таких как частицы, притягиваемые к черной дыре, магнитным полям или гравитационным колодцам. Вы научитесь устанавливать позицию притягивателя, силу и комбинировать притягиватели с другими эффектами.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте блок <filter-value>System</filter-value> - это корень вашей системы частиц",
    "Добавьте блок <filter-value>Texture</filter-value> для предоставления текстуры частицам и подключите к блоку System",
    "Загрузите <textures>flare.png</textures> с помощью кнопки загрузки в свойствах блока Texture",
    "Добавьте блок <filter-value>CreateParticle</filter-value> для эмиссии частиц и подключите к блоку System",
    "Добавьте блок <filter-value>Color4</filter-value> и установите его значение для базового цвета",
    "Подключите выход блока Color4 к входу color блока CreateParticle",
    "Добавьте блок <filter-value>Float</filter-value> и установите его значение для базового размера",
    "Подключите выход блока Float к входу size блока CreateParticle",
    "Добавьте блок <filter-value>BoxShape</filter-value> для эмиссии частиц из объема куба и подключите между блоками CreateParticle и System",
    "Добавьте блок <filter-value>UpdateAttractor</filter-value> для изменения направления частиц и подключите между блоками BoxShape и System",
    "Добавьте блок <filter-value>Converter</filter-value> для создания вектора позиции притягивателя (координаты X, Y, Z)",
    "Добавьте блоки <filter-value>Float</filter-value> со значениями для координат X, Y, Z (например, 0, 5, 0 для позиции над началом координат)",
    "Подключите блоки Float к входам X, Y и Z блока Converter соответственно",
    "Добавьте блок <filter-value>Float</filter-value> и установите его значение для силы притягивателя (например, 1.0)",
    "Подключите выход Vector3 блока Converter к входу attractor блока UpdateAttractor",
    "Подключите выход блока Float силы к входу strength блока UpdateAttractor",
    "Добавьте блок <filter-value>UpdatePosition</filter-value> после блока UpdateAttractor и подключите между блоками UpdateAttractor и System",
    "Добавьте блок <filter-value>UpdateColor</filter-value> после блока UpdatePosition и подключите между блоками UpdatePosition и System",
    "Добавьте блок <filter-value>UpdateSize</filter-value> после блока UpdateColor и подключите между блоками UpdateColor и System"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "Блок Update Attractor",
      "description": "Создает эффект притягивателя, который притягивает частицы к определенной точке в 3D пространстве. Сила уменьшается с квадратом расстояния, создавая реалистичное физическое поведение. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "Имя",
          "value": "'Attractor'",
          "description": "Отображаемое имя блока. Установите это в панели свойств справа от редактора."
        },
        {
          "name": "Attractor",
          "value": "Vector3 input",
          "description": "Позиция притягивателя в 3D пространстве (координаты X, Y, Z). Подключите выход Vector3 к этому входу."
        },
        {
          "name": "Strength",
          "value": "Float input",
          "description": "Сила силы притяжения. Большие значения создают более сильное притяжение. Сила обратно пропорциональна квадрату расстояния. Подключите блок Float к этому входу."
        }
      ]
    },
    {
      "name": "Блок Converter",
      "description": "Создает Vector3 из отдельных значений Float X, Y, Z. Используется для определения позиции притягивателя. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "Входы (X, Y, Z)",
          "value": "Float inputs",
          "description": "Отдельные входы Float для компонентов X, Y, Z. Подключите блоки Float к этим входам."
        },
        {
          "name": "Выход Vector3",
          "value": "Vector3 output",
          "description": "Объединенный выход Vector3. Используйте этот выход при создании 3D векторов."
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Этот урок демонстрирует физику притягивателей. Притягиватель создает силу, которая притягивает частицы к целевой точке. Формула для силы: force = (strength / distance²) * direction, где direction - это нормализованный вектор от частицы к притягивателю. Это создает реалистичное поведение, где частицы близко к притягивателю испытывают сильное притяжение, в то время как далекие частицы испытывают слабое притяжение. Притягиватели полезны для создания эффектов, таких как частицы, вращающиеся вокруг центра, притягиваемые к цели, или создающие вихреобразные паттерны.",
  "objectivesTitle": "Цели Обучения",
  "objectives": [
    "Понять, как блок UpdateAttractor создает силы притяжения",
    "Установить позицию притягивателя, используя координаты Vector3",
    "Контролировать силу притягивателя для настройки интенсивности притяжения",
    "Понять закон обратных квадратов для силы, зависящей от расстояния",
    "Комбинировать притягиватели с другими физическими эффектами"
  ],
  "commonMistakesTitle": "Частые Ошибки",
  "commonMistakes": [
    {
      "mistake": "Использование неправильной системы координат для позиции притягивателя",
      "explanation": "Позиция притягивателя использует 3D координаты (X, Y, Z). Использование 2D координат или неправильной ориентации осей размещает притягиватель в неправильном месте.",
      "solution": "Используйте блок Converter с входами Float X, Y, Z для создания Vector3 для позиции притягивателя. Помните: Y обычно вверх в 3D пространстве, X - вправо, Z - вперед/назад."
    },
    {
      "mistake": "Использование значений силы, которые слишком высоки или слишком низки",
      "explanation": "Значения силы, которые слишком высоки, заставляют частицы мгновенно притягиваться к притягивателю. Значения, которые слишком низки, создают едва заметные эффекты.",
      "solution": "Начните с умеренных значений силы (0.5 до 2.0) и настраивайте в зависимости от желаемого эффекта. Более высокие значения для сильного притяжения, более низкие значения для тонкого притяжения."
    },
    {
      "mistake": "Размещение блока UpdateAttractor в неправильной позиции в цепочке",
      "explanation": "Блок UpdateAttractor изменяет направление частиц, поэтому он должен идти перед блоком UpdatePosition. Размещение его после обновлений позиции не повлияет на движение правильно.",
      "solution": "Соединяйте блоки в порядке: UpdateAttractor → UpdatePosition → UpdateColor → System. Притягиватель изменяет направление, затем позиция использует это направление. Подключите блоки в этом порядке в редакторе."
    }
  ],
  "homeworkTitle": "Упражнения для Практики",
  "homework": [
    "Попробуйте разные позиции притягивателя (сверху, снизу, сбоку)",
    "Экспериментируйте с разными значениями силы (0.1 до 10.0)",
    "Создайте несколько притягивателей, соединяя несколько блоков UpdateAttractor",
    "Комбинируйте притягиватели с гравитацией для сложных паттернов движения",
    "Попробуйте создать отталкиватель, используя отрицательные значения силы (если поддерживается)"
  ]
}