{
  "title": "3.2: Advanced Movement and Physics",
  "summary": "Learn to combine speed control and drag effects to create realistic particle physics",
  "introTitle": "Introduction",
  "intro": "In this lesson, you'll learn how to combine speed control and drag effects to create realistic particle physics. You'll use ParticleLerpBlock to create speed transitions (fast to slow), and combine it with drag calculations to simulate air resistance. By combining both effects, you create particles that start fast, slow down over time, and experience drag - creating more natural, physics-based movement.",
  "stepsTitle": "Step-by-Step Instructions",
  "steps": [
    "Create a SystemBlock - this is the root of your particle system",
    "Create a CreateParticleBlock to emit particles",
    "Set an initial color and size using ParticleInputBlock",
    "Add a <filter-value>CylinderShape</filter-value> block to emit particles from a cylinder volume",
    "Get the particle's direction and direction scale using ParticleInputBlock",
    "Get the particle's age and lifetime to create time-based physics",
    "Calculate the age ratio (age / lifetime) to get a value from 0 to 1",
    "PART 1 - Speed Control: Use ParticleLerpBlock to interpolate between start speed (2.0) and end speed (0.5)",
    "PART 2 - Drag Effect: Use ParticleLerpBlock to interpolate drag from 0.0 to 0.6",
    "Calculate drag factor: (1 - drag) to reduce speed",
    "Combine both effects: speedLerp * (1 - dragLerp)",
    "Multiply the base direction scale by the combined factor",
    "Calculate the scaled direction and add it to position"
  ],
  "blocksTitle": "Blocks Used in This Lesson",
  "blocks": [
    {
      "name": "ParticleInputBlock (DirectionScale)",
      "description": "Retrieves the direction scale of a particle. DirectionScale is a multiplier that determines how far a particle moves each frame. It's multiplied by the direction vector to get the actual movement distance.",
      "properties": [
        {
          "name": "contextualValue",
          "value": "NodeParticleContextualSources.DirectionScale",
          "description": "The type of contextual data - DirectionScale in this case"
        }
      ]
    },
    {
      "name": "ParticleInputBlock (Direction)",
      "description": "Retrieves the current direction vector of a particle. Direction represents the velocity vector, and when multiplied by DirectionScale, gives the actual movement per frame.",
      "properties": [
        {
          "name": "contextualValue",
          "value": "NodeParticleContextualSources.Direction",
          "description": "The type of contextual data - Direction in this case"
        }
      ]
    },
    {
      "name": "ParticleLerpBlock (Speed)",
      "description": "Interpolates between two speed values based on age ratio. Used to create smooth speed transitions (e.g., fast to slow, slow to fast).",
      "properties": [
        {
          "name": "left",
          "value": "Float input (start speed)",
          "description": "The starting speed value (when gradient = 0)"
        },
        {
          "name": "right",
          "value": "Float input (end speed)",
          "description": "The ending speed value (when gradient = 1)"
        },
        {
          "name": "gradient",
          "value": "Float input (age ratio)",
          "description": "The interpolation factor based on particle age"
        }
      ]
    },
    {
      "name": "ParticleMathBlock (Multiply)",
      "description": "Multiplies two values. Used to multiply direction scale by speed multiplier, and to multiply direction by the modified scale to get the final movement vector.",
      "properties": [
        {
          "name": "operation",
          "value": "ParticleMathBlockOperations.Multiply",
          "description": "The mathematical operation - Multiply"
        }
      ]
    }
  ],
  "properties": "Properties",
  "codeTitle": "Code Explanation",
  "codeCopy": "This lesson demonstrates combining speed control and drag effects. The key concept is combining multiple physics effects: speedLerp controls the base speed transition (fast to slow), while dragLerp simulates air resistance (increasing over time). The combined formula is: finalScale = directionScale * speedLerp * (1 - dragLerp). This creates particles that start fast (speedLerp = 2.0, drag = 0), gradually slow down (speedLerp decreases to 0.5), and experience increasing drag (drag increases to 0.6). The result is realistic physics where particles decelerate both from speed reduction and air resistance.",
  "objectivesTitle": "Learning Objectives",
  "objectives": [
    "Combine speed control and drag effects for realistic physics",
    "Use ParticleLerpBlock to create smooth speed transitions",
    "Understand DirectionScale and how it affects particle movement",
    "Calculate drag effects using (1 - drag) formula",
    "Combine multiple physics effects: speedLerp * (1 - dragLerp)"
  ],
  "commonMistakesTitle": "Common Mistakes",
  "commonMistakes": [
    {
      "mistake": "Not multiplying by delta time for drag calculations",
      "explanation": "Drag should be frame-rate independent. If you're using drag in physics calculations, make sure to multiply by delta time for consistency.",
      "solution": "For physics-based drag, multiply drag by delta time: dragFactor = 1 - (drag * deltaTime). However, in this lesson we use age-based drag which doesn't require delta time."
    },
    {
      "mistake": "Using wrong formula for combined effects",
      "explanation": "The combined formula should multiply speedLerp by (1 - dragLerp), not add them. Adding would create incorrect physics behavior.",
      "solution": "Use multiplication: finalScale = directionScale * speedLerp * (1 - dragLerp). This ensures both effects work together correctly."
    },
    {
      "mistake": "Confusing DirectionScale with Direction",
      "explanation": "DirectionScale is a multiplier for how far particles move, while Direction is the velocity vector. They work together: movement = Direction * DirectionScale.",
      "solution": "DirectionScale controls speed (distance per frame), Direction controls direction (which way). Modify DirectionScale to change speed, modify Direction to change direction."
    }
  ],
  "homeworkTitle": "Practice Exercises",
  "homework": [
    "Try reversing the speed transition (start slow, end fast)",
    "Create particles that speed up in the middle of their lifetime",
    "Experiment with different speed ranges (e.g., 0.1 to 3.0)",
    "Combine speed control with color transitions for more dynamic effects",
    "Try using non-linear speed curves by modifying the age ratio with math operations"
  ]
}