{
  "title": "3.3: Притягиватели",
  "summary": "Научитесь создавать притягиватели частиц, которые притягивают частицы к определенным точкам в пространстве",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь использовать UpdateAttractorBlock для создания притягивателей, которые притягивают частицы к определенным точкам в пространстве. Притягиватели полезны для создания эффектов, таких как частицы, притягиваемые к черной дыре, магнитным полям или гравитационным колодцам. Вы научитесь устанавливать позицию притягивателя, силу и комбинировать притягиватели с другими эффектами.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте SystemBlock - это корень вашей системы частиц",
    "Создайте CreateParticleBlock для эмиссии частиц",
    "Установите начальный цвет и размер используя ParticleInputBlock",
    "Добавьте <filter-value>BoxShape</filter-value> блок для эмиссии частиц из объема куба",
    "Добавьте UpdateAttractorBlock для изменения направления частиц (должен быть перед UpdatePositionBlock)",
    "Создайте позицию притягивателя, используя ParticleConverterBlock (координаты X, Y, Z)",
    "Установите силу притягивателя (большие значения = сильнее притяжение)",
    "Подключите позицию притягивателя к входу attractor блока UpdateAttractorBlock",
    "Подключите значение силы к входу strength блока UpdateAttractorBlock",
    "Добавьте UpdatePositionBlock после UpdateAttractorBlock для базового движения",
    "Притягиватель сначала изменяет направление частиц, затем позиция обновляется на основе измененного направления"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "UpdateAttractorBlock",
      "description": "Создает эффект притягивателя, который притягивает частицы к определенной точке в 3D пространстве. Сила уменьшается с квадратом расстояния, создавая реалистичное физическое поведение.",
      "properties": [
        {
          "name": "name",
          "value": "'Attractor'",
          "description": "Отображаемое имя блока"
        },
        {
          "name": "attractor",
          "value": "Vector3 input",
          "description": "Позиция притягивателя в 3D пространстве (координаты X, Y, Z)"
        },
        {
          "name": "strength",
          "value": "Float input",
          "description": "Сила силы притяжения. Большие значения создают более сильное притяжение. Сила обратно пропорциональна квадрату расстояния."
        }
      ]
    },
    {
      "name": "ParticleConverterBlock (Vector3)",
      "description": "Создает Vector3 из отдельных значений Float X, Y, Z. Используется для определения позиции притягивателя.",
      "properties": [
        {
          "name": "xIn, yIn, zIn",
          "value": "Float inputs",
          "description": "Отдельные входы Float для компонентов X, Y, Z"
        },
        {
          "name": "xyzOut",
          "value": "Vector3 output",
          "description": "Объединенный выход Vector3"
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Этот урок демонстрирует физику притягивателей. Притягиватель создает силу, которая притягивает частицы к целевой точке. Формула для силы: force = (strength / distance²) * direction, где direction - это нормализованный вектор от частицы к притягивателю. Это создает реалистичное поведение, где частицы близко к притягивателю испытывают сильное притяжение, в то время как далекие частицы испытывают слабое притяжение. Притягиватели полезны для создания эффектов, таких как частицы, вращающиеся вокруг центра, притягиваемые к цели, или создающие вихреобразные паттерны.",
  "objectivesTitle": "Цели Обучения",
  "objectives": [
    "Понять, как UpdateAttractorBlock создает силы притяжения",
    "Установить позицию притягивателя, используя координаты Vector3",
    "Контролировать силу притягивателя для настройки интенсивности притяжения",
    "Понять закон обратных квадратов для силы, зависящей от расстояния",
    "Комбинировать притягиватели с другими физическими эффектами"
  ],
  "commonMistakesTitle": "Частые Ошибки",
  "commonMistakes": [
    {
      "mistake": "Использование неправильной системы координат для позиции притягивателя",
      "explanation": "Позиция притягивателя использует 3D координаты (X, Y, Z). Использование 2D координат или неправильной ориентации осей размещает притягиватель в неправильном месте.",
      "solution": "Используйте ParticleConverterBlock с xIn, yIn, zIn для создания Vector3 для позиции притягивателя. Помните: Y обычно вверх в 3D пространстве, X - вправо, Z - вперед/назад."
    },
    {
      "mistake": "Использование значений силы, которые слишком высоки или слишком низки",
      "explanation": "Значения силы, которые слишком высоки, заставляют частицы мгновенно притягиваться к притягивателю. Значения, которые слишком низки, создают едва заметные эффекты.",
      "solution": "Начните с умеренных значений силы (0.5 до 2.0) и настраивайте в зависимости от желаемого эффекта. Более высокие значения для сильного притяжения, более низкие значения для тонкого притяжения."
    },
    {
      "mistake": "Размещение UpdateAttractorBlock в неправильной позиции в цепочке",
      "explanation": "UpdateAttractorBlock изменяет направление частиц, поэтому он должен идти перед UpdatePositionBlock. Размещение его после обновлений позиции не повлияет на движение правильно.",
      "solution": "Соединяйте блоки в порядке: UpdateAttractorBlock → UpdatePositionBlock → UpdateColorBlock → SystemBlock. Притягиватель изменяет направление, затем позиция использует это направление."
    }
  ],
  "homeworkTitle": "Упражнения для Практики",
  "homework": [
    "Попробуйте разные позиции притягивателя (сверху, снизу, сбоку)",
    "Экспериментируйте с разными значениями силы (0.1 до 10.0)",
    "Создайте несколько притягивателей, соединяя несколько UpdateAttractorBlocks",
    "Комбинируйте притягиватели с гравитацией для сложных паттернов движения",
    "Попробуйте создать отталкиватель, используя отрицательные значения силы (если поддерживается)"
  ]
}