{
  "title": "3.2: Продвинутое Движение и Физика",
  "summary": "Научитесь комбинировать контроль скорости и эффекты сопротивления для создания реалистичной физики частиц",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь комбинировать контроль скорости и эффекты сопротивления для создания реалистичной физики частиц. Вы будете использовать ParticleLerpBlock для создания переходов скорости (быстро к медленно) и комбинировать его с расчетами сопротивления для симуляции сопротивления воздуха. Комбинируя оба эффекта, вы создаете частицы, которые начинают быстро, замедляются со временем и испытывают сопротивление - создавая более естественное, основанное на физике движение.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте SystemBlock - это корень вашей системы частиц",
    "Создайте CreateParticleBlock для эмиссии частиц",
    "Установите начальный цвет и размер используя ParticleInputBlock",
    "Добавьте <filter-value>CylinderShape</filter-value> блок для эмиссии частиц из объема цилиндра",
    "Получите направление и масштаб направления частицы, используя ParticleInputBlock",
    "Получите возраст и время жизни частицы для создания физики на основе времени",
    "Вычислите соотношение возраста (возраст / время жизни) для получения значения от 0 до 1",
    "ЧАСТЬ 1 - Контроль Скорости: Используйте ParticleLerpBlock для интерполяции между начальной скоростью (2.0) и конечной скоростью (0.5)",
    "ЧАСТЬ 2 - Эффект Сопротивления: Используйте ParticleLerpBlock для интерполяции сопротивления от 0.0 до 0.6",
    "Вычислите фактор сопротивления: (1 - сопротивление) для уменьшения скорости",
    "Объедините оба эффекта: скоростьЛерп * (1 - сопротивлениеЛерп)",
    "Умножьте базовый масштаб направления на объединенный фактор",
    "Вычислите масштабированное направление и добавьте его к позиции"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "ParticleInputBlock (DirectionScale)",
      "description": "Получает масштаб направления частицы. DirectionScale - это множитель, который определяет, как далеко частица перемещается каждый кадр. Он умножается на вектор направления, чтобы получить фактическое расстояние движения.",
      "properties": [
        {
          "name": "contextualValue",
          "value": "NodeParticleContextualSources.DirectionScale",
          "description": "Тип контекстных данных - DirectionScale в данном случае"
        }
      ]
    },
    {
      "name": "ParticleInputBlock (Direction)",
      "description": "Получает текущий вектор направления частицы. Направление представляет вектор скорости, и при умножении на DirectionScale дает фактическое движение за кадр.",
      "properties": [
        {
          "name": "contextualValue",
          "value": "NodeParticleContextualSources.Direction",
          "description": "Тип контекстных данных - Direction в данном случае"
        }
      ]
    },
    {
      "name": "ParticleLerpBlock (Speed)",
      "description": "Интерполирует между двумя значениями скорости на основе соотношения возраста. Используется для создания плавных переходов скорости (например, от быстрой к медленной, от медленной к быстрой).",
      "properties": [
        {
          "name": "left",
          "value": "Float input (начальная скорость)",
          "description": "Начальное значение скорости (когда gradient = 0)"
        },
        {
          "name": "right",
          "value": "Float input (конечная скорость)",
          "description": "Конечное значение скорости (когда gradient = 1)"
        },
        {
          "name": "gradient",
          "value": "Float input (соотношение возраста)",
          "description": "Фактор интерполяции на основе возраста частицы"
        }
      ]
    },
    {
      "name": "ParticleMathBlock (Multiply)",
      "description": "Умножает два значения. Используется для умножения масштаба направления на множитель скорости и для умножения направления на модифицированный масштаб, чтобы получить финальный вектор движения.",
      "properties": [
        {
          "name": "operation",
          "value": "ParticleMathBlockOperations.Multiply",
          "description": "Математическая операция - Multiply"
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Этот урок демонстрирует комбинирование контроля скорости и эффектов сопротивления. Ключевая концепция заключается в комбинировании нескольких физических эффектов: скоростьЛерп контролирует базовый переход скорости (быстро к медленно), в то время как сопротивлениеЛерп симулирует сопротивление воздуха (увеличивается со временем). Объединенная формула: финальныйМасштаб = масштабНаправления * скоростьЛерп * (1 - сопротивлениеЛерп). Это создает частицы, которые начинают быстро (скоростьЛерп = 2.0, сопротивление = 0), постепенно замедляются (скоростьЛерп уменьшается до 0.5) и испытывают увеличивающееся сопротивление (сопротивление увеличивается до 0.6). Результат - реалистичная физика, где частицы замедляются как от уменьшения скорости, так и от сопротивления воздуха.",
  "objectivesTitle": "Цели Обучения",
  "objectives": [
    "Комбинировать контроль скорости и эффекты сопротивления для реалистичной физики",
    "Использовать ParticleLerpBlock для создания плавных переходов скорости",
    "Понять DirectionScale и как это влияет на движение частиц",
    "Вычислять эффекты сопротивления, используя формулу (1 - drag)",
    "Комбинировать несколько физических эффектов: speedLerp * (1 - dragLerp)"
  ],
  "commonMistakesTitle": "Частые Ошибки",
  "commonMistakes": [
    {
      "mistake": "Не умножение на delta time для расчетов сопротивления",
      "explanation": "Сопротивление должно быть независимым от частоты кадров. Если вы используете сопротивление в физических расчетах, убедитесь, что умножаете на delta time для постоянства.",
      "solution": "Для физического сопротивления умножайте сопротивление на delta time: dragFactor = 1 - (drag * deltaTime). Однако в этом уроке мы используем сопротивление на основе возраста, которое не требует delta time."
    },
    {
      "mistake": "Использование неправильной формулы для комбинированных эффектов",
      "explanation": "Комбинированная формула должна умножать speedLerp на (1 - dragLerp), а не складывать их. Сложение создаст неправильное физическое поведение.",
      "solution": "Используйте умножение: finalScale = directionScale * speedLerp * (1 - dragLerp). Это обеспечивает правильную работу обоих эффектов вместе."
    },
    {
      "mistake": "Путаница между DirectionScale и Direction",
      "explanation": "DirectionScale - это множитель того, как далеко движутся частицы, в то время как Direction - это вектор скорости. Они работают вместе: движение = Direction * DirectionScale.",
      "solution": "DirectionScale контролирует скорость (расстояние за кадр), Direction контролирует направление (в какую сторону). Изменяйте DirectionScale для изменения скорости, изменяйте Direction для изменения направления."
    }
  ],
  "homeworkTitle": "Упражнения для Практики",
  "homework": [
    "Попробуйте обратить переход скорости (начать медленно, закончить быстро)",
    "Создайте частицы, которые ускоряются в середине своей жизни",
    "Экспериментируйте с разными диапазонами скорости (например, 0.1 до 3.0)",
    "Комбинируйте управление скоростью с цветовыми переходами для более динамичных эффектов",
    "Попробуйте использовать нелинейные кривые скорости, модифицируя соотношение возраста математическими операциями"
  ]
}