{
  "title": "3.2: Продвинутое Движение и Физика",
  "summary": "Научитесь комбинировать контроль скорости и эффекты сопротивления для создания реалистичной физики частиц",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь комбинировать контроль скорости и эффекты сопротивления для создания реалистичной физики частиц. Вы будете использовать Lerp блок для создания переходов скорости (быстро к медленно) и комбинировать его с расчетами сопротивления для симуляции сопротивления воздуха. Комбинируя оба эффекта, вы создаете частицы, которые начинают быстро, замедляются со временем и испытывают сопротивление - создавая более естественное, основанное на физике движение.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте <filter-value>System</filter-value> блок - это корень вашей системы частиц",
    "Добавьте <filter-value>Texture</filter-value> блок для предоставления текстуры частицам и подключите к System блоку",
    "Загрузите <textures>flare.png</textures> с помощью кнопки загрузки в свойствах Texture блока",
    "Добавьте <filter-value>CreateParticle</filter-value> блок для эмиссии частиц и подключите к System блоку",
    "Добавьте <filter-value>Color4</filter-value> блок и установите его значение на базовый цвет",
    "Подключите выход Color4 блока к входу color блока CreateParticle",
    "Добавьте <filter-value>Float</filter-value> блок и установите его значение для базового размера",
    "Подключите выход Float блока к входу size блока CreateParticle",
    "Добавьте <filter-value>CylinderShape</filter-value> блок для эмиссии частиц из объема цилиндра и подключите между CreateParticle и System блоками",
    "Добавьте <filter-value>UpdatePosition</filter-value> блок для обработки движения частиц и подключите между CylinderShape и System блоками",
    "Добавьте <filter-value>DirectionScale</filter-value> блок для получения масштаба направления частицы",
    "Добавьте <filter-value>Age</filter-value> блок и <filter-value>Lifetime</filter-value> блок для создания физики на основе времени",
    "Добавьте математический <filter-value>Divide</filter-value> блок для вычисления соотношения возраста и подключите Age блок к левому входу и Lifetime блок к правому входу",
    "ЧАСТЬ 1 - Контроль Скорости: Добавьте <filter-value>Lerp</filter-value> блок для интерполяции между начальной скоростью (2.0) и конечной скоростью (0.5)",
    "Добавьте <filter-value>Float</filter-value> блоки со значениями 2.0 и 0.5 для начальной и конечной скоростей",
    "Подключите Float блоки к входам min и max блока Lerp, и соотношение возраста к входу factor блока Lerp",
    "ЧАСТЬ 2 - Эффект Сопротивления: Добавьте еще один <filter-value>Lerp</filter-value> блок для интерполяции сопротивления от 0.0 до 0.6",
    "Добавьте <filter-value>Float</filter-value> блоки со значениями 0.0 и 0.6 для min и max сопротивления",
    "Подключите Float блоки к входам min и max блока Lerp, и соотношение возраста к входу factor блока Lerp",
    "Добавьте математический <filter-value>Subtract</filter-value> блок для вычисления фактора сопротивления: (1 - сопротивление)",
    "Добавьте <filter-value>Float</filter-value> блок со значением 1.0 и подключите к левому входу Subtract блока",
    "Подключите выход Lerp блока сопротивления к правому входу Subtract блока",
    "Добавьте математический <filter-value>Multiply</filter-value> блок для объединения обоих эффектов: скоростьЛерп * (1 - сопротивлениеЛерп)",
    "Подключите выход Lerp блока скорости к левому входу Multiply блока и фактор сопротивления из Subtract блока к правому входу",
    "Добавьте еще один математический <filter-value>Multiply</filter-value> блок для умножения базового масштаба направления на объединенный фактор",
    "Подключите DirectionScale блок к левому входу Multiply блока и объединенный фактор к правому входу",
    "Добавьте <filter-value>ScaledDirection</filter-value> блок и подключите результат из Multiply блока к нему",
    "Добавьте <filter-value>Position</filter-value> блок и математический <filter-value>Add</filter-value> блок",
    "Подключите Position и ScaledDirection блоки к левому и правому входам Add блока соответственно",
    "Подключите результат из Add блока к входу position блока UpdatePosition"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "Input Block (Direction Scale)",
      "description": "Получает масштаб направления частицы. Direction Scale - это множитель, который определяет, как далеко частица перемещается каждый кадр. Он умножается на вектор направления, чтобы получить фактическое расстояние движения. В визуальном редакторе вы можете найти этот блок в списке блоков и установить его контекстное значение на Direction Scale в панели свойств справа.",
      "properties": [
        {
          "name": "Contextual Value",
          "value": "Direction Scale",
          "description": "Тип контекстных данных - Direction Scale в данном случае. Установите это в панели свойств справа от редактора."
        }
      ]
    },
    {
      "name": "Input Block (Direction)",
      "description": "Получает текущий вектор направления частицы. Направление представляет вектор скорости, и при умножении на Direction Scale дает фактическое движение за кадр. В визуальном редакторе вы можете найти этот блок в списке блоков и установить его контекстное значение на Direction в панели свойств справа.",
      "properties": [
        {
          "name": "Contextual Value",
          "value": "Direction",
          "description": "Тип контекстных данных - Direction в данном случае. Установите это в панели свойств справа от редактора."
        }
      ]
    },
    {
      "name": "Lerp Block",
      "description": "Интерполирует между двумя значениями на основе фактора градиента. Используется для создания плавных переходов (например, от быстрой к медленной, от медленной к быстрой). В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "Min",
          "value": "Float input (начальное значение)",
          "description": "Начальное значение (когда gradient = 0). Подключите Float блок к этому входу."
        },
        {
          "name": "Max",
          "value": "Float input (конечное значение)",
          "description": "Конечное значение (когда gradient = 1). Подключите Float блок к этому входу."
        },
        {
          "name": "Gradient",
          "value": "Float input (соотношение возраста)",
          "description": "Фактор интерполяции на основе возраста частицы. Подключите соотношение возраста (0 до 1) к этому входу."
        }
      ]
    },
    {
      "name": "Math Block (Multiply)",
      "description": "Умножает два значения. Используется для умножения масштаба направления на множитель скорости и для умножения направления на модифицированный масштаб, чтобы получить финальный вектор движения. В визуальном редакторе вы можете найти этот блок в списке блоков и установить его операцию на Multiply в панели свойств справа.",
      "properties": [
        {
          "name": "Operation",
          "value": "Multiply",
          "description": "Математическая операция - Multiply. Установите это в панели свойств справа от редактора."
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Этот урок демонстрирует комбинирование контроля скорости и эффектов сопротивления. Ключевая концепция заключается в комбинировании нескольких физических эффектов: скоростьЛерп контролирует базовый переход скорости (быстро к медленно), в то время как сопротивлениеЛерп симулирует сопротивление воздуха (увеличивается со временем). Объединенная формула: финальныйМасштаб = масштабНаправления * скоростьЛерп * (1 - сопротивлениеЛерп). Это создает частицы, которые начинают быстро (скоростьЛерп = 2.0, сопротивление = 0), постепенно замедляются (скоростьЛерп уменьшается до 0.5) и испытывают увеличивающееся сопротивление (сопротивление увеличивается до 0.6). Результат - реалистичная физика, где частицы замедляются как от уменьшения скорости, так и от сопротивления воздуха.",
  "objectivesTitle": "Цели Обучения",
  "objectives": [
    "Комбинировать контроль скорости и эффекты сопротивления для реалистичной физики",
    "Использовать Lerp блок для создания плавных переходов скорости",
    "Понять DirectionScale и как это влияет на движение частиц",
    "Вычислять эффекты сопротивления, используя формулу (1 - drag)",
    "Комбинировать несколько физических эффектов: speedLerp * (1 - dragLerp)"
  ],
  "commonMistakesTitle": "Частые Ошибки",
  "commonMistakes": [
    {
      "mistake": "Не умножение на delta time для расчетов сопротивления",
      "explanation": "Сопротивление должно быть независимым от частоты кадров. Если вы используете сопротивление в физических расчетах, убедитесь, что умножаете на delta time для постоянства.",
      "solution": "Для физического сопротивления умножайте сопротивление на delta time: dragFactor = 1 - (drag * deltaTime). Однако в этом уроке мы используем сопротивление на основе возраста, которое не требует delta time."
    },
    {
      "mistake": "Использование неправильной формулы для комбинированных эффектов",
      "explanation": "Комбинированная формула должна умножать speedLerp на (1 - dragLerp), а не складывать их. Сложение создаст неправильное физическое поведение.",
      "solution": "Используйте умножение: finalScale = directionScale * speedLerp * (1 - dragLerp). Это обеспечивает правильную работу обоих эффектов вместе."
    },
    {
      "mistake": "Путаница между DirectionScale и Direction",
      "explanation": "DirectionScale - это множитель того, как далеко движутся частицы, в то время как Direction - это вектор скорости. Они работают вместе: движение = Direction * DirectionScale.",
      "solution": "DirectionScale контролирует скорость (расстояние за кадр), Direction контролирует направление (в какую сторону). Изменяйте DirectionScale для изменения скорости, изменяйте Direction для изменения направления."
    }
  ],
  "homeworkTitle": "Упражнения для Практики",
  "homework": [
    "Попробуйте обратить переход скорости (начать медленно, закончить быстро)",
    "Создайте частицы, которые ускоряются в середине своей жизни",
    "Экспериментируйте с разными диапазонами скорости (например, 0.1 до 3.0)",
    "Комбинируйте управление скоростью с цветовыми переходами для более динамичных эффектов",
    "Попробуйте использовать нелинейные кривые скорости, модифицируя соотношение возраста математическими операциями"
  ]
}