{
  "title": "3.3: Attractors",
  "summary": "Learn to create particle attractors that pull particles toward specific points in space",
  "introTitle": "Introduction",
  "intro": "In this lesson, you'll learn how to use UpdateAttractor block to create attractors that pull particles toward specific points in space. Attractors are useful for creating effects like particles being pulled toward a black hole, magnetic fields, or gravitational wells. You'll learn to set attractor position, strength, and combine attractors with other effects.",
  "stepsTitle": "Step-by-Step Instructions",
  "steps": [
    "Create a <filter-value>System</filter-value> block - this is the root of your particle system",
    "Add a <filter-value>Texture</filter-value> block to provide a texture for the particles and connect to System block",
    "Load a <textures>flare.png</textures> by load button in the Texture block properties",
    "Add a <filter-value>CreateParticle</filter-value> block to emit particles and connect to System block",
    "Add a <filter-value>Color4</filter-value> block and set its value to a base color",
    "Connect the Color4 block's output to CreateParticle block's color input",
    "Add a <filter-value>Float</filter-value> block and set its value for base size",
    "Connect the Float block's output to CreateParticle block's size input",
    "Add a <filter-value>BoxShape</filter-value> block to emit particles from a box volume and connect between CreateParticle and System blocks",
    "Add an <filter-value>UpdateAttractor</filter-value> block to modify particle direction and connect between BoxShape and System blocks",
    "Add a <filter-value>Converter</filter-value> block to create an attractor position vector (X, Y, Z coordinates)",
    "Add <filter-value>Float</filter-value> blocks with values for X, Y, Z coordinates (e.g., 0, 5, 0 for position above origin)",
    "Connect the Float blocks to Converter block's X, Y, and Z inputs respectively",
    "Add a <filter-value>Float</filter-value> block and set its value for attractor strength (e.g., 1.0)",
    "Connect the Converter block's Vector3 output to UpdateAttractor block's attractor input",
    "Connect the strength Float block's output to UpdateAttractor block's strength input",
    "Add an <filter-value>UpdatePosition</filter-value> block after UpdateAttractor block and connect between UpdateAttractor and System blocks",
    "Add an <filter-value>UpdateColor</filter-value> block after UpdatePosition block and connect between UpdatePosition and System blocks",
    "Add an <filter-value>UpdateSize</filter-value> block after UpdateColor block and connect between UpdateColor and System blocks"
  ],
  "blocksTitle": "Blocks Used in This Lesson",
  "blocks": [
    {
      "name": "Update Attractor Block",
      "description": "Creates an attractor effect that pulls particles toward a specific point in 3D space. The force decreases with distance squared, creating realistic physics behavior. In the visual editor, you can find this block in the block list and configure its properties in the properties panel on the right.",
      "properties": [
        {
          "name": "Name",
          "value": "'Attractor'",
          "description": "The display name of the block. Set this in the properties panel on the right side of the editor."
        },
        {
          "name": "Attractor",
          "value": "Vector3 input",
          "description": "The position of the attractor in 3D space (X, Y, Z coordinates). Connect a Vector3 output to this input."
        },
        {
          "name": "Strength",
          "value": "Float input",
          "description": "The strength of the attraction force. Higher values create stronger pull. The force is inversely proportional to distance squared. Connect a Float block to this input."
        }
      ]
    },
    {
      "name": "Converter Block",
      "description": "Creates a Vector3 from individual X, Y, Z float values. Used to define the attractor position. In the visual editor, you can find this block in the block list and configure its properties in the properties panel on the right.",
      "properties": [
        {
          "name": "Inputs (X, Y, Z)",
          "value": "Float inputs",
          "description": "Individual float inputs for X, Y, Z components. Connect Float blocks to these inputs."
        },
        {
          "name": "Vector3 Output",
          "value": "Vector3 output",
          "description": "The combined Vector3 output. Use this output when creating 3D vectors."
        }
      ]
    }
  ],
  "properties": "Properties",
  "codeTitle": "Code Explanation",
  "codeCopy": "This lesson demonstrates attractor physics. An attractor creates a force that pulls particles toward a target point. The formula for the force is: force = (strength / distance²) * direction, where direction is the normalized vector from particle to attractor. This creates realistic behavior where particles close to the attractor experience strong pull, while distant particles experience weaker pull. Attractors are useful for creating effects like particles orbiting a center, being drawn to a target, or creating vortex-like patterns.",
  "objectivesTitle": "Learning Objectives",
  "objectives": [
    "Understand how UpdateAttractor block creates attractive forces",
    "Set attractor position using Vector3 coordinates",
    "Control attractor strength to adjust pull intensity",
    "Understand inverse square law for distance-based force",
    "Combine attractors with other physics effects"
  ],
  "commonMistakesTitle": "Common Mistakes",
  "commonMistakes": [
    {
      "mistake": "Using wrong coordinate system for attractor position",
      "explanation": "Attractor position uses 3D coordinates (X, Y, Z). Using 2D coordinates or wrong axis orientation places the attractor in the wrong location.",
      "solution": "Use Converter block with X, Y, Z Float inputs to create Vector3 for attractor position. Remember: Y is typically up in 3D space, X is right, Z is forward/backward."
    },
    {
      "mistake": "Using strength values that are too high or too low",
      "explanation": "Strength values that are too high cause particles to snap instantly to the attractor. Values that are too low create barely noticeable effects.",
      "solution": "Start with moderate strength values (0.5 to 2.0) and adjust based on desired effect. Higher values for strong pull, lower values for subtle attraction."
    },
    {
      "mistake": "Placing UpdateAttractor block in wrong position in the chain",
      "explanation": "UpdateAttractor block modifies particle direction, so it should come before UpdatePosition block. Placing it after position updates won't affect movement correctly.",
      "solution": "Chain blocks in order: UpdateAttractor → UpdatePosition → UpdateColor → System. Attractor modifies direction, then position uses that direction. Connect blocks in this order in the editor."
    }
  ],
  "homeworkTitle": "Practice Exercises",
  "homework": [
    "Try different attractor positions (above, below, to the side)",
    "Experiment with different strength values (0.1 to 10.0)",
    "Create multiple attractors by chaining multiple <filter-value>UpdateAttractor</filter-value> blocks",
    "Combine attractors with gravity for complex motion patterns",
    "Try creating a repeller by using negative strength values (if supported)"
  ]
}