{
  "title": "6.1: Угол и Вращение",
  "summary": "Научитесь управлять вращением частиц, используя UpdateAngleBlock и AlignAngleBlock",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь управлять вращением и углом частиц. Вы будете использовать UpdateAngleBlock для установки вращения частиц на основе расчетов (например, вращение на основе времени) и узнаете об AlignAngleBlock, который автоматически выравнивает частицы по их направлению. Вращение необходимо для создания эффектов, таких как вращающиеся частицы, направленные спрайты и анимированные текстуры.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте SystemBlock - это корень вашей системы частиц",
    "Создайте CreateParticleBlock для эмиссии частиц",
    "Установите начальный цвет и размер используя ParticleInputBlock",
    "Добавьте PointShapeBlock для эмиссии частиц из одной точки",
    "Получите системное время, используя ParticleInputBlock с системным источником Time",
    "Создайте значение скорости вращения (оборотов в секунду)",
    "Вычислите угол вращения: время * скоростьВращения",
    "Добавьте UpdateAngleBlock для обновления угла частиц",
    "Подключите угол вращения к входу angle блока UpdateAngleBlock",
    "Опционально используйте AlignAngleBlock для выравнивания частиц по их направлению",
    "Наблюдайте, как частицы вращаются непрерывно на основе времени"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "UpdateAngleBlock",
      "description": "Обновляет угол вращения частиц. Угол указывается в радианах и определяет, как частицы вращаются.",
      "properties": [
        {
          "name": "name",
          "value": "'Update Angle'",
          "description": "Отображаемое имя блока"
        },
        {
          "name": "angle",
          "value": "Float input",
          "description": "Угол вращения в радианах"
        }
      ]
    },
    {
      "name": "AlignAngleBlock",
      "description": "Автоматически выравнивает угол частицы по ее вектору направления. Полезно для создания частиц, которые обращены в направлении движения.",
      "properties": [
        {
          "name": "name",
          "value": "'Align Angle'",
          "description": "Отображаемое имя блока"
        },
        {
          "name": "alignment",
          "value": "Float (по умолчанию: Math.PI / 2)",
          "description": "Смещение выравнивания в радианах"
        }
      ]
    },
    {
      "name": "ParticleInputBlock (Time)",
      "description": "Получает системное время для расчетов вращения на основе времени.",
      "properties": [
        {
          "name": "systemSource",
          "value": "NodeParticleSystemSources.Time",
          "description": "Системный источник - Time для системного времени"
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Этот урок демонстрирует управление вращением частиц. UpdateAngleBlock позволяет устанавливать вращение частиц на основе расчетов - в данном случае, вращение на основе времени, где угол = время * скоростьВращения. Это создает непрерывное вращение. AlignAngleBlock автоматически вычисляет угол, необходимый для выравнивания частиц с их вектором направления, что полезно для направленных спрайтов. Вращение указывается в радианах (2π = 360 градусов) и может комбинироваться с другими эффектами, такими как изменения цвета или вариации размера.",
  "objectivesTitle": "Цели Обучения",
  "objectives": [
    "Контролировать вращение частиц, используя UpdateAngleBlock",
    "Вычислять углы вращения из времени и скорости",
    "Использовать AlignAngleBlock для выравнивания частиц с их направлением",
    "Понять единицы углов (радианы против градусов)",
    "Комбинировать вращение с другими эффектами частиц"
  ],
  "commonMistakesTitle": "Частые Ошибки",
  "commonMistakes": [
    {
      "mistake": "Использование градусов вместо радианов",
      "explanation": "UpdateAngleBlock ожидает углы в радианах, а не в градусах. Использование градусов (0-360) создает неправильное вращение (частицы вращаются намного больше, чем ожидается).",
      "solution": "Конвертируйте градусы в радианы: радианы = градусы * (Math.PI / 180). Или используйте радианы напрямую: 2π = 360 градусов, π = 180 градусов, π/2 = 90 градусов."
    },
    {
      "mistake": "Неправильное масштабирование скорости вращения",
      "explanation": "Скорость вращения должна быть в радианах в секунду. Использование сырого времени или неправильного масштабирования создает неправильные скорости вращения.",
      "solution": "Вычисляйте вращение: угол = время * скоростьВращения, где скоростьВращения в радианах в секунду. Для 1 оборота в секунду используйте скоростьВращения = 2 * Math.PI."
    },
    {
      "mistake": "Путаница между UpdateAngleBlock и AlignAngleBlock",
      "explanation": "UpdateAngleBlock устанавливает конкретное значение угла, в то время как AlignAngleBlock автоматически вычисляет угол из направления. Использование неправильного создает неправильное вращение.",
      "solution": "Используйте UpdateAngleBlock, когда хотите установить вращение вручную (например, вращение на основе времени). Используйте AlignAngleBlock, когда хотите, чтобы частицы автоматически были обращены в направлении их движения."
    }
  ],
  "homeworkTitle": "Упражнения для Практики",
  "homework": [
    "Попробуйте различные скорости вращения и наблюдайте эффект",
    "Объедините вращение с эффектами на основе возраста (вращайтесь быстрее по мере старения частиц)",
    "Используйте AlignAngleBlock, чтобы частицы были обращены в направлении движения",
    "Объедините вращение с изменениями цвета для более динамичных эффектов",
    "Экспериментируйте с вращением на основе свойств частиц (скорость, возраст и т.д.)"
  ]
}