{
  "title": "6.4: Complex Systems",
  "summary": "Combine all learned concepts to create production-ready complex particle systems",
  "introTitle": "Introduction",
  "intro": "In this final lesson, you'll combine all the concepts learned throughout the course to create a complex, production-ready particle system. You'll create a complete system from scratch that uses multiple techniques including time-based properties, randomness, vector operations, direction updates, and angle rotation.",
  "stepsTitle": "Step-by-Step Instructions",
  "steps": [
    "Create a <filter-value>System</filter-value> block - this is the root of your particle system",
    "Add a <filter-value>Texture</filter-value> block to provide a texture for the particles and connect to System block",
    "Load a texture <textures>flare.png</textures> by load button in the Texture block properties",
    "Add a <filter-value>CreateParticle</filter-value> block to emit particles and connect to System block",
    "Add <filter-value>Float</filter-value> blocks for Min and Max color values and connect to a <filter-value>Random</filter-value> block (set lockMode to OncePerParticle)",
    "Connect Random block's output to CreateParticle block's color input",
    "Add <filter-value>Float</filter-value> blocks for Min and Max size values and connect to another <filter-value>Random</filter-value> block (set lockMode to OncePerParticle)",
    "Connect Random block's output to CreateParticle block's size input",
    "Add a <filter-value>SphereShape</filter-value> block to emit particles from a sphere volume and connect between CreateParticle and System blocks",
    "Add <filter-value>UpdateDirection</filter-value> block after SphereShape to modify particle direction over time",
    "Add a <filter-value>Time</filter-value> block and use it to create direction variation",
    "Add <filter-value>UpdatePosition</filter-value> block after UpdateDirection to handle particle movement",
    "Add an <filter-value>Age</filter-value> block to get the particle's current age",
    "Add a <filter-value>Lifetime</filter-value> block to get the particle's total lifetime",
    "Add a math <filter-value>Divide</filter-value> block to calculate age ratio (Age / Lifetime)",
    "Add a <filter-value>Float</filter-value> block with value 1.0 and a math <filter-value>Subtract</filter-value> block to calculate fade factor (1 - ageRatio)",
    "Add an <filter-value>InitialColor</filter-value> block to get the initial color",
    "Add a math <filter-value>Multiply</filter-value> block to multiply initial color by fade factor for smooth fading",
    "Add <filter-value>UpdateColor</filter-value> block after UpdatePosition and connect the faded color to it",
    "Add <filter-value>UpdateSize</filter-value> block after UpdateColor and use age ratio for time-based size growth",
    "Add a <filter-value>Time</filter-value> block and a <filter-value>Float</filter-value> block for rotation speed",
    "Add a math <filter-value>Multiply</filter-value> block to calculate rotation angle (time * rotationSpeed)",
    "Add <filter-value>UpdateAngle</filter-value> block after UpdateSize and connect rotation angle to it",
    "Connect UpdateAngle output to System block",
    "Observe the complex, multi-layered particle effect"
  ],
  "blocksTitle": "Blocks Used in This Lesson",
  "blocks": [
    {
      "name": "Complex System Integration",
      "description": "This lesson combines multiple blocks and techniques: UpdateDirectionBlock, ParticleRandomBlock, time-based calculations, vector operations, and angle updates. All working together to create a sophisticated effect. In the visual editor, you can find these blocks in the block list and configure their properties in the properties panel on the right.",
      "properties": []
    }
  ],
  "properties": "Properties",
  "codeTitle": "Code Explanation",
  "codeCopy": "Complex particle systems combine multiple techniques to create rich, dynamic effects. This system uses randomness for variation, time-based calculations for evolution over time, direction updates for dynamic movement, and angle rotation for visual interest. The key is organizing these techniques into a coherent block chain that flows logically from creation to final output.",
  "objectivesTitle": "Learning Objectives",
  "objectives": [
    "Combine multiple techniques in one system",
    "Organize complex block chains effectively",
    "Create production-ready particle effects",
    "Understand how different techniques work together",
    "Design sophisticated particle systems from scratch"
  ],
  "commonMistakesTitle": "Common Mistakes",
  "commonMistakes": [
    {
      "mistake": "Overcomplicating the system",
      "explanation": "Adding too many effects can make the system hard to understand and debug. Start simple and add complexity gradually.",
      "solution": "Build systems incrementally. Start with basic movement, then add color, then size, then advanced features. Test at each step."
    },
    {
      "mistake": "Not organizing block chains logically",
      "explanation": "Complex systems need clear organization. Random blocks connected in confusing ways are hard to debug and maintain.",
      "solution": "Organize blocks in logical order: Creation → Shape → Direction → Position → Color → Size → Angle → System. Keep related calculations together."
    }
  ],
  "homeworkTitle": "Practice Exercises",
  "homework": [
    "Create your own complex particle system combining 5+ techniques",
    "Experiment with different combinations of effects",
    "Optimize a complex system for performance",
    "Create a themed effect (fire, magic, explosion) using multiple techniques",
    "Document your complex system for future reference"
  ]
}

