{
  "title": "6.3: Оптимизация Производительности",
  "summary": "Изучите лучшие практики для оптимизации производительности систем частиц",
  "introTitle": "Введение",
  "intro": "В этом уроке вы изучите лучшие практики для оптимизации производительности систем частиц. Вы создадите полную, оптимизированную систему частиц с нуля, которая демонстрирует эффективное использование блоков, минимальные расчеты и паттерны проектирования, ориентированные на производительность.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте блок <filter-value>System</filter-value> - это корень вашей системы частиц",
    "Добавьте блок <filter-value>Texture</filter-value> для предоставления текстуры частицам и подключите к блоку System",
    "Загрузите текстуру <textures>flare.png</textures> с помощью кнопки загрузки в свойствах блока Texture",
    "Добавьте блок <filter-value>CreateParticle</filter-value> для эмиссии частиц и подключите к блоку System",
    "Добавьте блок <filter-value>Color4</filter-value> и установите его значение для базового цвета",
    "Подключите выход блока Color4 к входу color блока CreateParticle",
    "Добавьте блок <filter-value>Float</filter-value> и установите его значение на меньший базовый размер (например, 0.2) для лучшей производительности",
    "Подключите выход блока Float к входу size блока CreateParticle",
    "Добавьте блок <filter-value>BoxShape</filter-value> для эмиссии частиц из объема коробки и подключите между блоками CreateParticle и System",
    "Добавьте блок <filter-value>UpdatePosition</filter-value> после BoxShape и подключите к блоку System",
    "Добавьте блок <filter-value>Position</filter-value> для получения текущей позиции частицы",
    "Добавьте блок <filter-value>Scaled Direction</filter-value> для получения масштабированного направления частицы",
    "Добавьте математический блок <filter-value>Add</filter-value> для вычисления новой позиции (Position + Scaled Direction)",
    "Подключите блок Position к левому входу блока Add и блок Scaled Direction к правому входу",
    "Подключите выход блока Add к входу position блока UpdatePosition",
    "Добавьте блок <filter-value>UpdateColor</filter-value> после UpdatePosition и подключите контекстное значение InitialColor к нему (не требуется пересчет)",
    "Добавьте блок <filter-value>UpdateSize</filter-value> после UpdateColor с постоянным размером (подключите контекстное значение InitialSize, нет расчетов на кадр)",
    "Подключите выход UpdateSize к блоку System",
    "Наблюдайте, как оптимизированная система работает плавно"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "Лучшие Практики Производительности",
      "description": "Этот урок фокусируется на техниках оптимизации, а не на новых блоках. Ключевые принципы: используйте контекстные значения когда возможно, минимизируйте расчеты на кадр, используйте постоянные значения где уместно, и держите цепочки блоков простыми. В визуальном редакторе вы можете найти эти блоки в списке блоков и настроить их свойства в панели свойств справа.",
      "properties": []
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение кода",
  "codeCopy": "Оптимизация производительности в системах частиц включает минимизацию вычислительных накладных расходов. Используйте контекстные значения (такие как InitialColor) вместо пересчета, используйте постоянные значения для свойств, которые не изменяются, минимизируйте количество математических операций на кадр, и держите цепочки блоков как можно проще. Меньшие размеры частиц и эффективные текстуры также помогают производительности.",
  "objectivesTitle": "Цели обучения",
  "objectives": [
    "Понять принципы оптимизации производительности",
    "Научиться эффективно использовать контекстные значения",
    "Минимизировать расчеты на кадр",
    "Проектировать эффективные цепочки блоков",
    "Применять техники оптимизации к реальным системам"
  ],
  "commonMistakesTitle": "Распространенные ошибки",
  "commonMistakes": [
    {
      "mistake": "Перерасчет значений каждый кадр",
      "explanation": "Перерасчет значений, которые не изменяются (таких как начальный цвет) каждый кадр тратит производительность. Используйте контекстные значения или постоянные входы вместо этого.",
      "solution": "Используйте InitialColor, InitialSize и другие контекстные значения, когда вам нужно исходное свойство частицы. Пересчитывайте только когда значения действительно изменяются."
    },
    {
      "mistake": "Создание ненужно сложных цепочек блоков",
      "explanation": "Сложные цепочки со многими математическими операциями на кадр могут замедлить производительность, особенно с многими частицами.",
      "solution": "Упрощайте цепочки блоков где возможно. Объединяйте расчеты, используйте контекстные значения, и избегайте избыточных операций."
    }
  ],
  "homeworkTitle": "Практические упражнения",
  "homework": [
    "Оптимизируйте существующую систему частиц, упрощая расчеты",
    "Сравните производительность между оптимизированными и неоптимизированными системами",
    "Экспериментируйте с разными размерами частиц, чтобы найти оптимальную точку производительности",
    "Используйте контекстные значения для замены ненужных расчетов",
    "Создайте высокопроизводительную систему частиц с тысячами частиц"
  ]
}

