{
  "title": "6.4: Сложные Системы",
  "summary": "Объедините все изученные концепции для создания готовых к продакшену сложных систем частиц",
  "introTitle": "Введение",
  "intro": "В этом финальном уроке вы объедините все концепции, изученные в течение курса, для создания сложной, готовой к продакшену системы частиц. Вы создадите полную систему с нуля, которая использует множество техник, включая временные свойства, случайность, векторные операции, обновления направления и вращение угла.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте SystemBlock - это корень вашей системы частиц",
    "Добавьте UpdateDirectionBlock для изменения направления частиц со временем",
    "Используйте системное Время для создания вариации направления",
    "Добавьте UpdatePositionBlock для обработки движения частиц",
    "Создайте CreateParticleBlock со случайным цветом и размером используя ParticleRandomBlock",
    "Установите lockMode в OncePerParticle для согласованных случайных значений",
    "Добавьте SphereShapeBlock с входом радиуса",
    "Соедините: CreateParticle → SphereShape → UpdateDirection → UpdatePosition",
    "Добавьте временное затухание цвета используя Возраст и Время жизни",
    "Вычислите фактор затухания: 1 - ageRatio",
    "Умножьте начальный цвет на фактор затухания для плавного затухания",
    "Добавьте временный рост размера используя соотношение возраста",
    "Добавьте UpdateAngleBlock с временным вращением",
    "Соедините все блоки: UpdatePosition → UpdateColor → UpdateSize → UpdateAngle → SystemBlock",
    "Добавьте ParticleTextureSourceBlock для предоставления текстуры",
    "Наблюдайте сложный, многослойный эффект частиц"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "Интеграция Сложной Системы",
      "description": "Этот урок объединяет множество блоков и техник: UpdateDirectionBlock, ParticleRandomBlock, временные расчеты, векторные операции и обновления угла. Все работают вместе для создания сложного эффекта.",
      "properties": []
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение кода",
  "codeCopy": "Сложные системы частиц объединяют множество техник для создания богатых, динамических эффектов. Эта система использует случайность для вариации, временные расчеты для эволюции со временем, обновления направления для динамического движения и вращение угла для визуального интереса. Ключ в организации этих техник в согласованную цепочку блоков, которая логично течет от создания к финальному выходу.",
  "objectivesTitle": "Цели обучения",
  "objectives": [
    "Объединять множество техник в одной системе",
    "Эффективно организовывать сложные цепочки блоков",
    "Создавать готовые к продакшену эффекты частиц",
    "Понять, как разные техники работают вместе",
    "Проектировать сложные системы частиц с нуля"
  ],
  "commonMistakesTitle": "Распространенные ошибки",
  "commonMistakes": [
    {
      "mistake": "Усложнение системы",
      "explanation": "Добавление слишком многих эффектов может сделать систему трудной для понимания и отладки. Начните просто и добавляйте сложность постепенно.",
      "solution": "Стройте системы инкрементально. Начните с базового движения, затем добавьте цвет, затем размер, затем продвинутые функции. Тестируйте на каждом шаге."
    },
    {
      "mistake": "Неорганизация цепочек блоков логично",
      "explanation": "Сложные системы нуждаются в четкой организации. Случайные блоки, соединенные запутанным образом, трудно отлаживать и поддерживать.",
      "solution": "Организуйте блоки в логическом порядке: Создание → Форма → Направление → Позиция → Цвет → Размер → Угол → Система. Держите связанные расчеты вместе."
    }
  ],
  "homeworkTitle": "Практические упражнения",
  "homework": [
    "Создайте свою сложную систему частиц, объединяющую 5+ техник",
    "Экспериментируйте с разными комбинациями эффектов",
    "Оптимизируйте сложную систему для производительности",
    "Создайте тематический эффект (огонь, магия, взрыв) используя множество техник",
    "Документируйте свою сложную систему для будущей справки"
  ]
}

