{
  "title": "6.1: Угол и Вращение",
  "summary": "Научитесь управлять вращением частиц, используя UpdateAngleBlock и AlignAngleBlock",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь управлять вращением и углом частиц. Вы будете использовать UpdateAngleBlock для установки вращения частиц на основе расчетов (например, вращение на основе времени) и узнаете об AlignAngleBlock, который автоматически выравнивает частицы по их направлению. Вращение необходимо для создания эффектов, таких как вращающиеся частицы, направленные спрайты и анимированные текстуры.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте блок <filter-value>System</filter-value> - это корень вашей системы частиц",
    "Добавьте блок <filter-value>Texture</filter-value> для предоставления текстуры частицам и подключите к блоку System",
    "Загрузите текстуру <textures>flare.png</textures> с помощью кнопки загрузки в свойствах блока Texture",
    "Добавьте блок <filter-value>CreateParticle</filter-value> для эмиссии частиц и подключите к блоку System",
    "Добавьте блок <filter-value>Color4</filter-value> и установите его значение для базового цвета",
    "Подключите выход блока Color4 к входу color блока CreateParticle",
    "Добавьте блок <filter-value>Float</filter-value> и установите его значение для базового размера",
    "Подключите выход блока Float к входу size блока CreateParticle",
    "Добавьте блок <filter-value>SphereShape</filter-value> для эмиссии частиц из объема сферы и подключите между блоками CreateParticle и System",
    "Добавьте блок <filter-value>Time</filter-value> для получения системного времени (установите systemSource в Time в свойствах)",
    "Добавьте блок <filter-value>Float</filter-value> для скорости вращения и установите его значение (например, 2.0 для 2 оборотов в секунду, что составляет 2 * Math.PI радиан в секунду)",
    "Добавьте математический блок <filter-value>Multiply</filter-value> для вычисления угла вращения (время * скоростьВращения)",
    "Подключите блок Time к левому входу блока Multiply и Float скорости вращения к правому входу",
    "Добавьте блок <filter-value>UpdateAngle</filter-value> после SphereShape и подключите выход блока Multiply к входу angle блока UpdateAngle",
    "Добавьте блок <filter-value>UpdatePosition</filter-value> после UpdateAngle и подключите к блоку System",
    "Опционально добавьте блок <filter-value>AlignAngle</filter-value> для выравнивания частиц по их направлению (используйте вместо или после UpdateAngle)"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "UpdateAngleBlock",
      "description": "Обновляет угол вращения частиц. Угол указывается в радианах и определяет, как частицы вращаются. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "name",
          "value": "'Update Angle'",
          "description": "Отображаемое имя блока. Установите это в панели свойств справа от редактора."
        },
        {
          "name": "angle",
          "value": "Float input",
          "description": "Угол вращения в радианах. Подключите выход Float к этому входу."
        }
      ]
    },
    {
      "name": "AlignAngleBlock",
      "description": "Автоматически выравнивает угол частицы по ее вектору направления. Полезно для создания частиц, которые обращены в направлении движения. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "name",
          "value": "'Align Angle'",
          "description": "Отображаемое имя блока. Установите это в панели свойств справа от редактора."
        },
        {
          "name": "alignment",
          "value": "Float (по умолчанию: Math.PI / 2)",
          "description": "Смещение выравнивания в радианах. Установите это в панели свойств справа от редактора."
        }
      ]
    },
    {
      "name": "ParticleInputBlock (Time)",
      "description": "Получает системное время для расчетов вращения на основе времени. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "systemSource",
          "value": "NodeParticleSystemSources.Time",
          "description": "Системный источник - Time для системного времени. Установите это в панели свойств справа от редактора."
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Этот урок демонстрирует управление вращением частиц. UpdateAngleBlock позволяет устанавливать вращение частиц на основе расчетов - в данном случае, вращение на основе времени, где угол = время * скоростьВращения. Это создает непрерывное вращение. AlignAngleBlock автоматически вычисляет угол, необходимый для выравнивания частиц с их вектором направления, что полезно для направленных спрайтов. Вращение указывается в радианах (2π = 360 градусов) и может комбинироваться с другими эффектами, такими как изменения цвета или вариации размера.",
  "objectivesTitle": "Цели Обучения",
  "objectives": [
    "Контролировать вращение частиц, используя UpdateAngleBlock",
    "Вычислять углы вращения из времени и скорости",
    "Использовать AlignAngleBlock для выравнивания частиц с их направлением",
    "Понять единицы углов (радианы против градусов)",
    "Комбинировать вращение с другими эффектами частиц"
  ],
  "commonMistakesTitle": "Частые Ошибки",
  "commonMistakes": [
    {
      "mistake": "Использование градусов вместо радианов",
      "explanation": "UpdateAngleBlock ожидает углы в радианах, а не в градусах. Использование градусов (0-360) создает неправильное вращение (частицы вращаются намного больше, чем ожидается).",
      "solution": "Конвертируйте градусы в радианы: радианы = градусы * (Math.PI / 180). Или используйте радианы напрямую: 2π = 360 градусов, π = 180 градусов, π/2 = 90 градусов."
    },
    {
      "mistake": "Неправильное масштабирование скорости вращения",
      "explanation": "Скорость вращения должна быть в радианах в секунду. Использование сырого времени или неправильного масштабирования создает неправильные скорости вращения.",
      "solution": "Вычисляйте вращение: угол = время * скоростьВращения, где скоростьВращения в радианах в секунду. Для 1 оборота в секунду используйте скоростьВращения = 2 * Math.PI."
    },
    {
      "mistake": "Путаница между UpdateAngleBlock и AlignAngleBlock",
      "explanation": "UpdateAngleBlock устанавливает конкретное значение угла, в то время как AlignAngleBlock автоматически вычисляет угол из направления. Использование неправильного создает неправильное вращение.",
      "solution": "Используйте UpdateAngleBlock, когда хотите установить вращение вручную (например, вращение на основе времени). Используйте AlignAngleBlock, когда хотите, чтобы частицы автоматически были обращены в направлении их движения."
    }
  ],
  "homeworkTitle": "Упражнения для Практики",
  "homework": [
    "Попробуйте различные скорости вращения и наблюдайте эффект",
    "Объедините вращение с эффектами на основе возраста (вращайтесь быстрее по мере старения частиц)",
    "Используйте AlignAngleBlock, чтобы частицы были обращены в направлении движения",
    "Объедините вращение с изменениями цвета для более динамичных эффектов",
    "Экспериментируйте с вращением на основе свойств частиц (скорость, возраст и т.д.)"
  ]
}