{
  "title": "4.1: Продвинутое Управление Цветом",
  "summary": "Научитесь создавать плавные цветовые переходы и градиенты с помощью ParticleLerpBlock",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь создавать плавные цветовые переходы в течение жизни частицы. Мы будем использовать блок Lerp для интерполяции между двумя цветами на основе возраста частицы, создавая красивые эффекты затухания и цветовые анимации.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте блок <filter-value>System</filter-value> - это корень вашей системы частиц",
    "Добавьте блок <filter-value>Texture</filter-value> для предоставления текстуры частицам и подключите к блоку System",
    "Загрузите <textures>flare.png</textures> с помощью кнопки загрузки в свойствах блока Texture",
    "Добавьте блок <filter-value>CreateParticle</filter-value> для эмиссии частиц и подключите к блоку System",
    "Добавьте блок <filter-value>Color4</filter-value> и установите его значение для базового цвета",
    "Подключите выход блока Color4 к входу color блока CreateParticle",
    "Добавьте блок <filter-value>Float</filter-value> и установите его значение для базового размера",
    "Подключите выход блока Float к входу size блока CreateParticle",
    "Добавьте блок <filter-value>BoxShape</filter-value> для эмиссии частиц из объема куба и подключите между блоками CreateParticle и System",
    "Добавьте блок <filter-value>Age</filter-value> для получения текущего возраста частицы",
    "Добавьте блок <filter-value>Lifetime</filter-value> для получения общего времени жизни частицы",
    "Добавьте математический блок <filter-value>Divide</filter-value> для вычисления соотношения возраста (age / lifetime)",
    "Подключите блок Age к левому входу блока Divide и блок Lifetime к правому входу",
    "Добавьте блок <filter-value>Converter</filter-value> для создания начального цвета (например, ярко-красный: R=1.0, G=0.0, B=0.0, A=1.0)",
    "Добавьте блоки <filter-value>Float</filter-value> со значениями для компонентов R, G, B, A начального цвета",
    "Подключите блоки Float к входам X, Y, Z, W блока Converter соответственно (X=R, Y=G, Z=B, W=A)",
    "Добавьте еще один блок <filter-value>Converter</filter-value> для создания конечного цвета (например, синий с прозрачностью: R=0.0, G=0.0, B=1.0, A=0.5)",
    "Добавьте блоки <filter-value>Float</filter-value> со значениями для компонентов R, G, B, A конечного цвета",
    "Подключите блоки Float к входам X, Y, Z, W второго блока Converter соответственно",
    "Добавьте блок <filter-value>Lerp</filter-value> для интерполяции между начальным и конечным цветами",
    "Подключите выход Color4 первого блока Converter к входу min блока Lerp",
    "Подключите выход Color4 второго блока Converter к входу max блока Lerp",
    "Подключите соотношение возраста из блока Divide к входу factor блока Lerp",
    "Добавьте блок <filter-value>UpdateColor</filter-value> и подключите между блоками BoxShape и System",
    "Подключите выход Color4 блока Lerp к входу color блока UpdateColor"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "Блок Lerp",
      "description": "Линейно интерполирует (lerp) между двумя значениями на основе фактора градиента (0 до 1). Работает с типами Float, Vector2, Vector3 и Color4. Идеально подходит для создания плавных переходов. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "Min",
          "value": "Color4 input (начальный цвет)",
          "description": "Начальное значение (когда gradient = 0). Подключите блок Color4 к этому входу."
        },
        {
          "name": "Max",
          "value": "Color4 input (конечный цвет)",
          "description": "Конечное значение (когда gradient = 1). Подключите блок Color4 к этому входу."
        },
        {
          "name": "Gradient",
          "value": "Float input (0 до 1)",
          "description": "Фактор интерполяции. 0 = значение min, 1 = значение max, 0.5 = посередине. Подключите соотношение возраста к этому входу."
        }
      ]
    },
    {
      "name": "Блок Converter",
      "description": "Создает Color4 из отдельных значений Float R, G, B, A. Используется для определения пользовательских цветов для начала и конца цветовых переходов. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "Входы (X, Y, Z, W)",
          "value": "Float inputs",
          "description": "Отдельные входы Float для компонентов R, G, B, A (X = R, Y = G, Z = B, W = A). Подключите блоки Float к этим входам."
        },
        {
          "name": "Выход Color4",
          "value": "Color4 output",
          "description": "Объединенный выход Color4. Используйте этот выход при создании цветов."
        }
      ]
    },
    {
      "name": "Блок Input (Age)",
      "description": "Получает текущий возраст частицы. Возраст увеличивается от 0 до lifetime по мере жизни частицы. В визуальном редакторе вы можете найти этот блок в списке блоков и установить его контекстное значение на Age в панели свойств справа.",
      "properties": [
        {
          "name": "Contextual Value",
          "value": "Age",
          "description": "Тип контекстных данных - Age в данном случае. Установите это в панели свойств справа от редактора."
        }
      ]
    },
    {
      "name": "Блок Input (Lifetime)",
      "description": "Получает общее время жизни частицы. Это максимальный возраст, которого может достичь частица перед смертью. В визуальном редакторе вы можете найти этот блок в списке блоков и установить его контекстное значение на Lifetime в панели свойств справа.",
      "properties": [
        {
          "name": "Contextual Value",
          "value": "Lifetime",
          "description": "Тип контекстных данных - Lifetime в данном случае. Установите это в панели свойств справа от редактора."
        }
      ]
    },
    {
      "name": "Блок Math (Divide)",
      "description": "Делит два значения. Используется для вычисления соотношения возраста: age / lifetime, что дает значение от 0 (рождение) до 1 (смерть). В визуальном редакторе вы можете найти этот блок в списке блоков и установить его операцию на Divide в панели свойств справа.",
      "properties": [
        {
          "name": "Operation",
          "value": "Divide",
          "description": "Математическая операция - Divide. Установите это в панели свойств справа от редактора."
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Этот урок демонстрирует цветовую интерполяцию с использованием линейной интерполяции (lerp). Формула: result = (1 - gradient) * left + gradient * right. Когда gradient = 0, мы получаем цвет left (начало). Когда gradient = 1, мы получаем цвет right (конец). Используя age / lifetime в качестве градиента, частицы плавно переходят от начального цвета к конечному в течение своей жизни. Эта техника необходима для создания эффектов затухания, цветовых анимаций и плавных визуальных переходов.",
  "objectivesTitle": "Цели Обучения",
  "objectives": [
    "Понять линейную интерполяцию (lerp) для плавных цветовых переходов",
    "Использовать блок Lerp для интерполяции между двумя цветами",
    "Вычислять соотношение возраста для цветовых переходов на основе времени",
    "Создавать значения Color4, используя блок Converter",
    "Применять плавные цветовые градиенты в течение жизни частицы"
  ],
  "commonMistakesTitle": "Частые Ошибки",
  "commonMistakes": [
    {
      "mistake": "Использование неправильного значения градиента для блока Lerp",
      "explanation": "Вход градиента должен быть значением от 0 до 1. Использование значений вне этого диапазона или использование возраста напрямую вместо соотношения возраста вызывает неправильную интерполяцию.",
      "solution": "Всегда вычисляйте соотношение возраста сначала: ageRatio = Age / Lifetime. Затем используйте это значение (0 до 1) в качестве входа градиента для блока Lerp."
    },
    {
      "mistake": "Перестановка левого и правого цветов",
      "explanation": "Когда gradient = 0, вы получаете левый цвет. Когда gradient = 1, вы получаете правый цвет. Перестановка их обращает направление перехода.",
      "solution": "Установите left на начальный цвет (когда частица создана) и right на конечный цвет (когда частица умирает). Используйте соотношение возраста в качестве градиента для перехода от left к right."
    },
    {
      "mistake": "Не нормализация компонентов цвета",
      "explanation": "Компоненты Color4 должны быть в диапазоне 0-1. Использование значений вне этого диапазона (например, 0-255) вызывает неправильные цвета или ошибки.",
      "solution": "При создании Color4 с блоком Converter используйте значения от 0.0 до 1.0 для компонентов R, G, B, A. Например: красный = 1.0, а не 255."
    }
  ],
  "homeworkTitle": "Упражнения для Практики",
  "homework": [
    "Попробуйте разные цветовые комбинации (например, желтый к фиолетовому, зеленый к голубому)",
    "Создайте цветовой переход, который затухает до прозрачного (установите конечную альфу в 0)",
    "Экспериментируйте с нелинейными переходами, модифицируя соотношение возраста математическими операциями",
    "Попробуйте создать цветовой цикл, используя несколько блоков <filter-value>Lerp</filter-value>",
    "Комбинируйте цветовые переходы с изменениями размера для более динамичных эффектов"
  ]
}