{
  "title": "4.2: Анимация Текстур и Спрайт-Листы",
  "summary": "Научитесь создавать анимированные текстуры частиц, используя спрайт-листы и обновление индекса ячеек",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь использовать блоки SetupSpriteSheet и BasicSpriteUpdate для создания анимированных текстур частиц. Спрайт-листы позволяют отображать разные кадры анимации на частицах, создавая эффекты, такие как анимированное пламя, взрывы или другие динамические визуальные эффекты. Вы научитесь настраивать свойства спрайт-листа и скорость анимации, используя spriteCellChangeSpeed для автоматической анимации спрайтов.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте блок <filter-value>System</filter-value> - это корень вашей системы частиц",
    "Добавьте блок <filter-value>Texture</filter-value> для предоставления текстуры частицам и подключите к блоку System",
    "Загрузите спрайт-лист texture <textures>player.png</textures> с помощью кнопки загрузки в свойствах блока Texture",
    "Добавьте блок <filter-value>CreateParticle</filter-value> для эмиссии частиц и подключите к блоку System",
    "Добавьте блок <filter-value>Float</filter-value> для Emit Power и установите его значение в 1.0",
    "Подключите выход блока Float к входу emitPower блока CreateParticle",
    "Добавьте блок <filter-value>Float</filter-value> для Lifetime и установите его значение в 10.0",
    "Подключите выход блока Float к входу lifeTime блока CreateParticle",
    "Добавьте блок <filter-value>BoxShape</filter-value> для эмиссии частиц из объема коробки и подключите между блоками CreateParticle и System",
    "Добавьте блок <filter-value>Vector3</filter-value> для Direction и установите его значение в (-2.0, 0.0, 0.0)",
    "Подключите выход блока Vector3 к входам direction1 и direction2 блока BoxShape",
    "Добавьте блок <filter-value>Vector3</filter-value> для Min Emit Box и установите его значение в (-1.0, 0.0, -0.3)",
    "Подключите выход блока Vector3 к входу minEmitBox блока BoxShape",
    "Добавьте блок <filter-value>Vector3</filter-value> для Max Emit Box и установите его значение в (0.0, 0.0, 0.3)",
    "Подключите выход блока Vector3 к входу maxEmitBox блока BoxShape",
    "Добавьте блок <filter-value>SetupSpriteSheet</filter-value> для настройки спрайт-листа и подключите между блоками BoxShape и System",
    "Установите свойства спрайт-листа в блоке SetupSpriteSheet: Start (0), End (9), Width (64), Height (64)",
    "Включите Loop в свойствах блока SetupSpriteSheet",
    "Установите Random Start Cell в false в свойствах блока SetupSpriteSheet",
    "Установите Sprite Cell Change Speed в 30 в свойствах блока SetupSpriteSheet (это контролирует скорость анимации)",
    "Добавьте блок <filter-value>UpdatePosition</filter-value> после блока SetupSpriteSheet и подключите к блоку System",
    "Добавьте блок <filter-value>Position</filter-value> для получения текущей позиции частицы",
    "Добавьте блок <filter-value>Scaled Direction</filter-value> для получения масштабированного направления частицы",
    "Добавьте математический блок <filter-value>Add</filter-value> для вычисления новой позиции (Position + Scaled Direction)",
    "Подключите блок Position к левому входу блока Add и блок Scaled Direction к правому входу",
    "Подключите выход блока Add к входу position блока UpdatePosition",
    "Добавьте блок <filter-value>BasicSpriteUpdate</filter-value> после блока UpdatePosition и подключите к блоку System",
    "Блок BasicSpriteUpdate автоматически обновляет ячейки спрайтов на основе spriteCellChangeSpeed из SetupSpriteSheet"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "Блок Setup Sprite Sheet",
      "description": "Настраивает спрайт-лист для частиц. Определяет начальный и конечный индексы ячеек, размеры ячеек, скорость анимации и поведение. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "Start",
          "value": "0",
          "description": "Начальный индекс ячейки спрайт-листа. Установите это в панели свойств справа от редактора."
        },
        {
          "name": "End",
          "value": "9",
          "description": "Конечный индекс ячейки спрайт-листа. Установите это в панели свойств справа от редактора."
        },
        {
          "name": "Width",
          "value": "64",
          "description": "Ширина каждой ячейки спрайта в пикселях. Установите это в панели свойств справа от редактора."
        },
        {
          "name": "Height",
          "value": "64",
          "description": "Высота каждой ячейки спрайта в пикселях. Установите это в панели свойств справа от редактора."
        },
        {
          "name": "Loop",
          "value": "true",
          "description": "Должна ли анимация спрайт-листа зацикливаться. Установите это в панели свойств справа от редактора."
        },
        {
          "name": "Random Start Cell",
          "value": "false",
          "description": "Должны ли частицы начинаться со случайной ячейки. Установите это в панели свойств справа от редактора."
        },
        {
          "name": "Sprite Cell Change Speed",
          "value": "Float (например, 30)",
          "description": "Сколько кадров ждать перед переходом к следующей ячейке спрайта. Более высокие значения означают более медленную анимацию. Установите это в панели свойств справа от редактора."
        }
      ]
    },
    {
      "name": "Блок Basic Sprite Update",
      "description": "Автоматически обновляет индекс ячейки спрайта частицы на основе 'Sprite Cell Change Speed', определенного в блоке SetupSpriteSheet. Этот блок упрощает анимацию спрайтов, автоматически обрабатывая вычисление индекса ячейки. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": []
    },
    {
      "name": "Блок Box Shape",
      "description": "Эмитирует частицы из объема коробки. Используется для определения начальной формы эмиссии. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "Direction 1",
          "value": "Vector3 input",
          "description": "Первый вектор направления для эмиссии частиц. Подключите выход Vector3 к этому входу."
        },
        {
          "name": "Direction 2",
          "value": "Vector3 input",
          "description": "Второй вектор направления для эмиссии частиц. Частицы будут эмитироваться с направлением, интерполированным между Direction 1 и Direction 2. Подключите выход Vector3 к этому входу."
        },
        {
          "name": "Min Emit Box",
          "value": "Vector3 input",
          "description": "Минимальные границы коробки эмиссии. Подключите выход Vector3 к этому входу."
        },
        {
          "name": "Max Emit Box",
          "value": "Vector3 input",
          "description": "Максимальные границы коробки эмиссии. Подключите выход Vector3 к этому входу."
        }
      ]
    },
    {
      "name": "Блок Update Position",
      "description": "Обновляет позицию частиц каждый кадр. Этот блок необходим для любого движения частиц. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "Position",
          "value": "Vector3 input",
          "description": "Новый вектор позиции для применения к частице. Подключите выход Vector3 к этому входу."
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Этот урок демонстрирует анимацию спрайт-листа. Спрайт-лист - это текстура, содержащая несколько кадров анимации, расположенных в сетке. Используя блок SetupSpriteSheet со свойством 'Sprite Cell Change Speed' и блок BasicSpriteUpdate, мы создаем плавные анимации автоматически. Свойство 'Sprite Cell Change Speed' контролирует, сколько кадров проходит перед переходом спрайта к следующей ячейке. Это создает динамические визуальные эффекты, такие как анимированное пламя, дым, взрывы и другие динамические визуальные элементы.",
  "objectivesTitle": "Цели Обучения",
  "objectives": [
    "Настроить спрайт-листы, используя блок SetupSpriteSheet",
    "Понять, как 'Sprite Cell Change Speed' контролирует скорость анимации",
    "Использовать блок BasicSpriteUpdate для автоматической анимации спрайтов",
    "Создавать плавные анимации спрайт-листов в течение жизни частицы"
  ],
  "commonMistakesTitle": "Частые Ошибки",
  "commonMistakes": [
    {
      "mistake": "Забыть установить 'Sprite Cell Change Speed' в блоке SetupSpriteSheet",
      "explanation": "Без установки 'Sprite Cell Change Speed' анимация не будет прогрессировать автоматически. Частицы будут отображать только первый кадр.",
      "solution": "Всегда устанавливайте 'Sprite Cell Change Speed' в положительное значение (например, 30) в свойствах блока SetupSpriteSheet. Это контролирует, сколько кадров проходит перед изменением спрайта."
    },
    {
      "mistake": "Не подключение блока BasicSpriteUpdate в цепочке частиц",
      "explanation": "Блок BasicSpriteUpdate должен быть подключен в цепочке обработки частиц (например, после UpdatePosition и перед System) для применения анимации.",
      "solution": "Убедитесь, что выход частиц из блока UpdatePosition подключен к входу частиц блока BasicSpriteUpdate, а его выход подключен к блоку System."
    },
    {
      "mistake": "Использование текстуры, которая не является спрайт-листом",
      "explanation": "Анимация спрайт-листа требует текстуру, специально разработанную как сетка кадров анимации. Использование обычного изображения не создаст анимацию.",
      "solution": "Убедитесь, что ваша текстура является действительным спрайт-листом с несколькими кадрами, расположенными в сетке. Свойства 'Width' и 'Height' в блоке SetupSpriteSheet должны соответствовать размерам одной ячейки в вашем спрайт-листе."
    }
  ],
  "homeworkTitle": "Упражнения для Практики",
  "homework": [
    "Попробуйте разные значения 'Sprite Cell Change Speed', чтобы увидеть, как это влияет на скорость анимации",
    "Экспериментируйте с 'Random Start Cell' для создания разнообразных анимаций",
    "Создайте анимации спрайтов, которые ускоряются или замедляются на основе свойств частиц (например, используя блоки Age и Lerp для контроля 'Sprite Cell Change Speed')",
    "Комбинируйте анимацию спрайтов с изменениями цвета для более динамичных эффектов",
    "Попробуйте создать спрайт-лист со своей собственной текстурой и протестируйте разные расположения ячеек"
  ]
}