{
  "title": "4.1: Advanced Color Management",
  "summary": "Learn to create smooth color transitions and gradients using ParticleLerpBlock",
  "introTitle": "Introduction",
  "intro": "In this lesson, you'll learn how to create smooth color transitions over a particle's lifetime. We'll use Lerp block to interpolate between two colors based on the particle's age, creating beautiful fading effects and color animations.",
  "stepsTitle": "Step-by-Step Instructions",
  "steps": [
    "Create a <filter-value>System</filter-value> block - this is the root of your particle system",
    "Add a <filter-value>Texture</filter-value> block to provide a texture for the particles and connect to System block",
    "Load a <textures>flare.png</textures> by load button in the Texture block properties",
    "Add a <filter-value>CreateParticle</filter-value> block to emit particles and connect to System block",
    "Add a <filter-value>Color4</filter-value> block and set its value to a base color",
    "Connect the Color4 block's output to CreateParticle block's color input",
    "Add a <filter-value>Float</filter-value> block and set its value for base size",
    "Connect the Float block's output to CreateParticle block's size input",
    "Add a <filter-value>BoxShape</filter-value> block to emit particles from a box volume and connect between CreateParticle and System blocks",
    "Add an <filter-value>Age</filter-value> block to get the particle's current age",
    "Add a <filter-value>Lifetime</filter-value> block to get the particle's total lifetime",
    "Add a math <filter-value>Divide</filter-value> block to calculate age ratio (age / lifetime)",
    "Connect Age block to Divide block's left input and Lifetime block to right input",
    "Add a <filter-value>Converter</filter-value> block to create a start color (e.g., bright red: R=1.0, G=0.0, B=0.0, A=1.0)",
    "Add <filter-value>Float</filter-value> blocks with values for R, G, B, A components of start color",
    "Connect the Float blocks to Converter block's X, Y, Z, W inputs respectively (X=R, Y=G, Z=B, W=A)",
    "Add another <filter-value>Converter</filter-value> block to create an end color (e.g., blue with transparency: R=0.0, G=0.0, B=1.0, A=0.5)",
    "Add <filter-value>Float</filter-value> blocks with values for R, G, B, A components of end color",
    "Connect the Float blocks to the second Converter block's X, Y, Z, W inputs respectively",
    "Add a <filter-value>Lerp</filter-value> block to interpolate between start and end colors",
    "Connect the first Converter block's Color4 output to Lerp block's min input",
    "Connect the second Converter block's Color4 output to Lerp block's max input",
    "Connect the age ratio from Divide block to Lerp block's factor input",
    "Add an <filter-value>UpdateColor</filter-value> block and connect between BoxShape and System blocks",
    "Connect the Lerp block's Color4 output to UpdateColor block's color input"
  ],
  "blocksTitle": "Blocks Used in This Lesson",
  "blocks": [
    {
      "name": "Lerp Block",
      "description": "Linearly interpolates (lerps) between two values based on a gradient factor (0 to 1). Works with Float, Vector2, Vector3, and Color4 types. Perfect for creating smooth transitions. In the visual editor, you can find this block in the block list and configure its properties in the properties panel on the right.",
      "properties": [
        {
          "name": "Min",
          "value": "Color4 input (start color)",
          "description": "The starting value (when gradient = 0). Connect a Color4 block to this input."
        },
        {
          "name": "Max",
          "value": "Color4 input (end color)",
          "description": "The ending value (when gradient = 1). Connect a Color4 block to this input."
        },
        {
          "name": "Gradient",
          "value": "Float input (0 to 1)",
          "description": "The interpolation factor. 0 = min value, 1 = max value, 0.5 = halfway between. Connect age ratio to this input."
        }
      ]
    },
    {
      "name": "Converter Block",
      "description": "Creates a Color4 from individual R, G, B, A float values. Used to define custom colors for the start and end of color transitions. In the visual editor, you can find this block in the block list and configure its properties in the properties panel on the right.",
      "properties": [
        {
          "name": "Inputs (X, Y, Z, W)",
          "value": "Float inputs",
          "description": "Individual float inputs for R, G, B, A components (X = R, Y = G, Z = B, W = A). Connect Float blocks to these inputs."
        },
        {
          "name": "Color4 Output",
          "value": "Color4 output",
          "description": "The combined Color4 output. Use this output when creating colors."
        }
      ]
    },
    {
      "name": "Input Block (Age)",
      "description": "Retrieves the current age of a particle. Age increases from 0 to lifetime as the particle lives. In the visual editor, you can find this block in the block list and set its contextual value to Age in the properties panel on the right.",
      "properties": [
        {
          "name": "Contextual Value",
          "value": "Age",
          "description": "The type of contextual data - Age in this case. Set this in the properties panel on the right side of the editor."
        }
      ]
    },
    {
      "name": "Input Block (Lifetime)",
      "description": "Retrieves the total lifetime of a particle. This is the maximum age a particle can reach before it dies. In the visual editor, you can find this block in the block list and set its contextual value to Lifetime in the properties panel on the right.",
      "properties": [
        {
          "name": "Contextual Value",
          "value": "Lifetime",
          "description": "The type of contextual data - Lifetime in this case. Set this in the properties panel on the right side of the editor."
        }
      ]
    },
    {
      "name": "Math Block (Divide)",
      "description": "Divides two values. Used to calculate age ratio: age / lifetime, which gives a value from 0 (birth) to 1 (death). In the visual editor, you can find this block in the block list and set its operation to Divide in the properties panel on the right.",
      "properties": [
        {
          "name": "Operation",
          "value": "Divide",
          "description": "The mathematical operation - Divide. Set this in the properties panel on the right side of the editor."
        }
      ]
    }
  ],
  "properties": "Properties",
  "codeTitle": "Code Explanation",
  "codeCopy": "This lesson demonstrates color interpolation using linear interpolation (lerp). The formula is: result = (1 - gradient) * left + gradient * right. When gradient = 0, we get the left color (start). When gradient = 1, we get the right color (end). By using age / lifetime as the gradient, particles smoothly transition from their start color to their end color over their lifetime. This technique is essential for creating fading effects, color animations, and smooth visual transitions.",
  "objectivesTitle": "Learning Objectives",
  "objectives": [
    "Understand linear interpolation (lerp) for smooth color transitions",
    "Use Lerp block to interpolate between two colors",
    "Calculate age ratio for time-based color transitions",
    "Create Color4 values using Converter block",
    "Apply smooth color gradients over particle lifetime"
  ],
  "commonMistakesTitle": "Common Mistakes",
  "commonMistakes": [
    {
      "mistake": "Using wrong gradient value for Lerp block",
      "explanation": "The gradient input should be a value from 0 to 1. Using values outside this range or using age directly instead of age ratio causes incorrect interpolation.",
      "solution": "Always calculate age ratio first: ageRatio = Age / Lifetime. Then use this value (0 to 1) as the gradient input to Lerp block."
    },
    {
      "mistake": "Swapping left and right colors",
      "explanation": "When gradient = 0, you get the left color. When gradient = 1, you get the right color. Swapping them reverses the transition direction.",
      "solution": "Set left to the start color (when particle is created) and right to the end color (when particle dies). Use age ratio as gradient to transition from left to right."
    },
    {
      "mistake": "Not normalizing color components",
      "explanation": "Color4 components should be in range 0-1. Using values outside this range (like 0-255) causes incorrect colors or errors.",
      "solution": "When creating Color4 with Converter block, use values from 0.0 to 1.0 for R, G, B, A components. For example: red = 1.0, not 255."
    }
  ],
  "homeworkTitle": "Practice Exercises",
  "homework": [
    "Try different color combinations (e.g., yellow to purple, green to cyan)",
    "Create a color transition that fades to transparent (set end alpha to 0)",
    "Experiment with non-linear transitions by modifying the age ratio with math operations",
    "Try creating a color cycle by using multiple <filter-value>Lerp</filter-value> blocks",
    "Combine color transitions with size changes for more dynamic effects"
  ]
}