{
  "title": "4.2: Анимация Текстур и Спрайт-Листы",
  "summary": "Научитесь создавать анимированные текстуры частиц, используя спрайт-листы и обновление индекса ячеек",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь использовать SetupSpriteSheetBlock и UpdateSpriteCellIndexBlock для создания анимированных текстур частиц. Спрайт-листы позволяют отображать разные кадры анимации на частицах, создавая эффекты, такие как анимированное пламя, взрывы или другие динамические визуальные эффекты. Вы научитесь вычислять индексы ячеек спрайтов на основе возраста частицы для создания плавных анимаций.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте SystemBlock - это корень вашей системы частиц",
    "Создайте CreateParticleBlock для эмиссии частиц",
    "Установите начальный цвет и размер используя ParticleInputBlock",
    "Добавьте <filter-value>SphereShape</filter-value> блок для эмиссии частиц из объема сферы",
    "Добавьте SetupSpriteSheetBlock для настройки спрайт-листа (начальная ячейка, конечная ячейка, ширина, высота)",
    "Установите свойства спрайт-листа (start: 0, end: 8, width: 64, height: 64)",
    "Включите зацикливание, если хотите, чтобы анимация повторялась",
    "Добавьте UpdateSpriteCellIndexBlock для обновления индекса ячейки спрайта",
    "Вычислите индекс спрайта из возраста частицы: Age / Lifetime",
    "Умножьте на количество ячеек (end - start + 1)",
    "Преобразуйте результат в целое число, используя ParticleFloatToIntBlock",
    "Подключите целочисленный индекс ячейки к входу cellIndex блока UpdateSpriteCellIndexBlock"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "SetupSpriteSheetBlock",
      "description": "Настраивает спрайт-лист для частиц. Определяет начальный и конечный индексы ячеек, размеры ячеек и поведение анимации.",
      "properties": [
        {
          "name": "start",
          "value": "0",
          "description": "Начальный индекс ячейки спрайт-листа"
        },
        {
          "name": "end",
          "value": "8",
          "description": "Конечный индекс ячейки спрайт-листа"
        },
        {
          "name": "width",
          "value": "64",
          "description": "Ширина каждой ячейки спрайта в пикселях"
        },
        {
          "name": "height",
          "value": "64",
          "description": "Высота каждой ячейки спрайта в пикселях"
        },
        {
          "name": "loop",
          "value": "true",
          "description": "Должна ли анимация спрайт-листа зацикливаться"
        },
        {
          "name": "randomStartCell",
          "value": "false",
          "description": "Должны ли частицы начинаться со случайной ячейки"
        }
      ]
    },
    {
      "name": "UpdateSpriteCellIndexBlock",
      "description": "Обновляет индекс ячейки спрайта частицы. Индекс ячейки определяет, какой кадр спрайт-листа отображается.",
      "properties": [
        {
          "name": "cellIndex",
          "value": "Int input",
          "description": "Индекс ячейки для отображения (начиная с 0, от start до end)"
        }
      ]
    },
    {
      "name": "ParticleFloatToIntBlock",
      "description": "Преобразует значение Float в целое число. Необходимо для индексов ячеек спрайтов, которые должны быть целыми числами.",
      "properties": [
        {
          "name": "input",
          "value": "Float input",
          "description": "Значение Float для преобразования"
        },
        {
          "name": "output",
          "value": "Int output",
          "description": "Целочисленный результат"
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Этот урок демонстрирует анимацию спрайт-листа. Спрайт-лист - это текстура, содержащая несколько кадров анимации, расположенных в сетке. Обновляя индекс ячейки на основе возраста частицы, мы создаем плавные анимации. Формула: cellIndex = floor((Age / Lifetime) * cellCount), где cellCount = end - start + 1. Это отображает время жизни частицы (0 до 1) на ячейки спрайт-листа (0 до cellCount-1). Спрайт-листы необходимы для создания анимированных эффектов, таких как пламя, дым, взрывы и другие динамические визуальные элементы.",
  "objectivesTitle": "Цели Обучения",
  "objectives": [
    "Настроить спрайт-листы, используя SetupSpriteSheetBlock",
    "Вычислять индекс ячейки спрайта из возраста частицы",
    "Использовать ParticleFloatToIntBlock для преобразования float в integer",
    "Обновлять индекс ячейки спрайта с UpdateSpriteCellIndexBlock",
    "Создавать плавные анимации спрайт-листов в течение жизни частицы"
  ],
  "commonMistakesTitle": "Частые Ошибки",
  "commonMistakes": [
    {
      "mistake": "Не преобразование float в integer для индекса ячейки",
      "explanation": "Индексы ячеек спрайта должны быть целыми числами. Использование значений float напрямую вызывает ошибки или неправильное отображение кадров.",
      "solution": "Всегда используйте ParticleFloatToIntBlock для преобразования вычисленного индекса ячейки из float в integer перед подключением к UpdateSpriteCellIndexBlock."
    },
    {
      "mistake": "Неправильное вычисление индекса ячейки",
      "explanation": "Формула должна отображать соотношение возраста (0 до 1) на индексы ячеек (0 до cellCount-1). Использование неправильной формулы вызывает пропуск кадров в анимации или неправильное зацикливание.",
      "solution": "Используйте: cellIndex = floor((Age / Lifetime) * cellCount), где cellCount = end - start + 1. Это правильно отображает время жизни на ячейки спрайта."
    },
    {
      "mistake": "Установка неправильных размеров спрайт-листа",
      "explanation": "Ширина и высота должны соответствовать фактическому размеру ячейки спрайта в текстуре. Неправильные размеры вызывают неправильное отображение кадров или ошибки выборки текстуры.",
      "solution": "Установите ширину и высоту в соответствии с вашей текстурой спрайт-листа. Если каждая ячейка 64x64 пикселя, установите width=64, height=64. Проверьте файл текстуры, чтобы подтвердить размеры ячеек."
    }
  ],
  "homeworkTitle": "Упражнения для Практики",
  "homework": [
    "Попробуйте разные конфигурации спрайт-листов (разное количество ячеек, размеры)",
    "Экспериментируйте с randomStartCell для создания разнообразных анимаций",
    "Создайте анимации спрайтов, которые ускоряются или замедляются на основе свойств частиц",
    "Комбинируйте анимацию спрайтов с изменениями цвета для более динамичных эффектов",
    "Попробуйте создать спрайт-лист со своей собственной текстурой и протестируйте разные расположения ячеек"
  ]
}