{
  "title": "Урок 4: Базовые Силы и Физика",
  "summary": "Научитесь применять силы, такие как гравитация, к частицам с помощью UpdateDirectionBlock",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь применять силы к частицам, такие как гравитация. Мы будем использовать UpdateDirectionBlock для изменения направления частиц со временем и комбинировать его с delta time для создания реалистичного физического движения.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Начните с базовой системы частиц, используя PointShapeBlock",
    "Добавьте UpdateDirectionBlock для изменения направления частиц",
    "Получите текущее направление, используя ParticleInputBlock с контекстным значением Direction",
    "Получите delta time, используя ParticleInputBlock с системным источником Delta",
    "Создайте вектор гравитации, используя ParticleConverterBlock (0, -9.8, 0 для гравитации вниз)",
    "Умножьте гравитацию на delta time, чтобы получить ускорение гравитации за кадр",
    "Добавьте дельту гравитации к текущему направлению, используя ParticleMathBlock",
    "Подключите результат к входу direction блока UpdateDirectionBlock",
    "Соедините цепочку: UpdateDirection → UpdatePosition → UpdateColor → UpdateSize"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "UpdateDirectionBlock",
      "description": "Обновляет направление частиц каждый кадр. Это необходимо для применения сил, таких как гравитация, ветер или другие направленные эффекты.",
      "properties": [
        {
          "name": "name",
          "value": "'Update direction'",
          "description": "Отображаемое имя блока"
        },
        {
          "name": "direction",
          "value": "Vector3 input",
          "description": "Новый вектор направления для применения к частице. Может быть вычислен из текущего направления плюс силы."
        }
      ]
    },
    {
      "name": "ParticleInputBlock (Direction)",
      "description": "Получает текущее направление частицы. Направление представляет вектор скорости частицы.",
      "properties": [
        {
          "name": "contextualValue",
          "value": "NodeParticleContextualSources.Direction",
          "description": "Тип контекстных данных - Direction в данном случае"
        }
      ]
    },
    {
      "name": "ParticleInputBlock (Delta Time)",
      "description": "Получает delta time из системы. Delta time - это время, прошедшее с последнего кадра, необходимое для физических расчетов, независимых от частоты кадров.",
      "properties": [
        {
          "name": "systemSource",
          "value": "NodeParticleSystemSources.Delta",
          "description": "Системный источник - Delta для delta time"
        }
      ]
    },
    {
      "name": "ParticleConverterBlock",
      "description": "Создает Vector3 из отдельных значений Float X, Y, Z. Используется для построения вектора гравитации (0, -9.8, 0).",
      "properties": [
        {
          "name": "xIn, yIn, zIn",
          "value": "Float inputs",
          "description": "Отдельные входы Float для компонентов X, Y, Z"
        },
        {
          "name": "xyzOut",
          "value": "Vector3 output",
          "description": "Объединенный выход Vector3"
        }
      ]
    },
    {
      "name": "ParticleMathBlock (Multiply)",
      "description": "Умножает два значения. Используется для умножения гравитации на delta time, обеспечивая независимость физических расчетов от частоты кадров.",
      "properties": [
        {
          "name": "operation",
          "value": "ParticleMathBlockOperations.Multiply",
          "description": "Математическая операция - Multiply"
        }
      ]
    },
    {
      "name": "ParticleMathBlock (Add)",
      "description": "Складывает два значения Vector3. Используется для добавления ускорения гравитации к текущему вектору направления.",
      "properties": [
        {
          "name": "operation",
          "value": "ParticleMathBlockOperations.Add",
          "description": "Математическая операция - Add"
        }
      ]
    },
    {
      "name": "PointShapeBlock",
      "description": "Эмитирует частицы из одной точки. Используется в этом уроке для создания частиц, которые падают из-за гравитации.",
      "properties": [
        {
          "name": "name",
          "value": "'Point emitter'",
          "description": "Отображаемое имя эмиттера"
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Этот урок демонстрирует, как применять силы к частицам. Ключевая концепция заключается в том, что силы изменяют направление со временем. Мы умножаем силу (гравитацию) на delta time, чтобы эффект был постоянным независимо от частоты кадров. Формула: newDirection = currentDirection + (force * deltaTime). Это создает реалистичное физическое движение, где частицы ускоряются вниз из-за гравитации.",
  "homeworkTitle": "Упражнения для Практики",
  "homework": [
    "Попробуйте изменить значение гравитации Y, чтобы увидеть, как это влияет на скорость падения частиц",
    "Создайте гравитацию вверх, установив гравитацию Y в положительное значение",
    "Добавьте горизонтальные силы, изменив гравитацию X или Z",
    "Экспериментируйте с разными величинами гравитации",
    "Попробуйте комбинировать несколько сил, добавив больше математических операций"
  ]
}