{
  "title": "Lesson 9: Advanced Math Operations",
  "summary": "Learn to use multiple trigonometric and advanced math functions (Sin, Cos, Sqrt, Abs) together",
  "introTitle": "Introduction",
  "intro": "In this lesson, you'll learn how to use multiple mathematical functions together to create complex effects. You'll use ParticleTrigonometryBlock with different operations (Sin, Cos, Sqrt, Abs) and combine them to create rich, animated color effects. Each function creates a different pattern - sine waves oscillate, cosine waves are phase-shifted, square root creates smooth curves, and absolute value removes negative values.",
  "stepsTitle": "Step-by-Step Instructions",
  "steps": [
    "Start with a basic particle system using PointShapeBlock",
    "Get the system time using ParticleInputBlock with Time system source",
    "Scale time using ParticleMathBlock (Multiply) to control animation speed",
    "PART 1 - Sin: Use ParticleTrigonometryBlock with Sin operation for red component",
    "PART 2 - Cos: Use ParticleTrigonometryBlock with Cos operation for green component",
    "PART 3 - Sqrt: Use Abs then Sqrt for blue component (smooth curve)",
    "Normalize all values to 0-1 range: (value + 1) / 2 for Sin/Cos",
    "Create Color4 using ParticleConverterBlock with all three components",
    "Connect the animated color to UpdateColorBlock"
  ],
  "blocksTitle": "Blocks Used in This Lesson",
  "blocks": [
    {
      "name": "ParticleTrigonometryBlock",
      "description": "Performs trigonometric and advanced mathematical operations on float values. Supports Sin, Cos, Tan, Sqrt, Log, Abs, and many more operations.",
      "properties": [
        {
          "name": "name",
          "value": "'Sin Time' / 'Cos Time' / 'Sqrt Time'",
          "description": "The display name of the block"
        },
        {
          "name": "operation",
          "value": "ParticleTrigonometryBlockOperations.Sin / Cos / Sqrt / Abs",
          "description": "The mathematical operation - Sin, Cos, Sqrt, or Abs"
        },
        {
          "name": "input",
          "value": "Float input",
          "description": "The input value (e.g., time for sine wave)"
        }
      ]
    },
    {
      "name": "ParticleInputBlock (Time)",
      "description": "Retrieves the system time. Time increases continuously, making it perfect for creating animated effects that change over time.",
      "properties": [
        {
          "name": "systemSource",
          "value": "NodeParticleSystemSources.Time",
          "description": "The system source - Time for system time"
        }
      ]
    },
    {
      "name": "ParticleMathBlock (Multiply/Add)",
      "description": "Multiplies or adds values. Used to scale and normalize trigonometric function outputs.",
      "properties": [
        {
          "name": "operation",
          "value": "ParticleMathBlockOperations.Multiply / Add",
          "description": "The mathematical operation - Multiply or Add"
        }
      ]
    }
  ],
  "properties": "Properties",
  "codeTitle": "Code Explanation",
  "codeCopy": "This lesson demonstrates combining multiple mathematical functions. Each function creates a different pattern: Sin creates oscillating waves (red), Cos creates phase-shifted waves (green), and Sqrt(Abs) creates smooth curves (blue). The normalization formula (value + 1) / 2 maps functions from [-1, 1] to [0, 1] for color values. By using different functions for different color components, we create rich, animated effects where each color channel follows a different mathematical pattern. This technique is essential for creating complex, organic-looking animations.",
  "homeworkTitle": "Practice Exercises",
  "homework": [
    "Try different trigonometric functions (Tan, Asin, Acos) and observe the differences",
    "Use different functions for different color components",
    "Create multiple waves with different frequencies and combine them",
    "Experiment with Sqrt, Log, Exp, and other advanced math operations",
    "Combine trigonometric functions with age-based effects for complex animations"
  ]
}