{
  "title": "Урок 12: Угол и Вращение",
  "summary": "Научитесь управлять вращением частиц, используя UpdateAngleBlock и AlignAngleBlock",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь управлять вращением и углом частиц. Вы будете использовать UpdateAngleBlock для установки вращения частиц на основе расчетов (например, вращение на основе времени) и узнаете об AlignAngleBlock, который автоматически выравнивает частицы по их направлению. Вращение необходимо для создания эффектов, таких как вращающиеся частицы, направленные спрайты и анимированные текстуры.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Начните с базовой системы частиц, используя PointShapeBlock",
    "Получите системное время, используя ParticleInputBlock с системным источником Time",
    "Создайте значение скорости вращения (оборотов в секунду)",
    "Вычислите угол вращения: время * скоростьВращения",
    "Добавьте UpdateAngleBlock для обновления угла частиц",
    "Подключите угол вращения к входу angle блока UpdateAngleBlock",
    "Опционально используйте AlignAngleBlock для выравнивания частиц по их направлению",
    "Наблюдайте, как частицы вращаются непрерывно на основе времени"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "UpdateAngleBlock",
      "description": "Обновляет угол вращения частиц. Угол указывается в радианах и определяет, как частицы вращаются.",
      "properties": [
        {
          "name": "name",
          "value": "'Update Angle'",
          "description": "Отображаемое имя блока"
        },
        {
          "name": "angle",
          "value": "Float input",
          "description": "Угол вращения в радианах"
        }
      ]
    },
    {
      "name": "AlignAngleBlock",
      "description": "Автоматически выравнивает угол частицы по ее вектору направления. Полезно для создания частиц, которые обращены в направлении движения.",
      "properties": [
        {
          "name": "name",
          "value": "'Align Angle'",
          "description": "Отображаемое имя блока"
        },
        {
          "name": "alignment",
          "value": "Float (по умолчанию: Math.PI / 2)",
          "description": "Смещение выравнивания в радианах"
        }
      ]
    },
    {
      "name": "ParticleInputBlock (Time)",
      "description": "Получает системное время для расчетов вращения на основе времени.",
      "properties": [
        {
          "name": "systemSource",
          "value": "NodeParticleSystemSources.Time",
          "description": "Системный источник - Time для системного времени"
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Этот урок демонстрирует управление вращением частиц. UpdateAngleBlock позволяет устанавливать вращение частиц на основе расчетов - в данном случае, вращение на основе времени, где угол = время * скоростьВращения. Это создает непрерывное вращение. AlignAngleBlock автоматически вычисляет угол, необходимый для выравнивания частиц с их вектором направления, что полезно для направленных спрайтов. Вращение указывается в радианах (2π = 360 градусов) и может комбинироваться с другими эффектами, такими как изменения цвета или вариации размера.",
  "homeworkTitle": "Упражнения для Практики",
  "homework": [
    "Попробуйте различные скорости вращения и наблюдайте эффект",
    "Объедините вращение с эффектами на основе возраста (вращайтесь быстрее по мере старения частиц)",
    "Используйте AlignAngleBlock, чтобы частицы были обращены в направлении движения",
    "Объедините вращение с изменениями цвета для более динамичных эффектов",
    "Экспериментируйте с вращением на основе свойств частиц (скорость, возраст и т.д.)"
  ]
}