{
  "title": "Урок 5: Продвинутое Управление Цветом",
  "summary": "Научитесь создавать плавные цветовые переходы и градиенты с помощью ParticleLerpBlock",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь создавать плавные цветовые переходы в течение жизни частицы. Мы будем использовать ParticleLerpBlock для интерполяции между двумя цветами на основе возраста частицы, создавая красивые эффекты затухания и цветовые анимации.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Начните с базовой системы частиц, используя BoxShapeBlock",
    "Добавьте UpdateColorBlock для изменения цвета частиц",
    "Получите возраст и время жизни частицы, используя ParticleInputBlock",
    "Вычислите соотношение возраста (age / lifetime), чтобы получить значение от 0 до 1",
    "Создайте начальный цвет, используя ParticleConverterBlock (например, ярко-красный)",
    "Создайте конечный цвет, используя ParticleConverterBlock (например, синий с прозрачностью)",
    "Используйте ParticleLerpBlock для интерполяции между начальным и конечным цветами",
    "Подключите соотношение возраста к входу gradient блока ParticleLerpBlock",
    "Подключите интерполированный цвет к входу color блока UpdateColorBlock"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "ParticleLerpBlock",
      "description": "Линейно интерполирует (lerp) между двумя значениями на основе фактора градиента (0 до 1). Работает с типами Float, Vector2, Vector3 и Color4. Идеально подходит для создания плавных переходов.",
      "properties": [
        {
          "name": "name",
          "value": "'Color Lerp'",
          "description": "Отображаемое имя блока"
        },
        {
          "name": "left",
          "value": "Color4 input",
          "description": "Начальное значение (когда gradient = 0)"
        },
        {
          "name": "right",
          "value": "Color4 input",
          "description": "Конечное значение (когда gradient = 1)"
        },
        {
          "name": "gradient",
          "value": "Float input (0 to 1)",
          "description": "Фактор интерполяции. 0 = значение left, 1 = значение right, 0.5 = посередине"
        }
      ]
    },
    {
      "name": "ParticleConverterBlock (Color4)",
      "description": "Создает Color4 из отдельных значений Float R, G, B, A. Используется для определения пользовательских цветов для начала и конца цветовых переходов.",
      "properties": [
        {
          "name": "xIn, yIn, zIn, wIn",
          "value": "Float inputs",
          "description": "Отдельные входы Float для компонентов R, G, B, A (xIn = R, yIn = G, zIn = B, wIn = A)"
        },
        {
          "name": "colorOut",
          "value": "Color4 output",
          "description": "Объединенный выход Color4"
        }
      ]
    },
    {
      "name": "ParticleInputBlock (Age)",
      "description": "Получает текущий возраст частицы. Возраст увеличивается от 0 до lifetime по мере жизни частицы.",
      "properties": [
        {
          "name": "contextualValue",
          "value": "NodeParticleContextualSources.Age",
          "description": "Тип контекстных данных - Age в данном случае"
        }
      ]
    },
    {
      "name": "ParticleInputBlock (Lifetime)",
      "description": "Получает общее время жизни частицы. Это максимальный возраст, которого может достичь частица перед смертью.",
      "properties": [
        {
          "name": "contextualValue",
          "value": "NodeParticleContextualSources.Lifetime",
          "description": "Тип контекстных данных - Lifetime в данном случае"
        }
      ]
    },
    {
      "name": "ParticleMathBlock (Divide)",
      "description": "Делит два значения. Используется для вычисления соотношения возраста: age / lifetime, что дает значение от 0 (рождение) до 1 (смерть).",
      "properties": [
        {
          "name": "operation",
          "value": "ParticleMathBlockOperations.Divide",
          "description": "Математическая операция - Divide"
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Этот урок демонстрирует цветовую интерполяцию с использованием линейной интерполяции (lerp). Формула: result = (1 - gradient) * left + gradient * right. Когда gradient = 0, мы получаем цвет left (начало). Когда gradient = 1, мы получаем цвет right (конец). Используя age / lifetime в качестве градиента, частицы плавно переходят от начального цвета к конечному в течение своей жизни. Эта техника необходима для создания эффектов затухания, цветовых анимаций и плавных визуальных переходов.",
  "homeworkTitle": "Упражнения для Практики",
  "homework": [
    "Попробуйте разные цветовые комбинации (например, желтый к фиолетовому, зеленый к голубому)",
    "Создайте цветовой переход, который затухает до прозрачного (установите конечную альфу в 0)",
    "Экспериментируйте с нелинейными переходами, модифицируя соотношение возраста математическими операциями",
    "Попробуйте создать цветовой цикл, используя несколько ParticleLerpBlocks",
    "Комбинируйте цветовые переходы с изменениями размера для более динамичных эффектов"
  ]
}