{
  "title": "Lesson 2: Particle Properties",
  "summary": "Learn to combine and control multiple particle properties (color, size, scale) together",
  "introTitle": "Introduction",
  "intro": "In this lesson, you'll learn how to combine multiple particle properties (color, size, and scale) to create complex effects. We'll use UpdateColorBlock, UpdateSizeBlock, and UpdateScaleBlock together, showing how to combine them with mathematical operations. You'll see how properties can interact with each other and how to create non-uniform scaling effects.",
  "stepsTitle": "Step-by-Step Instructions",
  "steps": [
    "Start with the basic particle system from Lesson 1",
    "Get the particle's Age and Lifetime using ParticleInputBlock",
    "Calculate the age ratio (Age / Lifetime) to get a value from 0 to 1",
    "Create a complex color gradient using ParticleConverterBlock with multiple components",
    "Combine age ratio with inverted ratio to create color transitions (red increases, green/blue fade)",
    "Add UpdateSizeBlock with growth calculation: size grows from base to base * (1 + growth * ageRatio)",
    "Add UpdateScaleBlock with non-uniform scaling: X scales down while Y scales up",
    "Chain all update blocks together: UpdatePosition → UpdateColor → UpdateSize → UpdateScale",
    "Observe how all properties work together to create a cohesive effect"
  ],
  "blocksTitle": "Blocks Used in This Lesson",
  "blocks": [
    {
      "name": "UpdateColorBlock",
      "description": "Updates the color of particles each frame. You can connect a color value to create fading, color transitions, or other color effects.",
      "properties": [
        {
          "name": "name",
          "value": "'Update color'",
          "description": "The display name of the block"
        },
        {
          "name": "color",
          "value": "Color4 input",
          "description": "The color to apply to the particle. Can be connected from ParticleInputBlock (InitialColor, Color) or Color4 input block."
        }
      ]
    },
    {
      "name": "UpdateSizeBlock",
      "description": "Updates the size of particles. Useful for creating particles that grow or shrink over time.",
      "properties": [
        {
          "name": "name",
          "value": "'Update size'",
          "description": "The display name of the block"
        },
        {
          "name": "size",
          "value": "Float input",
          "description": "The size value to apply. Can be a constant or calculated using math operations."
        }
      ]
    },
    {
      "name": "UpdateScaleBlock",
      "description": "Updates the scale of particles. Scale affects the particle's visual size independently from the size property.",
      "properties": [
        {
          "name": "name",
          "value": "'Update scale'",
          "description": "The display name of the block"
        },
        {
          "name": "scale",
          "value": "Float or Vector2 input",
          "description": "The scale value. Can be a single float or Vector2 for different X/Y scaling."
        }
      ]
    },
    {
      "name": "ParticleInputBlock (Age)",
      "description": "Retrieves the current age of a particle. Age starts at 0 when the particle is created and increases until it reaches the lifetime value.",
      "properties": [
        {
          "name": "contextualValue",
          "value": "NodeParticleContextualSources.Age",
          "description": "The type of contextual data - Age in this case"
        }
      ]
    },
    {
      "name": "ParticleInputBlock (Lifetime)",
      "description": "Retrieves the total lifetime of a particle. This is the maximum age a particle can reach before it dies.",
      "properties": [
        {
          "name": "contextualValue",
          "value": "NodeParticleContextualSources.Lifetime",
          "description": "The type of contextual data - Lifetime in this case"
        }
      ]
    },
    {
      "name": "ParticleInputBlock (InitialColor)",
      "description": "Retrieves the initial color of a particle when it was created. Useful for creating color transitions.",
      "properties": [
        {
          "name": "contextualValue",
          "value": "NodeParticleContextualSources.InitialColor",
          "description": "The type of contextual data - InitialColor in this case"
        }
      ]
    },
    {
      "name": "ParticleMathBlock (Divide)",
      "description": "Divides two values. In this lesson, we use it to calculate the age ratio (Age / Lifetime), which gives us a value from 0 to 1 representing how far through its life the particle is.",
      "properties": [
        {
          "name": "operation",
          "value": "ParticleMathBlockOperations.Divide",
          "description": "The mathematical operation - Divide"
        }
      ]
    },
    {
      "name": "ParticleMathBlock (Multiply)",
      "description": "Multiplies two values. Used to calculate final size by multiplying base size with a multiplier.",
      "properties": [
        {
          "name": "operation",
          "value": "ParticleMathBlockOperations.Multiply",
          "description": "The mathematical operation - Multiply"
        }
      ]
    },
    {
      "name": "ParticleMathBlock (Add)",
      "description": "Adds two values. Used to create size multiplier that increases from 1.0 to 2.0 based on age.",
      "properties": [
        {
          "name": "operation",
          "value": "ParticleMathBlockOperations.Add",
          "description": "The mathematical operation - Add"
        }
      ]
    }
  ],
  "properties": "Properties",
  "codeTitle": "Code Explanation",
  "codeCopy": "This lesson demonstrates how to combine multiple particle properties together. The key concept is that properties can be calculated using the same age ratio, but with different formulas. For color, we use ageRatio directly for red, and (1 - ageRatio) for green/blue. For size, we calculate: baseSize * (1 + growthMultiplier * ageRatio), creating growth. For scale, we use different formulas for X and Y: scaleX = baseX * (1 - ageRatio), scaleY = baseY * (1 + ageRatio). This creates non-uniform scaling where particles become wider but shorter over time. By combining all these properties, we create rich, dynamic effects.",
  "homeworkTitle": "Practice Exercises",
  "homework": [
    "Try different color combinations using the converter block",
    "Experiment with different growth formulas for size",
    "Create uniform scaling (X and Y scale the same)",
    "Combine size growth with color transitions for more dramatic effects",
    "Try using different math operations (Multiply, Add, Subtract) to create unique property combinations"
  ]
}