{
  "title": "2.3: Mesh Shape Emitters",
  "summary": "Learn to emit particles from 3D mesh surfaces using MeshShapeBlock",
  "introTitle": "Introduction",
  "intro": "In this lesson, you'll learn how to use Mesh Shape block to emit particles from the surface of 3D meshes. This is powerful for creating effects that follow the shape of objects, such as sparks from a sword, smoke from a character, or particles that appear to come from a specific object in your scene. You'll create a complete particle system from scratch that demonstrates mesh-based emission.",
  "stepsTitle": "Step-by-Step Instructions",
  "steps": [
    "Create a <filter-value>System</filter-value> block - this is the root of your particle system",
    "Add a <filter-value>Texture</filter-value> block to provide a texture for the particles and connect to System block",
    "Load a <textures>flare.png</textures> by load button in the Texture block properties",
    "Add a <filter-value>CreateParticle</filter-value> block to emit particles and connect to System block",
    "Add a <filter-value>Color4</filter-value> block and set its value to a base color",
    "Connect the Color4 block's output to CreateParticle block's color input",
    "Add a <filter-value>Float</filter-value> block and set its value for base size",
    "Connect the Float block's output to CreateParticle block's size input",
    "Add a <filter-value>MeshShape</filter-value> block to emit particles from mesh surface and connect between CreateParticle and System blocks",
    "Note: In a real scenario, you would reference an actual mesh from your scene in the MeshShape block properties",
    "Add an <filter-value>UpdatePosition</filter-value> block to handle particle movement and connect between MeshShape and System blocks",
    "Add a <filter-value>Position</filter-value> block and a <filter-value>ScaledDirection</filter-value> block",
    "Add a math <filter-value>Add</filter-value> block to combine position and direction",
    "Connect Position and ScaledDirection blocks to the math block's left and right inputs respectively",
    "Connect the result from the math block to UpdatePosition block's position input",
    "Add an <filter-value>UpdateColor</filter-value> block after UpdatePosition block and connect between UpdatePosition and System blocks",
    "Add an <filter-value>InitialColor</filter-value> block and connect its output to UpdateColor block's color input",
    "Add an <filter-value>UpdateSize</filter-value> block after UpdateColor block and connect between UpdateColor and System blocks",
    "Add another <filter-value>Float</filter-value> block with a constant size value and connect to UpdateSize block's size input",
    "Observe how particles are emitted from the mesh surface"
  ],
  "blocksTitle": "Blocks Used in This Lesson",
  "blocks": [
    {
      "name": "Mesh Shape Block",
      "description": "Emits particles from the surface of a 3D mesh. Particles spawn on the mesh surface, following its shape. This is useful for creating effects that are tied to specific objects in your scene. In the visual editor, you can find this block in the block list and configure its properties in the properties panel on the right.",
      "properties": [
        {
          "name": "Name",
          "value": "Mesh emitter",
          "description": "The display name of the emitter. Set this in the properties panel on the right side of the editor."
        },
        {
          "name": "Mesh",
          "value": "Mesh reference",
          "description": "Reference to the 3D mesh from which particles will be emitted. The mesh must exist in the scene. Set this in the properties panel on the right side of the editor."
        }
      ]
    }
  ],
  "properties": "Properties",
  "codeTitle": "Code Explanation",
  "codeCopy": "Mesh Shape block allows you to emit particles from the surface of any 3D mesh in your scene. This creates a strong visual connection between the particles and the object, making it perfect for effects like sparks from metal, smoke from engines, or magical auras around characters. The particles spawn on the mesh surface, following its geometry, which creates natural-looking effects that adapt to the object's shape.",
  "objectivesTitle": "Learning Objectives",
  "objectives": [
    "Understand Mesh Shape block and its use cases",
    "Learn how to reference meshes from the scene",
    "Create particle effects tied to 3D objects",
    "Understand the difference between mesh emission and other shape emitters",
    "Apply mesh-based emission to real-world scenarios"
  ],
  "commonMistakesTitle": "Common Mistakes",
  "commonMistakes": [
    {
      "mistake": "Not referencing a valid mesh",
      "explanation": "Mesh Shape block requires a valid mesh reference. If the mesh doesn't exist or isn't properly referenced, particles won't emit correctly.",
      "solution": "Ensure the mesh exists in the scene before using Mesh Shape block. Reference it correctly in the properties panel on the right side of the editor using the mesh's name or direct reference."
    },
    {
      "mistake": "Using mesh emission for effects that don't need object attachment",
      "explanation": "Mesh emission is more complex than other shapes. If you don't need particles tied to a specific object, use simpler shapes like Box Shape block or Sphere Shape block.",
      "solution": "Use Mesh Shape block only when you need particles to follow an object's shape. For general effects, use Box, Sphere, Cone, or Cylinder shapes."
    }
  ],
  "homeworkTitle": "Practice Exercises",
  "homework": [
    "Create particles that emit from a character model",
    "Try emitting particles from different parts of a mesh",
    "Combine mesh emission with other effects (color changes, size variations)",
    "Experiment with animated meshes to see how particles follow movement",
    "Create a particle trail effect using mesh emission"
  ]
}

