{
  "title": "6.4: Сложные Системы",
  "summary": "Объедините все изученные концепции для создания готовых к продакшену сложных систем частиц",
  "introTitle": "Введение",
  "intro": "В этом финальном уроке вы объедините все концепции, изученные в течение курса, для создания сложной, готовой к продакшену системы частиц. Вы создадите полную систему с нуля, которая использует множество техник, включая временные свойства, случайность, векторные операции, обновления направления и вращение угла.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте блок <filter-value>System</filter-value> - это корень вашей системы частиц",
    "Добавьте блок <filter-value>Texture</filter-value> для предоставления текстуры частицам и подключите к блоку System",
    "Загрузите текстуру <textures>flare.png</textures> с помощью кнопки загрузки в свойствах блока Texture",
    "Добавьте блок <filter-value>CreateParticle</filter-value> для эмиссии частиц и подключите к блоку System",
    "Добавьте блоки <filter-value>Float</filter-value> для значений Min и Max цвета и подключите к блоку <filter-value>Random</filter-value> (установите lockMode в OncePerParticle)",
    "Подключите выход блока Random к входу color блока CreateParticle",
    "Добавьте блоки <filter-value>Float</filter-value> для значений Min и Max размера и подключите к другому блоку <filter-value>Random</filter-value> (установите lockMode в OncePerParticle)",
    "Подключите выход блока Random к входу size блока CreateParticle",
    "Добавьте блок <filter-value>SphereShape</filter-value> для эмиссии частиц из объема сферы и подключите между блоками CreateParticle и System",
    "Добавьте блок <filter-value>UpdateDirection</filter-value> после SphereShape для изменения направления частиц со временем",
    "Добавьте блок <filter-value>Time</filter-value> и используйте его для создания вариации направления",
    "Добавьте блок <filter-value>UpdatePosition</filter-value> после UpdateDirection для обработки движения частиц",
    "Добавьте блок <filter-value>Age</filter-value> для получения текущего возраста частицы",
    "Добавьте блок <filter-value>Lifetime</filter-value> для получения общего времени жизни частицы",
    "Добавьте математический блок <filter-value>Divide</filter-value> для вычисления соотношения возраста (Age / Lifetime)",
    "Добавьте блок <filter-value>Float</filter-value> со значением 1.0 и математический блок <filter-value>Subtract</filter-value> для вычисления фактора затухания (1 - ageRatio)",
    "Добавьте блок <filter-value>InitialColor</filter-value> для получения начального цвета",
    "Добавьте математический блок <filter-value>Multiply</filter-value> для умножения начального цвета на фактор затухания для плавного затухания",
    "Добавьте блок <filter-value>UpdateColor</filter-value> после UpdatePosition и подключите затухающий цвет к нему",
    "Добавьте блок <filter-value>UpdateSize</filter-value> после UpdateColor и используйте соотношение возраста для временного роста размера",
    "Добавьте блок <filter-value>Time</filter-value> и блок <filter-value>Float</filter-value> для скорости вращения",
    "Добавьте математический блок <filter-value>Multiply</filter-value> для вычисления угла вращения (время * скоростьВращения)",
    "Добавьте блок <filter-value>UpdateAngle</filter-value> после UpdateSize и подключите угол вращения к нему",
    "Подключите выход UpdateAngle к блоку System",
    "Наблюдайте сложный, многослойный эффект частиц"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "Интеграция Сложной Системы",
      "description": "Этот урок объединяет множество блоков и техник: UpdateDirectionBlock, ParticleRandomBlock, временные расчеты, векторные операции и обновления угла. Все работают вместе для создания сложного эффекта. В визуальном редакторе вы можете найти эти блоки в списке блоков и настроить их свойства в панели свойств справа.",
      "properties": []
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение кода",
  "codeCopy": "Сложные системы частиц объединяют множество техник для создания богатых, динамических эффектов. Эта система использует случайность для вариации, временные расчеты для эволюции со временем, обновления направления для динамического движения и вращение угла для визуального интереса. Ключ в организации этих техник в согласованную цепочку блоков, которая логично течет от создания к финальному выходу.",
  "objectivesTitle": "Цели обучения",
  "objectives": [
    "Объединять множество техник в одной системе",
    "Эффективно организовывать сложные цепочки блоков",
    "Создавать готовые к продакшену эффекты частиц",
    "Понять, как разные техники работают вместе",
    "Проектировать сложные системы частиц с нуля"
  ],
  "commonMistakesTitle": "Распространенные ошибки",
  "commonMistakes": [
    {
      "mistake": "Усложнение системы",
      "explanation": "Добавление слишком многих эффектов может сделать систему трудной для понимания и отладки. Начните просто и добавляйте сложность постепенно.",
      "solution": "Стройте системы инкрементально. Начните с базового движения, затем добавьте цвет, затем размер, затем продвинутые функции. Тестируйте на каждом шаге."
    },
    {
      "mistake": "Неорганизация цепочек блоков логично",
      "explanation": "Сложные системы нуждаются в четкой организации. Случайные блоки, соединенные запутанным образом, трудно отлаживать и поддерживать.",
      "solution": "Организуйте блоки в логическом порядке: Создание → Форма → Направление → Позиция → Цвет → Размер → Угол → Система. Держите связанные расчеты вместе."
    }
  ],
  "homeworkTitle": "Практические упражнения",
  "homework": [
    "Создайте свою сложную систему частиц, объединяющую 5+ техник",
    "Экспериментируйте с разными комбинациями эффектов",
    "Оптимизируйте сложную систему для производительности",
    "Создайте тематический эффект (огонь, магия, взрыв) используя множество техник",
    "Документируйте свою сложную систему для будущей справки"
  ]
}

