{
  "title": "6.2: Векторные Операции",
  "summary": "Изучите продвинутые векторные операции, включая расчеты длины и векторную математику",
  "introTitle": "Введение",
  "intro": "В этом уроке вы изучите продвинутые векторные операции для систем частиц. Вы создадите полную систему частиц с нуля, которая демонстрирует расчеты длины векторов, нормализацию и как использовать векторную математику для создания сложных поведений частиц.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте SystemBlock - это корень вашей системы частиц",
    "Создайте CreateParticleBlock для эмиссии частиц",
    "Установите начальный цвет и размер используя ParticleInputBlock",
    "Добавьте PointShapeBlock для эмиссии частиц из одной точки",
    "Добавьте UpdatePositionBlock для обработки движения частиц",
    "Получите Position и ScaledDirection, сложите их и подключите к UpdatePositionBlock",
    "Добавьте ParticleVectorLengthBlock для расчета длины вектора направления",
    "Подключите ScaledDirection к входу vector блока ParticleVectorLengthBlock",
    "Используйте длину вектора для влияния на размер частиц (быстрее частицы = больше)",
    "Умножьте длину на фактор размера для создания множителя размера",
    "Добавьте UpdateColorBlock и подключите контекстное значение InitialColor к нему",
    "Добавьте UpdateSizeBlock и объедините базовый размер с множителем размера",
    "Соедините блоки: CreateParticle → PointShape → UpdatePosition → UpdateColor → UpdateSize → SystemBlock",
    "Добавьте ParticleTextureSourceBlock для предоставления текстуры",
    "Наблюдайте, как размер частиц варьируется в зависимости от скорости движения"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "ParticleVectorLengthBlock",
      "description": "Вычисляет длину (величину) вектора. Полезно для расчетов расстояния, измерений скорости и нормализации векторов.",
      "properties": [
        {
          "name": "vector",
          "value": "Вход Vector3",
          "description": "Вектор, длина которого будет вычислена"
        },
        {
          "name": "length",
          "value": "Выход Float",
          "description": "Вычисленная длина вектора"
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение кода",
  "codeCopy": "Векторные операции необходимы для продвинутых эффектов частиц. ParticleVectorLengthBlock вычисляет величину вектора, которая представляет расстояние или скорость. Это может использоваться для создания эффектов, где свойства частиц (такие как размер или цвет) изменяются в зависимости от того, насколько быстро движется частица. Формула длины вектора: length = sqrt(x² + y² + z²).",
  "objectivesTitle": "Цели обучения",
  "objectives": [
    "Понять ParticleVectorLengthBlock и его использование",
    "Вычислять длины векторов для измерений расстояния и скорости",
    "Использовать длину вектора для влияния на свойства частиц",
    "Комбинировать векторные операции с другими расчетами",
    "Применять векторную математику для создания сложных эффектов"
  ],
  "commonMistakesTitle": "Распространенные ошибки",
  "commonMistakes": [
    {
      "mistake": "Неправильное использование длины вектора",
      "explanation": "Длина вектора всегда положительна (расстояние). Использование ее напрямую для эффектов, которым нужны отрицательные значения или специфические диапазоны, может вызвать проблемы.",
      "solution": "Если вам нужны нормализованные значения или специфические диапазоны, умножьте или разделите длину на соответствующие факторы. Помните: длина всегда >= 0."
    },
    {
      "mistake": "Непонимание того, что представляет длина вектора",
      "explanation": "Длина вектора представляет расстояние или величину, а не направление. Это скалярное значение, а не вектор.",
      "solution": "Используйте длину вектора для эффектов, основанных на расстоянии, расчетов скорости или когда вам нужно нормализовать векторы. Для направления используйте сам вектор."
    }
  ],
  "homeworkTitle": "Практические упражнения",
  "homework": [
    "Создайте частицы, которые изменяют цвет в зависимости от скорости",
    "Используйте длину вектора для создания эффектов, основанных на расстоянии",
    "Комбинируйте длину вектора с расчетами, основанными на возрасте",
    "Экспериментируйте с нормализацией векторов для согласованных направлений",
    "Создайте эффекты, где размер варьируется со скоростью движения"
  ]
}

