{
  "title": "6.3: Оптимизация Производительности",
  "summary": "Изучите лучшие практики для оптимизации производительности систем частиц",
  "introTitle": "Введение",
  "intro": "В этом уроке вы изучите лучшие практики для оптимизации производительности систем частиц. Вы создадите полную, оптимизированную систему частиц с нуля, которая демонстрирует эффективное использование блоков, минимальные расчеты и паттерны проектирования, ориентированные на производительность.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте SystemBlock - это корень вашей системы частиц",
    "Создайте CreateParticleBlock с простыми, постоянными значениями",
    "Используйте меньший базовый размер (0.2) для лучшей производительности",
    "Добавьте <filter-value>BoxShape</filter-value> блок для эмиссии частиц из объема куба",
    "Добавьте UpdatePositionBlock с эффективным расчетом позиции",
    "Получите Position и ScaledDirection, сложите их и подключите к UpdatePositionBlock",
    "Добавьте UpdateColorBlock используя контекстное значение InitialColor (не требуется пересчет)",
    "Добавьте UpdateSizeBlock с постоянным размером (нет расчетов на кадр)",
    "Эффективно соедините блоки: CreateParticle → BoxShape → UpdatePosition → UpdateColor → UpdateSize → System",
    "Добавьте ParticleTextureSourceBlock с эффективной текстурой",
    "Наблюдайте, как оптимизированная система работает плавно"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "Лучшие Практики Производительности",
      "description": "Этот урок фокусируется на техниках оптимизации, а не на новых блоках. Ключевые принципы: используйте контекстные значения когда возможно, минимизируйте расчеты на кадр, используйте постоянные значения где уместно, и держите цепочки блоков простыми.",
      "properties": []
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение кода",
  "codeCopy": "Оптимизация производительности в системах частиц включает минимизацию вычислительных накладных расходов. Используйте контекстные значения (такие как InitialColor) вместо пересчета, используйте постоянные значения для свойств, которые не изменяются, минимизируйте количество математических операций на кадр, и держите цепочки блоков как можно проще. Меньшие размеры частиц и эффективные текстуры также помогают производительности.",
  "objectivesTitle": "Цели обучения",
  "objectives": [
    "Понять принципы оптимизации производительности",
    "Научиться эффективно использовать контекстные значения",
    "Минимизировать расчеты на кадр",
    "Проектировать эффективные цепочки блоков",
    "Применять техники оптимизации к реальным системам"
  ],
  "commonMistakesTitle": "Распространенные ошибки",
  "commonMistakes": [
    {
      "mistake": "Перерасчет значений каждый кадр",
      "explanation": "Перерасчет значений, которые не изменяются (таких как начальный цвет) каждый кадр тратит производительность. Используйте контекстные значения или постоянные входы вместо этого.",
      "solution": "Используйте InitialColor, InitialSize и другие контекстные значения, когда вам нужно исходное свойство частицы. Пересчитывайте только когда значения действительно изменяются."
    },
    {
      "mistake": "Создание ненужно сложных цепочек блоков",
      "explanation": "Сложные цепочки со многими математическими операциями на кадр могут замедлить производительность, особенно с многими частицами.",
      "solution": "Упрощайте цепочки блоков где возможно. Объединяйте расчеты, используйте контекстные значения, и избегайте избыточных операций."
    }
  ],
  "homeworkTitle": "Практические упражнения",
  "homework": [
    "Оптимизируйте существующую систему частиц, упрощая расчеты",
    "Сравните производительность между оптимизированными и неоптимизированными системами",
    "Экспериментируйте с разными размерами частиц, чтобы найти оптимальную точку производительности",
    "Используйте контекстные значения для замены ненужных расчетов",
    "Создайте высокопроизводительную систему частиц с тысячами частиц"
  ]
}

