{
  "ui": {
    "product": "Редактор Частиц",
    "heroTitle": "Полное Руководство",
    "heroSubtitle": "Научитесь создавать потрясающие эффекты частиц от новичка до эксперта",
    "language": "Язык",
    "menu": "Меню",
    "lessonList": "Уроки",
    "editorLabel": "Предпросмотр Редактора",
    "noLesson": "Выберите урок для начала",
    "loadExample": "Загрузить пример",
    "previousLesson": "Предыдущий",
    "nextLesson": "Следующий",
    "viewDocumentation": "Посмотреть Документацию",
    "particlesDocumentation": "Документация по Частицам",
    "mobileNotSupported": "Только для Десктопа",
    "mobileMessage": "Это приложение оптимизировано для десктопных устройств. Пожалуйста, откройте его на настольном компьютере или ноутбуке для лучшего опыта."
  },
  "lessons": {
    "lesson1": {
      "title": "Урок 1: Первая Эмиссия",
      "summary": "Создайте свою первую систему частиц с базовыми блоками",
      "introTitle": "Введение",
      "intro": "В этом уроке вы научитесь создавать простую систему частиц, используя Редактор Частиц. Мы начнем с основных блоков: SystemBlock, UpdatePositionBlock и CreateParticleBlock.",
      "stepsTitle": "Пошаговые Инструкции",
      "steps": [
        "Создайте SystemBlock - это корень вашей системы частиц",
        "Добавьте UpdatePositionBlock для обработки движения частиц",
        "Подключите CreateParticleBlock с BoxShapeBlock для эмиссии частиц из формы куба",
        "Используйте ParticleInputBlock для получения текущей позиции и масштабированного направления",
        "Добавьте ParticleMathBlock для объединения позиции и направления",
        "Подключите результат к входу position блока UpdatePositionBlock",
        "Добавьте ParticleTextureSourceBlock для предоставления текстуры частицам"
      ],
      "blocksTitle": "Блоки, Используемые в Этом Уроке",
      "blocks": [
        {
          "name": "SystemBlock",
          "description": "Корневой блок любой системы частиц. Управляет общими свойствами системы и подключается ко всем блокам, связанным с частицами.",
          "properties": [
            {
              "name": "name",
              "value": "'Particle System'",
              "description": "Отображаемое имя системы частиц"
            }
          ]
        },
        {
          "name": "UpdatePositionBlock",
          "description": "Обновляет позицию частиц каждый кадр. Этот блок необходим для любого движения частиц.",
          "properties": [
            {
              "name": "name",
              "value": "'Update position'",
              "description": "Отображаемое имя блока"
            }
          ]
        },
        {
          "name": "CreateParticleBlock",
          "description": "Создает новые частицы. Этот блок отвечает за эмиссию частиц.",
          "properties": [
            {
              "name": "name",
              "value": "'Create particle'",
              "description": "Отображаемое имя блока"
            }
          ]
        },
        {
          "name": "BoxShapeBlock",
          "description": "Определяет эмиттер в форме куба. Частицы будут создаваться в объеме этого куба.",
          "properties": [
            {
              "name": "name",
              "value": "'Box emitter'",
              "description": "Отображаемое имя эмиттера"
            }
          ]
        },
        {
          "name": "ParticleInputBlock",
          "description": "Получает контекстные данные частиц, такие как позиция, скорость или возраст. В этом уроке мы используем его для получения текущей позиции и масштабированного направления.",
          "properties": [
            {
              "name": "contextualValue",
              "value": "NodeParticleContextualSources.Position / ScaledDirection",
              "description": "Тип контекстных данных для получения"
            }
          ]
        },
        {
          "name": "ParticleMathBlock",
          "description": "Выполняет математические операции над данными частиц. Мы используем его для сложения векторов позиции и направления.",
          "properties": [
            {
              "name": "operation",
              "value": "ParticleMathBlockOperations.Add",
              "description": "Математическая операция для выполнения (Add, Subtract, Multiply, Divide и т.д.)"
            }
          ]
        },
        {
          "name": "ParticleTextureSourceBlock",
          "description": "Предоставляет текстуру для частиц. Это определяет, как частицы выглядят при рендеринге.",
          "properties": [
            {
              "name": "url",
              "value": "Tools.GetAssetUrl('https://assets.babylonjs.com/core/textures/flare.png')",
              "description": "URL изображения текстуры для использования"
            }
          ]
        }
      ],
      "properties": "Свойства",
      "codeTitle": "Объяснение Кода",
      "codeCopy": "Код создает NodeParticleSystemSet и строит граф связанных блоков. Каждый блок имеет определенную функцию, и они связаны с помощью метода connectTo().",
      "homeworkTitle": "Упражнения для Практики",
      "homework": [
        "Попробуйте изменить BoxShapeBlock на другую форму",
        "Экспериментируйте с разными URL текстур",
        "Измените математическую операцию, чтобы увидеть, как это влияет на движение частиц",
        "Добавьте больше частиц, настроив параметры CreateParticleBlock"
      ]
    },
    "lesson2": {
      "title": "Урок 2: Свойства Частиц",
      "summary": "Научитесь комбинировать и управлять несколькими свойствами частиц (цвет, размер, масштаб) вместе",
      "introTitle": "Введение",
      "intro": "В этом уроке вы научитесь комбинировать несколько свойств частиц (цвет, размер и масштаб) для создания сложных эффектов. Мы будем использовать UpdateColorBlock, UpdateSizeBlock и UpdateScaleBlock вместе, показывая, как комбинировать их с математическими операциями. Вы увидите, как свойства могут взаимодействовать друг с другом и как создавать эффекты неравномерного масштабирования.",
      "stepsTitle": "Пошаговые Инструкции",
      "steps": [
        "Начните с базовой системы частиц из Урока 1",
        "Получите возраст и время жизни частицы, используя ParticleInputBlock",
        "Вычислите соотношение возраста (Возраст / Время жизни) для получения значения от 0 до 1",
        "Создайте сложный градиент цвета, используя ParticleConverterBlock с несколькими компонентами",
        "Объедините соотношение возраста с инвертированным соотношением для создания переходов цвета (красный увеличивается, зеленый/синий затухают)",
        "Добавьте UpdateSizeBlock с расчетом роста: размер растет от базового до базового * (1 + рост * соотношениеВозраста)",
        "Добавьте UpdateScaleBlock с неравномерным масштабированием: X уменьшается, а Y увеличивается",
        "Соедините все блоки обновления вместе: UpdatePosition → UpdateColor → UpdateSize → UpdateScale",
        "Наблюдайте, как все свойства работают вместе для создания целостного эффекта"
      ],
      "blocksTitle": "Блоки, Используемые в Этом Уроке",
      "blocks": [
        {
          "name": "UpdateColorBlock",
          "description": "Обновляет цвет частиц каждый кадр. Вы можете подключить значение цвета для создания затухания, переходов цвета или других цветовых эффектов.",
          "properties": [
            {
              "name": "name",
              "value": "'Update color'",
              "description": "Отображаемое имя блока"
            },
            {
              "name": "color",
              "value": "Color4 input",
              "description": "Цвет для применения к частице. Может быть подключен из ParticleInputBlock (InitialColor, Color) или блока ввода Color4."
            }
          ]
        },
        {
          "name": "UpdateSizeBlock",
          "description": "Обновляет размер частиц. Полезно для создания частиц, которые растут или уменьшаются со временем.",
          "properties": [
            {
              "name": "name",
              "value": "'Update size'",
              "description": "Отображаемое имя блока"
            },
            {
              "name": "size",
              "value": "Float input",
              "description": "Значение размера для применения. Может быть константой или вычислено с помощью математических операций."
            }
          ]
        },
        {
          "name": "UpdateScaleBlock",
          "description": "Обновляет масштаб частиц. Масштаб влияет на визуальный размер частицы независимо от свойства size.",
          "properties": [
            {
              "name": "name",
              "value": "'Update scale'",
              "description": "Отображаемое имя блока"
            },
            {
              "name": "scale",
              "value": "Float or Vector2 input",
              "description": "Значение масштаба. Может быть одним float или Vector2 для разного масштабирования X/Y."
            }
          ]
        },
        {
          "name": "ParticleInputBlock (Age)",
          "description": "Получает текущий возраст частицы. Возраст начинается с 0, когда частица создана, и увеличивается до достижения значения lifetime.",
          "properties": [
            {
              "name": "contextualValue",
              "value": "NodeParticleContextualSources.Age",
              "description": "Тип контекстных данных - Age в данном случае"
            }
          ]
        },
        {
          "name": "ParticleInputBlock (Lifetime)",
          "description": "Получает общее время жизни частицы. Это максимальный возраст, которого может достичь частица перед смертью.",
          "properties": [
            {
              "name": "contextualValue",
              "value": "NodeParticleContextualSources.Lifetime",
              "description": "Тип контекстных данных - Lifetime в данном случае"
            }
          ]
        },
        {
          "name": "ParticleInputBlock (InitialColor)",
          "description": "Получает начальный цвет частицы при её создании. Полезно для создания переходов цвета.",
          "properties": [
            {
              "name": "contextualValue",
              "value": "NodeParticleContextualSources.InitialColor",
              "description": "Тип контекстных данных - InitialColor в данном случае"
            }
          ]
        },
        {
          "name": "ParticleMathBlock (Divide)",
          "description": "Делит два значения. В этом уроке мы используем его для расчета соотношения возраста (Age / Lifetime), что дает нам значение от 0 до 1, представляющее, насколько далеко в своей жизни находится частица.",
          "properties": [
            {
              "name": "operation",
              "value": "ParticleMathBlockOperations.Divide",
              "description": "Математическая операция - Divide"
            }
          ]
        },
        {
          "name": "ParticleMathBlock (Multiply)",
          "description": "Умножает два значения. Используется для расчета конечного размера путем умножения базового размера на множитель.",
          "properties": [
            {
              "name": "operation",
              "value": "ParticleMathBlockOperations.Multiply",
              "description": "Математическая операция - Multiply"
            }
          ]
        },
        {
          "name": "ParticleMathBlock (Add)",
          "description": "Складывает два значения. Используется для создания множителя размера, который увеличивается от 1.0 до 2.0 на основе возраста.",
          "properties": [
            {
              "name": "operation",
              "value": "ParticleMathBlockOperations.Add",
              "description": "Математическая операция - Add"
            }
          ]
        }
      ],
      "properties": "Свойства",
      "codeTitle": "Объяснение Кода",
      "codeCopy": "Этот урок демонстрирует, как комбинировать несколько свойств частиц вместе. Ключевая концепция заключается в том, что свойства могут вычисляться с использованием того же соотношения возраста, но с разными формулами. Для цвета мы используем соотношениеВозраста напрямую для красного и (1 - соотношениеВозраста) для зеленого/синего. Для размера мы вычисляем: базовыйРазмер * (1 + множительРоста * соотношениеВозраста), создавая рост. Для масштаба мы используем разные формулы для X и Y: масштабX = базовыйX * (1 - соотношениеВозраста), масштабY = базовыйY * (1 + соотношениеВозраста). Это создает неравномерное масштабирование, где частицы становятся шире, но короче со временем. Комбинируя все эти свойства, мы создаем богатые, динамические эффекты.",
      "homeworkTitle": "Упражнения для Практики",
      "homework": [
        "Попробуйте сделать так, чтобы частицы уменьшались, а не росли со временем",
        "Создайте переход цвета от красного к синему, используя математические операции",
        "Экспериментируйте с разными множителями размера",
        "Добавьте вращение, используя UpdateAngleBlock",
        "Попробуйте использовать UpdateAgeBlock для ручного управления временем жизни частиц"
      ]
    },
    "lesson3": {
      "title": "Урок 3: Различные Формы Эмиттеров",
      "summary": "Изучите различные формы эмиттеров: конус, сфера, куб и другие",
      "introTitle": "Введение",
      "intro": "В этом уроке вы узнаете о различных формах эмиттеров, доступных в Редакторе Частиц. Каждая форма создает частицы из разного объема, давая вам контроль над тем, где появляются частицы. Мы сосредоточимся на ConeShapeBlock, который создает направленные эффекты, такие как огонь или фонтаны, и поймем его свойства, такие как радиус, угол, радиусДиапазон и высотаДиапазон.",
      "stepsTitle": "Пошаговые Инструкции",
      "steps": [
        "Начните с базовой настройки системы частиц",
        "Замените BoxShapeBlock на SphereShapeBlock",
        "Подключите ParticleInputBlock для установки радиуса сферы",
        "Подключите еще один ParticleInputBlock для установки диапазона радиуса (0 = только центр, 1 = вся сфера)",
        "Добавьте direction randomizer для управления направлением эмиссии частиц",
        "Экспериментируйте с разными значениями радиуса, чтобы увидеть, как это влияет на распределение частиц",
        "Попробуйте другие формы: ConeShapeBlock, CylinderShapeBlock или PointShapeBlock"
      ],
      "blocksTitle": "Блоки, Используемые в Этом Уроке",
      "blocks": [
        {
          "name": "SphereShapeBlock",
          "description": "Эмитирует частицы из сферической формы. Частицы появляются в объеме сферы, с контролем радиуса и распределения.",
          "properties": [
            {
              "name": "name",
              "value": "'Sphere emitter'",
              "description": "Отображаемое имя эмиттера"
            },
            {
              "name": "radius",
              "value": "Float input (по умолчанию: 1.0)",
              "description": "Радиус сферы. Большие значения создают большую область эмиссии."
            },
            {
              "name": "radiusRange",
              "value": "Float input (по умолчанию: 1.0, диапазон: 0-1)",
              "description": "Контролирует, где появляются частицы внутри сферы. 0 = только центр, 1 = где угодно в сфере."
            },
            {
              "name": "directionRandomizer",
              "value": "Float input (по умолчанию: 0, диапазон: 0-1)",
              "description": "Контролирует случайность направления частиц. 0 = равномерное направление, 1 = полностью случайное."
            }
          ]
        },
        {
          "name": "BoxShapeBlock",
          "description": "Эмитирует частицы из формы куба/коробки. Частицы появляются в объеме куба, определенном шириной, высотой и глубиной.",
          "properties": [
            {
              "name": "name",
              "value": "'Box emitter'",
              "description": "Отображаемое имя эмиттера"
            }
          ]
        },
        {
          "name": "ConeShapeBlock",
          "description": "Эмитирует частицы из конической формы. Полезно для создания направленных эффектов, таких как огонь, дым или фонтаны.",
          "properties": [
            {
              "name": "name",
              "value": "'Cone emitter'",
              "description": "Отображаемое имя эмиттера"
            },
            {
              "name": "radius",
              "value": "Float input",
              "description": "Базовый радиус конуса"
            },
            {
              "name": "angle",
              "value": "Float input",
              "description": "Угол конуса в радианах"
            }
          ]
        },
        {
          "name": "CylinderShapeBlock",
          "description": "Эмитирует частицы из цилиндрической формы. Частицы появляются в цилиндрическом объеме.",
          "properties": [
            {
              "name": "name",
              "value": "'Cylinder emitter'",
              "description": "Отображаемое имя эмиттера"
            },
            {
              "name": "radius",
              "value": "Float input",
              "description": "Радиус цилиндра"
            },
            {
              "name": "height",
              "value": "Float input",
              "description": "Высота цилиндра"
            }
          ]
        },
        {
          "name": "PointShapeBlock",
          "description": "Эмитирует частицы из одной точки. Все частицы появляются из одного и того же места, полезно для концентрированных эффектов.",
          "properties": [
            {
              "name": "name",
              "value": "'Point emitter'",
              "description": "Отображаемое имя эмиттера"
            }
          ]
        }
      ],
      "properties": "Свойства",
      "codeTitle": "Объяснение Кода",
      "codeCopy": "Различные формы эмиттеров дают вам контроль над пространственным распределением частиц. SphereShapeBlock создает частицы в сферическом объеме, в то время как BoxShapeBlock использует прямоугольный объем. Каждая форма имеет определенные свойства, такие как радиус, высота или угол, которые контролируют область эмиссии. Свойство radiusRange в SphereShapeBlock особенно полезно - оно позволяет контролировать, появляются ли частицы только в центре (0) или по всему объему (1).",
      "homeworkTitle": "Упражнения для Практики",
      "homework": [
        "Попробуйте изменить радиус сферы, чтобы увидеть, как это влияет на распределение частиц",
        "Экспериментируйте со значениями radiusRange от 0 до 1",
        "Замените SphereShapeBlock на ConeShapeBlock и настройте угол",
        "Создайте систему частиц, используя CylinderShapeBlock",
        "Сравните визуальную разницу между PointShapeBlock и SphereShapeBlock с radiusRange = 0"
      ]
    },
    "lesson4": {
      "title": "Урок 4: Базовые Силы и Физика",
      "summary": "Научитесь применять силы, такие как гравитация, к частицам с помощью UpdateDirectionBlock",
      "introTitle": "Введение",
      "intro": "В этом уроке вы научитесь применять силы к частицам, такие как гравитация. Мы будем использовать UpdateDirectionBlock для изменения направления частиц со временем и комбинировать его с delta time для создания реалистичного физического движения.",
      "stepsTitle": "Пошаговые Инструкции",
      "steps": [
        "Начните с базовой системы частиц, используя PointShapeBlock",
        "Добавьте UpdateDirectionBlock для изменения направления частиц",
        "Получите текущее направление, используя ParticleInputBlock с контекстным значением Direction",
        "Получите delta time, используя ParticleInputBlock с системным источником Delta",
        "Создайте вектор гравитации, используя ParticleConverterBlock (0, -9.8, 0 для гравитации вниз)",
        "Умножьте гравитацию на delta time, чтобы получить ускорение гравитации за кадр",
        "Добавьте дельту гравитации к текущему направлению, используя ParticleMathBlock",
        "Подключите результат к входу direction блока UpdateDirectionBlock",
        "Соедините цепочку: UpdateDirection → UpdatePosition → UpdateColor → UpdateSize"
      ],
      "blocksTitle": "Блоки, Используемые в Этом Уроке",
      "blocks": [
        {
          "name": "UpdateDirectionBlock",
          "description": "Обновляет направление частиц каждый кадр. Это необходимо для применения сил, таких как гравитация, ветер или другие направленные эффекты.",
          "properties": [
            {
              "name": "name",
              "value": "'Update direction'",
              "description": "Отображаемое имя блока"
            },
            {
              "name": "direction",
              "value": "Vector3 input",
              "description": "Новый вектор направления для применения к частице. Может быть вычислен из текущего направления плюс силы."
            }
          ]
        },
        {
          "name": "ParticleInputBlock (Direction)",
          "description": "Получает текущее направление частицы. Направление представляет вектор скорости частицы.",
          "properties": [
            {
              "name": "contextualValue",
              "value": "NodeParticleContextualSources.Direction",
              "description": "Тип контекстных данных - Direction в данном случае"
            }
          ]
        },
        {
          "name": "ParticleInputBlock (Delta Time)",
          "description": "Получает delta time из системы. Delta time - это время, прошедшее с последнего кадра, необходимое для физических расчетов, независимых от частоты кадров.",
          "properties": [
            {
              "name": "systemSource",
              "value": "NodeParticleSystemSources.Delta",
              "description": "Системный источник - Delta для delta time"
            }
          ]
        },
        {
          "name": "ParticleConverterBlock",
          "description": "Создает Vector3 из отдельных значений Float X, Y, Z. Используется для построения вектора гравитации (0, -9.8, 0).",
          "properties": [
            {
              "name": "xIn, yIn, zIn",
              "value": "Float inputs",
              "description": "Отдельные входы Float для компонентов X, Y, Z"
            },
            {
              "name": "xyzOut",
              "value": "Vector3 output",
              "description": "Объединенный выход Vector3"
            }
          ]
        },
        {
          "name": "ParticleMathBlock (Multiply)",
          "description": "Умножает два значения. Используется для умножения гравитации на delta time, обеспечивая независимость физических расчетов от частоты кадров.",
          "properties": [
            {
              "name": "operation",
              "value": "ParticleMathBlockOperations.Multiply",
              "description": "Математическая операция - Multiply"
            }
          ]
        },
        {
          "name": "ParticleMathBlock (Add)",
          "description": "Складывает два значения Vector3. Используется для добавления ускорения гравитации к текущему вектору направления.",
          "properties": [
            {
              "name": "operation",
              "value": "ParticleMathBlockOperations.Add",
              "description": "Математическая операция - Add"
            }
          ]
        },
        {
          "name": "PointShapeBlock",
          "description": "Эмитирует частицы из одной точки. Используется в этом уроке для создания частиц, которые падают из-за гравитации.",
          "properties": [
            {
              "name": "name",
              "value": "'Point emitter'",
              "description": "Отображаемое имя эмиттера"
            }
          ]
        }
      ],
      "properties": "Свойства",
      "codeTitle": "Объяснение Кода",
      "codeCopy": "Этот урок демонстрирует, как применять силы к частицам. Ключевая концепция заключается в том, что силы изменяют направление со временем. Мы умножаем силу (гравитацию) на delta time, чтобы эффект был постоянным независимо от частоты кадров. Формула: newDirection = currentDirection + (force * deltaTime). Это создает реалистичное физическое движение, где частицы ускоряются вниз из-за гравитации.",
      "homeworkTitle": "Упражнения для Практики",
      "homework": [
        "Попробуйте изменить значение гравитации Y, чтобы увидеть, как это влияет на скорость падения частиц",
        "Создайте гравитацию вверх, установив гравитацию Y в положительное значение",
        "Добавьте горизонтальные силы, изменив гравитацию X или Z",
        "Экспериментируйте с разными величинами гравитации",
        "Попробуйте комбинировать несколько сил, добавив больше математических операций"
      ]
    },
    "lesson5": {
      "title": "Урок 5: Продвинутое Управление Цветом",
      "summary": "Научитесь создавать плавные цветовые переходы и градиенты с помощью ParticleLerpBlock",
      "introTitle": "Введение",
      "intro": "В этом уроке вы научитесь создавать плавные цветовые переходы в течение жизни частицы. Мы будем использовать ParticleLerpBlock для интерполяции между двумя цветами на основе возраста частицы, создавая красивые эффекты затухания и цветовые анимации.",
      "stepsTitle": "Пошаговые Инструкции",
      "steps": [
        "Начните с базовой системы частиц, используя BoxShapeBlock",
        "Добавьте UpdateColorBlock для изменения цвета частиц",
        "Получите возраст и время жизни частицы, используя ParticleInputBlock",
        "Вычислите соотношение возраста (age / lifetime), чтобы получить значение от 0 до 1",
        "Создайте начальный цвет, используя ParticleConverterBlock (например, ярко-красный)",
        "Создайте конечный цвет, используя ParticleConverterBlock (например, синий с прозрачностью)",
        "Используйте ParticleLerpBlock для интерполяции между начальным и конечным цветами",
        "Подключите соотношение возраста к входу gradient блока ParticleLerpBlock",
        "Подключите интерполированный цвет к входу color блока UpdateColorBlock"
      ],
      "blocksTitle": "Блоки, Используемые в Этом Уроке",
      "blocks": [
        {
          "name": "ParticleLerpBlock",
          "description": "Линейно интерполирует (lerp) между двумя значениями на основе фактора градиента (0 до 1). Работает с типами Float, Vector2, Vector3 и Color4. Идеально подходит для создания плавных переходов.",
          "properties": [
            {
              "name": "name",
              "value": "'Color Lerp'",
              "description": "Отображаемое имя блока"
            },
            {
              "name": "left",
              "value": "Color4 input",
              "description": "Начальное значение (когда gradient = 0)"
            },
            {
              "name": "right",
              "value": "Color4 input",
              "description": "Конечное значение (когда gradient = 1)"
            },
            {
              "name": "gradient",
              "value": "Float input (0 to 1)",
              "description": "Фактор интерполяции. 0 = значение left, 1 = значение right, 0.5 = посередине"
            }
          ]
        },
        {
          "name": "ParticleConverterBlock (Color4)",
          "description": "Создает Color4 из отдельных значений Float R, G, B, A. Используется для определения пользовательских цветов для начала и конца цветовых переходов.",
          "properties": [
            {
              "name": "xIn, yIn, zIn, wIn",
              "value": "Float inputs",
              "description": "Отдельные входы Float для компонентов R, G, B, A (xIn = R, yIn = G, zIn = B, wIn = A)"
            },
            {
              "name": "colorOut",
              "value": "Color4 output",
              "description": "Объединенный выход Color4"
            }
          ]
        },
        {
          "name": "ParticleInputBlock (Age)",
          "description": "Получает текущий возраст частицы. Возраст увеличивается от 0 до lifetime по мере жизни частицы.",
          "properties": [
            {
              "name": "contextualValue",
              "value": "NodeParticleContextualSources.Age",
              "description": "Тип контекстных данных - Age в данном случае"
            }
          ]
        },
        {
          "name": "ParticleInputBlock (Lifetime)",
          "description": "Получает общее время жизни частицы. Это максимальный возраст, которого может достичь частица перед смертью.",
          "properties": [
            {
              "name": "contextualValue",
              "value": "NodeParticleContextualSources.Lifetime",
              "description": "Тип контекстных данных - Lifetime в данном случае"
            }
          ]
        },
        {
          "name": "ParticleMathBlock (Divide)",
          "description": "Делит два значения. Используется для вычисления соотношения возраста: age / lifetime, что дает значение от 0 (рождение) до 1 (смерть).",
          "properties": [
            {
              "name": "operation",
              "value": "ParticleMathBlockOperations.Divide",
              "description": "Математическая операция - Divide"
            }
          ]
        }
      ],
      "properties": "Свойства",
      "codeTitle": "Объяснение Кода",
      "codeCopy": "Этот урок демонстрирует цветовую интерполяцию с использованием линейной интерполяции (lerp). Формула: result = (1 - gradient) * left + gradient * right. Когда gradient = 0, мы получаем цвет left (начало). Когда gradient = 1, мы получаем цвет right (конец). Используя age / lifetime в качестве градиента, частицы плавно переходят от начального цвета к конечному в течение своей жизни. Эта техника необходима для создания эффектов затухания, цветовых анимаций и плавных визуальных переходов.",
      "homeworkTitle": "Упражнения для Практики",
      "homework": [
        "Попробуйте разные цветовые комбинации (например, желтый к фиолетовому, зеленый к голубому)",
        "Создайте цветовой переход, который затухает до прозрачного (установите конечную альфу в 0)",
        "Экспериментируйте с нелинейными переходами, модифицируя соотношение возраста математическими операциями",
        "Попробуйте создать цветовой цикл, используя несколько ParticleLerpBlocks",
        "Комбинируйте цветовые переходы с изменениями размера для более динамичных эффектов"
      ]
    },
    "lesson6": {
      "title": "Урок 6: Движение и Физика",
      "summary": "Научитесь комбинировать контроль скорости и эффекты сопротивления для создания реалистичной физики частиц",
      "introTitle": "Введение",
      "intro": "В этом уроке вы научитесь комбинировать контроль скорости и эффекты сопротивления для создания реалистичной физики частиц. Вы будете использовать ParticleLerpBlock для создания переходов скорости (быстро к медленно) и комбинировать его с расчетами сопротивления для симуляции сопротивления воздуха. Комбинируя оба эффекта, вы создаете частицы, которые начинают быстро, замедляются со временем и испытывают сопротивление - создавая более естественное, основанное на физике движение.",
      "stepsTitle": "Пошаговые Инструкции",
      "steps": [
        "Начните с базовой системы частиц, используя PointShapeBlock",
        "Получите направление и масштаб направления частицы, используя ParticleInputBlock",
        "Получите возраст и время жизни частицы для создания физики на основе времени",
        "Вычислите соотношение возраста (возраст / время жизни) для получения значения от 0 до 1",
        "ЧАСТЬ 1 - Контроль Скорости: Используйте ParticleLerpBlock для интерполяции между начальной скоростью (2.0) и конечной скоростью (0.5)",
        "ЧАСТЬ 2 - Эффект Сопротивления: Используйте ParticleLerpBlock для интерполяции сопротивления от 0.0 до 0.6",
        "Вычислите фактор сопротивления: (1 - сопротивление) для уменьшения скорости",
        "Объедините оба эффекта: скоростьЛерп * (1 - сопротивлениеЛерп)",
        "Умножьте базовый масштаб направления на объединенный фактор",
        "Вычислите масштабированное направление и добавьте его к позиции"
      ],
      "blocksTitle": "Блоки, Используемые в Этом Уроке",
      "blocks": [
        {
          "name": "ParticleInputBlock (DirectionScale)",
          "description": "Получает масштаб направления частицы. DirectionScale - это множитель, который определяет, как далеко частица перемещается каждый кадр. Он умножается на вектор направления, чтобы получить фактическое расстояние движения.",
          "properties": [
            {
              "name": "contextualValue",
              "value": "NodeParticleContextualSources.DirectionScale",
              "description": "Тип контекстных данных - DirectionScale в данном случае"
            }
          ]
        },
        {
          "name": "ParticleInputBlock (Direction)",
          "description": "Получает текущий вектор направления частицы. Направление представляет вектор скорости, и при умножении на DirectionScale дает фактическое движение за кадр.",
          "properties": [
            {
              "name": "contextualValue",
              "value": "NodeParticleContextualSources.Direction",
              "description": "Тип контекстных данных - Direction в данном случае"
            }
          ]
        },
        {
          "name": "ParticleLerpBlock (Speed)",
          "description": "Интерполирует между двумя значениями скорости на основе соотношения возраста. Используется для создания плавных переходов скорости (например, от быстрой к медленной, от медленной к быстрой).",
          "properties": [
            {
              "name": "left",
              "value": "Float input (начальная скорость)",
              "description": "Начальное значение скорости (когда gradient = 0)"
            },
            {
              "name": "right",
              "value": "Float input (конечная скорость)",
              "description": "Конечное значение скорости (когда gradient = 1)"
            },
            {
              "name": "gradient",
              "value": "Float input (соотношение возраста)",
              "description": "Фактор интерполяции на основе возраста частицы"
            }
          ]
        },
        {
          "name": "ParticleMathBlock (Multiply)",
          "description": "Умножает два значения. Используется для умножения масштаба направления на множитель скорости и для умножения направления на модифицированный масштаб, чтобы получить финальный вектор движения.",
          "properties": [
            {
              "name": "operation",
              "value": "ParticleMathBlockOperations.Multiply",
              "description": "Математическая операция - Multiply"
            }
          ]
        }
      ],
      "properties": "Свойства",
      "codeTitle": "Объяснение Кода",
      "codeCopy": "Этот урок демонстрирует комбинирование контроля скорости и эффектов сопротивления. Ключевая концепция заключается в комбинировании нескольких физических эффектов: скоростьЛерп контролирует базовый переход скорости (быстро к медленно), в то время как сопротивлениеЛерп симулирует сопротивление воздуха (увеличивается со временем). Объединенная формула: финальныйМасштаб = масштабНаправления * скоростьЛерп * (1 - сопротивлениеЛерп). Это создает частицы, которые начинают быстро (скоростьЛерп = 2.0, сопротивление = 0), постепенно замедляются (скоростьЛерп уменьшается до 0.5) и испытывают увеличивающееся сопротивление (сопротивление увеличивается до 0.6). Результат - реалистичная физика, где частицы замедляются как от уменьшения скорости, так и от сопротивления воздуха.",
      "homeworkTitle": "Упражнения для Практики",
      "homework": [
        "Попробуйте обратить переход скорости (начать медленно, закончить быстро)",
        "Создайте частицы, которые ускоряются в середине своей жизни",
        "Экспериментируйте с разными диапазонами скорости (например, 0.1 до 3.0)",
        "Комбинируйте управление скоростью с цветовыми переходами для более динамичных эффектов",
        "Попробуйте использовать нелинейные кривые скорости, модифицируя соотношение возраста математическими операциями"
      ]
    },
    "lesson7": {
      "title": "Урок 7: Шум и Случайность",
      "summary": "Научитесь добавлять случайность к свойствам частиц, используя ParticleRandomBlock",
      "introTitle": "Введение",
      "intro": "В этом уроке вы научитесь добавлять случайность и вариативность в ваши системы частиц, используя ParticleRandomBlock. Случайность необходима для создания органичных, естественно выглядящих эффектов. Вы научитесь рандомизировать цвета, размеры и другие свойства, а также поймете различные режимы блокировки, которые контролируют, когда генерируются случайные значения.",
      "stepsTitle": "Пошаговые Инструкции",
      "steps": [
        "Начните с базовой системы частиц, используя PointShapeBlock",
        "Добавьте UpdateColorBlock для изменения цвета частиц",
        "Создайте два цветовых входа: minColor (синий) и maxColor (оранжевый)",
        "Используйте ParticleRandomBlock для генерации случайного цвета между min и max",
        "Установите lockMode в OncePerParticle, чтобы каждая частица получала фиксированный случайный цвет на всю свою жизнь",
        "Подключите случайный цвет к UpdateColorBlock",
        "Добавьте UpdateSizeBlock для изменения размера частиц",
        "Создайте входы minSize и maxSize",
        "Используйте еще один ParticleRandomBlock для рандомизации размера с режимом блокировки OncePerParticle",
        "Подключите случайный размер к UpdateSizeBlock"
      ],
      "blocksTitle": "Блоки, Используемые в Этом Уроке",
      "blocks": [
        {
          "name": "ParticleRandomBlock",
          "description": "Генерирует случайные значения между минимумом и максимумом. Поддерживает типы Float, Vector2, Vector3 и Color4. Необходим для добавления вариативности в системы частиц.",
          "properties": [
            {
              "name": "name",
              "value": "'Random Color' или 'Random Size'",
              "description": "Отображаемое имя блока"
            },
            {
              "name": "min",
              "value": "Input (того же типа, что и max)",
              "description": "Минимальное значение для генерации случайных чисел"
            },
            {
              "name": "max",
              "value": "Input (того же типа, что и min)",
              "description": "Максимальное значение для генерации случайных чисел"
            },
            {
              "name": "lockMode",
              "value": "ParticleRandomBlockLocks enum",
              "description": "Контролирует, когда генерируется случайное значение: None (каждый кадр), PerParticle (один раз на частицу за кадр), PerSystem (один раз на систему), OncePerParticle (один раз при создании частицы)"
            }
          ]
        },
        {
          "name": "ParticleInputBlock (Color4)",
          "description": "Предоставляет значение Color4. Используется для определения минимального и максимального цветов для генерации случайного цвета.",
          "properties": [
            {
              "name": "value",
              "value": "Color4",
              "description": "Значение цвета (например, new Color4(0.2, 0.5, 1.0, 1.0) для синего)"
            }
          ]
        }
      ],
      "properties": "Свойства",
      "codeTitle": "Объяснение Кода",
      "codeCopy": "Этот урок демонстрирует использование ParticleRandomBlock для добавления случайности к свойствам частиц. Ключевая концепция - это свойство lockMode, которое определяет, когда генерируются случайные значения. OncePerParticle гарантирует, что каждая частица получает случайное значение при создании, и это значение остается постоянным в течение всей жизни частицы. Это идеально подходит для свойств, таких как цвет и размер, где вы хотите вариативность между частицами, но постоянство для каждой отдельной частицы. Формула для генерации случайных чисел: randomValue = min + Math.random() * (max - min).",
      "homeworkTitle": "Упражнения для Практики",
      "homework": [
        "Попробуйте разные значения lockMode (PerParticle, PerSystem) и наблюдайте различия",
        "Рандомизируйте направление частиц, используя случайные значения Vector3",
        "Создайте систему частиц со случайными цветами по всему спектру",
        "Комбинируйте случайный размер с изменениями размера на основе возраста",
        "Экспериментируйте со случайными значениями Vector2 для масштаба частиц"
      ]
    },
    "lesson8": {
      "title": "Урок 8: Притягиватели",
      "summary": "Научитесь создавать притягиватели частиц, которые притягивают частицы к определенным точкам в пространстве",
      "introTitle": "Введение",
      "intro": "В этом уроке вы научитесь использовать UpdateAttractorBlock для создания притягивателей, которые притягивают частицы к определенным точкам в пространстве. Притягиватели полезны для создания эффектов, таких как частицы, притягиваемые к черной дыре, магнитным полям или гравитационным колодцам. Вы научитесь устанавливать позицию притягивателя, силу и комбинировать притягиватели с другими эффектами.",
      "stepsTitle": "Пошаговые Инструкции",
      "steps": [
        "Начните с базовой системы частиц, используя PointShapeBlock",
        "Добавьте UpdatePositionBlock для базового движения",
        "Добавьте UpdateAttractorBlock после UpdatePositionBlock",
        "Создайте позицию притягивателя, используя ParticleConverterBlock (координаты X, Y, Z)",
        "Установите силу притягивателя (большие значения = сильнее притяжение)",
        "Подключите позицию притягивателя к входу attractor блока UpdateAttractorBlock",
        "Подключите значение силы к входу strength блока UpdateAttractorBlock",
        "Притягиватель будет модифицировать направление частиц, притягивая их к целевой точке"
      ],
      "blocksTitle": "Блоки, Используемые в Этом Уроке",
      "blocks": [
        {
          "name": "UpdateAttractorBlock",
          "description": "Создает эффект притягивателя, который притягивает частицы к определенной точке в 3D пространстве. Сила уменьшается с квадратом расстояния, создавая реалистичное физическое поведение.",
          "properties": [
            {
              "name": "name",
              "value": "'Attractor'",
              "description": "Отображаемое имя блока"
            },
            {
              "name": "attractor",
              "value": "Vector3 input",
              "description": "Позиция притягивателя в 3D пространстве (координаты X, Y, Z)"
            },
            {
              "name": "strength",
              "value": "Float input",
              "description": "Сила силы притяжения. Большие значения создают более сильное притяжение. Сила обратно пропорциональна квадрату расстояния."
            }
          ]
        },
        {
          "name": "ParticleConverterBlock (Vector3)",
          "description": "Создает Vector3 из отдельных значений Float X, Y, Z. Используется для определения позиции притягивателя.",
          "properties": [
            {
              "name": "xIn, yIn, zIn",
              "value": "Float inputs",
              "description": "Отдельные входы Float для компонентов X, Y, Z"
            },
            {
              "name": "xyzOut",
              "value": "Vector3 output",
              "description": "Объединенный выход Vector3"
            }
          ]
        }
      ],
      "properties": "Свойства",
      "codeTitle": "Объяснение Кода",
      "codeCopy": "Этот урок демонстрирует физику притягивателей. Притягиватель создает силу, которая притягивает частицы к целевой точке. Формула для силы: force = (strength / distance²) * direction, где direction - это нормализованный вектор от частицы к притягивателю. Это создает реалистичное поведение, где частицы близко к притягивателю испытывают сильное притяжение, в то время как далекие частицы испытывают слабое притяжение. Притягиватели полезны для создания эффектов, таких как частицы, вращающиеся вокруг центра, притягиваемые к цели, или создающие вихреобразные паттерны.",
      "homeworkTitle": "Упражнения для Практики",
      "homework": [
        "Попробуйте разные позиции притягивателя (сверху, снизу, сбоку)",
        "Экспериментируйте с разными значениями силы (0.1 до 10.0)",
        "Создайте несколько притягивателей, соединяя несколько UpdateAttractorBlocks",
        "Комбинируйте притягиватели с гравитацией для сложных паттернов движения",
        "Попробуйте создать отталкиватель, используя отрицательные значения силы (если поддерживается)"
      ]
    },
    "lesson9": {
      "title": "Урок 9: Продвинутые Математические Операции",
      "summary": "Научитесь использовать несколько тригонометрических и продвинутых математических функций (Sin, Cos, Sqrt, Abs) вместе",
      "introTitle": "Введение",
      "intro": "В этом уроке вы научитесь использовать несколько математических функций вместе для создания сложных эффектов. Вы будете использовать ParticleTrigonometryBlock с различными операциями (Sin, Cos, Sqrt, Abs) и комбинировать их для создания богатых, анимированных цветовых эффектов. Каждая функция создает различный паттерн - синусоидальные волны осциллируют, косинусоидальные волны сдвинуты по фазе, квадратный корень создает плавные кривые, а абсолютное значение удаляет отрицательные значения.",
      "stepsTitle": "Пошаговые Инструкции",
      "steps": [
        "Начните с базовой системы частиц, используя PointShapeBlock",
        "Получите системное время, используя ParticleInputBlock с системным источником Time",
        "Используйте ParticleTrigonometryBlock с операцией Sin для создания синусоидальной волны",
        "Масштабируйте выход синусоидальной волны, используя ParticleMathBlock (Multiply)",
        "Сместите масштабированную синусоидальную волну, чтобы сдвинуть ее в желаемый диапазон (0 до 1)",
        "Используйте осциллирующее значение для управления цветом частиц (красный компонент)",
        "Создайте Color4, используя ParticleConverterBlock с анимированным значением красного",
        "Подключите анимированный цвет к UpdateColorBlock"
      ],
      "blocksTitle": "Блоки, Используемые в Этом Уроке",
      "blocks": [
        {
          "name": "ParticleTrigonometryBlock",
          "description": "Выполняет тригонометрические и продвинутые математические операции над значениями Float. Поддерживает Sin, Cos, Tan, Sqrt, Log, Abs и многие другие операции.",
          "properties": [
            {
              "name": "name",
              "value": "'Sin Time'",
              "description": "Отображаемое имя блока"
            },
            {
              "name": "operation",
              "value": "ParticleTrigonometryBlockOperations.Sin",
              "description": "Математическая операция - Sin для синусоидальной волны"
            },
            {
              "name": "input",
              "value": "Float input",
              "description": "Входное значение (например, время для синусоидальной волны)"
            }
          ]
        },
        {
          "name": "ParticleInputBlock (Time)",
          "description": "Получает системное время. Время увеличивается непрерывно, что делает его идеальным для создания анимированных эффектов, которые изменяются со временем.",
          "properties": [
            {
              "name": "systemSource",
              "value": "NodeParticleSystemSources.Time",
              "description": "Системный источник - Time для системного времени"
            }
          ]
        },
        {
          "name": "ParticleMathBlock (Multiply)",
          "description": "Умножает два значения. Используется для масштабирования выхода синусоидальной волны для управления амплитудой колебаний.",
          "properties": [
            {
              "name": "operation",
              "value": "ParticleMathBlockOperations.Multiply",
              "description": "Математическая операция - Multiply"
            }
          ]
        },
        {
          "name": "ParticleMathBlock (Add)",
          "description": "Складывает два значения. Используется для смещения масштабированной синусоидальной волны, сдвигая ее в желаемый диапазон (например, 0 до 1).",
          "properties": [
            {
              "name": "operation",
              "value": "ParticleMathBlockOperations.Add",
              "description": "Математическая операция - Add"
            }
          ]
        }
      ],
      "properties": "Свойства",
      "codeTitle": "Объяснение Кода",
      "codeCopy": "Этот урок демонстрирует комбинирование нескольких математических функций. Каждая функция создает различный паттерн: Sin создает осциллирующие волны (красный), Cos создает волны со сдвигом фазы (зеленый), а Sqrt(Abs) создает плавные кривые (синий). Формула нормализации (значение + 1) / 2 отображает функции из [-1, 1] в [0, 1] для цветовых значений. Используя различные функции для различных цветовых компонентов, мы создаем богатые, анимированные эффекты, где каждый цветовой канал следует различному математическому паттерну. Эта техника необходима для создания сложных, органически выглядящих анимаций.",
      "homeworkTitle": "Упражнения для Практики",
      "homework": [
        "Попробуйте разные тригонометрические функции (Cos, Tan) и наблюдайте различия",
        "Используйте синусоидальные волны для анимации размера частиц вместо цвета",
        "Создайте несколько синусоидальных волн с разными частотами и комбинируйте их",
        "Экспериментируйте с Sqrt, Log и другими продвинутыми математическими операциями",
        "Комбинируйте тригонометрические функции с эффектами на основе возраста для сложных анимаций"
      ]
    },
    "lesson10": {
      "title": "Урок 10: Анимация Текстур и Спрайт-Листы",
      "summary": "Научитесь создавать анимированные текстуры частиц, используя спрайт-листы и обновление индекса ячеек",
      "introTitle": "Введение",
      "intro": "В этом уроке вы научитесь использовать SetupSpriteSheetBlock и UpdateSpriteCellIndexBlock для создания анимированных текстур частиц. Спрайт-листы позволяют отображать разные кадры анимации на частицах, создавая эффекты, такие как анимированное пламя, взрывы или другие динамические визуальные эффекты. Вы научитесь вычислять индексы ячеек спрайтов на основе возраста частицы для создания плавных анимаций.",
      "stepsTitle": "Пошаговые Инструкции",
      "steps": [
        "Начните с базовой системы частиц, используя PointShapeBlock",
        "Добавьте SetupSpriteSheetBlock для настройки спрайт-листа (начальная ячейка, конечная ячейка, ширина, высота)",
        "Установите свойства спрайт-листа (start: 0, end: 8, width: 64, height: 64)",
        "Включите зацикливание, если хотите, чтобы анимация повторялась",
        "Добавьте UpdateSpriteCellIndexBlock для обновления индекса ячейки спрайта",
        "Вычислите индекс спрайта из возраста частицы: Age / Lifetime",
        "Умножьте на количество ячеек (end - start + 1)",
        "Преобразуйте результат в целое число, используя ParticleFloatToIntBlock",
        "Подключите целочисленный индекс ячейки к входу cellIndex блока UpdateSpriteCellIndexBlock"
      ],
      "blocksTitle": "Блоки, Используемые в Этом Уроке",
      "blocks": [
        {
          "name": "SetupSpriteSheetBlock",
          "description": "Настраивает спрайт-лист для частиц. Определяет начальный и конечный индексы ячеек, размеры ячеек и поведение анимации.",
          "properties": [
            {
              "name": "start",
              "value": "0",
              "description": "Начальный индекс ячейки спрайт-листа"
            },
            {
              "name": "end",
              "value": "8",
              "description": "Конечный индекс ячейки спрайт-листа"
            },
            {
              "name": "width",
              "value": "64",
              "description": "Ширина каждой ячейки спрайта в пикселях"
            },
            {
              "name": "height",
              "value": "64",
              "description": "Высота каждой ячейки спрайта в пикселях"
            },
            {
              "name": "loop",
              "value": "true",
              "description": "Должна ли анимация спрайт-листа зацикливаться"
            },
            {
              "name": "randomStartCell",
              "value": "false",
              "description": "Должны ли частицы начинаться со случайной ячейки"
            }
          ]
        },
        {
          "name": "UpdateSpriteCellIndexBlock",
          "description": "Обновляет индекс ячейки спрайта частицы. Индекс ячейки определяет, какой кадр спрайт-листа отображается.",
          "properties": [
            {
              "name": "cellIndex",
              "value": "Int input",
              "description": "Индекс ячейки для отображения (начиная с 0, от start до end)"
            }
          ]
        },
        {
          "name": "ParticleFloatToIntBlock",
          "description": "Преобразует значение Float в целое число. Необходимо для индексов ячеек спрайтов, которые должны быть целыми числами.",
          "properties": [
            {
              "name": "input",
              "value": "Float input",
              "description": "Значение Float для преобразования"
            },
            {
              "name": "output",
              "value": "Int output",
              "description": "Целочисленный результат"
            }
          ]
        }
      ],
      "properties": "Свойства",
      "codeTitle": "Объяснение Кода",
      "codeCopy": "Этот урок демонстрирует анимацию спрайт-листа. Спрайт-лист - это текстура, содержащая несколько кадров анимации, расположенных в сетке. Обновляя индекс ячейки на основе возраста частицы, мы создаем плавные анимации. Формула: cellIndex = floor((Age / Lifetime) * cellCount), где cellCount = end - start + 1. Это отображает время жизни частицы (0 до 1) на ячейки спрайт-листа (0 до cellCount-1). Спрайт-листы необходимы для создания анимированных эффектов, таких как пламя, дым, взрывы и другие динамические визуальные элементы.",
      "homeworkTitle": "Упражнения для Практики",
      "homework": [
        "Попробуйте разные конфигурации спрайт-листов (разное количество ячеек, размеры)",
        "Экспериментируйте с randomStartCell для создания разнообразных анимаций",
        "Создайте анимации спрайтов, которые ускоряются или замедляются на основе свойств частиц",
        "Комбинируйте анимацию спрайтов с изменениями цвета для более динамичных эффектов",
        "Попробуйте создать спрайт-лист со своей собственной текстурой и протестируйте разные расположения ячеек"
      ]
    },
    "lesson11": {
      "title": "Урок 11: Условная Логика",
      "summary": "Научитесь использовать ParticleConditionBlock для создания условных эффектов на основе свойств частиц",
      "introTitle": "Введение",
      "intro": "В этом уроке вы научитесь использовать ParticleConditionBlock для создания условной логики в ваших системах частиц. Условные блоки позволяют принимать решения на основе свойств частиц - например, изменять цвет, когда частица достигает определенного возраста, или применять различные эффекты на основе скорости. Вы научитесь использовать операции сравнения (GreaterThan, LessThan, Equal и т.д.) и комбинировать условия с другими блоками.",
      "stepsTitle": "Пошаговые Инструкции",
      "steps": [
        "Начните с базовой системы частиц, используя PointShapeBlock",
        "Получите возраст и время жизни частицы, используя ParticleInputBlock",
        "Вычислите соотношение возраста (Возраст / Время жизни) для получения значения от 0 до 1",
        "Создайте пороговое значение (0.5), используя ParticleInputBlock",
        "Создайте ParticleConditionBlock с тестом GreaterThan",
        "Подключите соотношениеВозраста к левому входу и порог к правому входу",
        "Создайте два цвета: Цвет1 (красный) и Цвет2 (синий)",
        "Подключите Цвет1 к условие.ifTrue и Цвет2 к условие.ifFalse",
        "Используйте выход условия для управления цветом и размером частиц",
        "Наблюдайте, как частицы изменяют цвет и размер, когда они проходят порог"
      ],
      "blocksTitle": "Блоки, Используемые в Этом Уроке",
      "blocks": [
        {
          "name": "ParticleConditionBlock",
          "description": "Оценивает условие и возвращает одно значение, если истинно, другое, если ложно. Поддерживает различные операции сравнения, такие как Equal, NotEqual, LessThan, GreaterThan и т.д.",
          "properties": [
            {
              "name": "test",
              "value": "ParticleConditionBlockTests.GreaterThan",
              "description": "Операция сравнения для выполнения"
            },
            {
              "name": "left",
              "value": "Float input",
              "description": "Левый операнд (например, соотношениеВозраста)"
            },
            {
              "name": "right",
              "value": "Float input",
              "description": "Правый операнд (например, порог)"
            },
            {
              "name": "ifTrue",
              "value": "AutoDetect input",
              "description": "Значение для возврата, если условие истинно (например, Цвет1)"
            },
            {
              "name": "ifFalse",
              "value": "AutoDetect input",
              "description": "Значение для возврата, если условие ложно (например, Цвет2)"
            }
          ]
        },
        {
          "name": "ParticleInputBlock (Age/Lifetime)",
          "description": "Получает возраст и время жизни частицы для условной логики. Соотношение возраста (Возраст / Время жизни) дает нормализованное значение от 0 до 1.",
          "properties": [
            {
              "name": "contextualValue",
              "value": "NodeParticleContextualSources.Age / Lifetime",
              "description": "Контекстный источник - Возраст или Время жизни"
            }
          ]
        }
      ],
      "properties": "Свойства",
      "codeTitle": "Объяснение Кода",
      "codeCopy": "Этот урок демонстрирует условную логику с использованием ParticleConditionBlock. Блок условия оценивает сравнение (например, соотношениеВозраста > 0.5) и возвращает одно значение, если истинно, другое, если ложно. Это позволяет создавать эффекты, которые изменяются на основе состояния частицы. Например, частицы могут изменять цвет, когда они достигают половины своего времени жизни, или применять различные эффекты на основе скорости, позиции или других свойств. Условная логика необходима для создания сложного, основанного на состоянии поведения частиц.",
      "homeworkTitle": "Упражнения для Практики",
      "homework": [
        "Попробуйте различные операции сравнения (LessThan, Equal, NotEqual)",
        "Создайте несколько условий и объедините их, используя операции And/Or",
        "Используйте условия для запуска различных эффектов на разных возрастах частиц",
        "Объедините условную логику с другими эффектами, такими как изменения размера или масштаба",
        "Экспериментируйте с различными пороговыми значениями, чтобы увидеть, как они влияют на поведение частиц"
      ]
    },
    "lesson12": {
      "title": "Урок 12: Угол и Вращение",
      "summary": "Научитесь управлять вращением частиц, используя UpdateAngleBlock и AlignAngleBlock",
      "introTitle": "Введение",
      "intro": "В этом уроке вы научитесь управлять вращением и углом частиц. Вы будете использовать UpdateAngleBlock для установки вращения частиц на основе расчетов (например, вращение на основе времени) и узнаете об AlignAngleBlock, который автоматически выравнивает частицы по их направлению. Вращение необходимо для создания эффектов, таких как вращающиеся частицы, направленные спрайты и анимированные текстуры.",
      "stepsTitle": "Пошаговые Инструкции",
      "steps": [
        "Начните с базовой системы частиц, используя PointShapeBlock",
        "Получите системное время, используя ParticleInputBlock с системным источником Time",
        "Создайте значение скорости вращения (оборотов в секунду)",
        "Вычислите угол вращения: время * скоростьВращения",
        "Добавьте UpdateAngleBlock для обновления угла частиц",
        "Подключите угол вращения к входу angle блока UpdateAngleBlock",
        "Опционально используйте AlignAngleBlock для выравнивания частиц по их направлению",
        "Наблюдайте, как частицы вращаются непрерывно на основе времени"
      ],
      "blocksTitle": "Блоки, Используемые в Этом Уроке",
      "blocks": [
        {
          "name": "UpdateAngleBlock",
          "description": "Обновляет угол вращения частиц. Угол указывается в радианах и определяет, как частицы вращаются.",
          "properties": [
            {
              "name": "name",
              "value": "'Update Angle'",
              "description": "Отображаемое имя блока"
            },
            {
              "name": "angle",
              "value": "Float input",
              "description": "Угол вращения в радианах"
            }
          ]
        },
        {
          "name": "AlignAngleBlock",
          "description": "Автоматически выравнивает угол частицы по ее вектору направления. Полезно для создания частиц, которые обращены в направлении движения.",
          "properties": [
            {
              "name": "name",
              "value": "'Align Angle'",
              "description": "Отображаемое имя блока"
            },
            {
              "name": "alignment",
              "value": "Float (по умолчанию: Math.PI / 2)",
              "description": "Смещение выравнивания в радианах"
            }
          ]
        },
        {
          "name": "ParticleInputBlock (Time)",
          "description": "Получает системное время для расчетов вращения на основе времени.",
          "properties": [
            {
              "name": "systemSource",
              "value": "NodeParticleSystemSources.Time",
              "description": "Системный источник - Time для системного времени"
            }
          ]
        }
      ],
      "properties": "Свойства",
      "codeTitle": "Объяснение Кода",
      "codeCopy": "Этот урок демонстрирует управление вращением частиц. UpdateAngleBlock позволяет устанавливать вращение частиц на основе расчетов - в данном случае, вращение на основе времени, где угол = время * скоростьВращения. Это создает непрерывное вращение. AlignAngleBlock автоматически вычисляет угол, необходимый для выравнивания частиц с их вектором направления, что полезно для направленных спрайтов. Вращение указывается в радианах (2π = 360 градусов) и может комбинироваться с другими эффектами, такими как изменения цвета или вариации размера.",
      "homeworkTitle": "Упражнения для Практики",
      "homework": [
        "Попробуйте различные скорости вращения и наблюдайте эффект",
        "Объедините вращение с эффектами на основе возраста (вращайтесь быстрее по мере старения частиц)",
        "Используйте AlignAngleBlock, чтобы частицы были обращены в направлении движения",
        "Объедините вращение с изменениями цвета для более динамичных эффектов",
        "Экспериментируйте с вращением на основе свойств частиц (скорость, возраст и т.д.)"
      ]
    }
  }
}
