{
  "title": "Урок 7: Шум и Случайность",
  "summary": "Научитесь добавлять случайность к свойствам частиц, используя ParticleRandomBlock",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь добавлять случайность и вариативность в ваши системы частиц, используя ParticleRandomBlock. Случайность необходима для создания органичных, естественно выглядящих эффектов. Вы научитесь рандомизировать цвета, размеры и другие свойства, а также поймете различные режимы блокировки, которые контролируют, когда генерируются случайные значения.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Начните с базовой системы частиц, используя PointShapeBlock",
    "Добавьте UpdateColorBlock для изменения цвета частиц",
    "Создайте два цветовых входа: minColor (синий) и maxColor (оранжевый)",
    "Используйте ParticleRandomBlock для генерации случайного цвета между min и max",
    "Установите lockMode в OncePerParticle, чтобы каждая частица получала фиксированный случайный цвет на всю свою жизнь",
    "Подключите случайный цвет к UpdateColorBlock",
    "Добавьте UpdateSizeBlock для изменения размера частиц",
    "Создайте входы minSize и maxSize",
    "Используйте еще один ParticleRandomBlock для рандомизации размера с режимом блокировки OncePerParticle",
    "Подключите случайный размер к UpdateSizeBlock"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "ParticleRandomBlock",
      "description": "Генерирует случайные значения между минимумом и максимумом. Поддерживает типы Float, Vector2, Vector3 и Color4. Необходим для добавления вариативности в системы частиц.",
      "properties": [
        {
          "name": "name",
          "value": "'Random Color' или 'Random Size'",
          "description": "Отображаемое имя блока"
        },
        {
          "name": "min",
          "value": "Input (того же типа, что и max)",
          "description": "Минимальное значение для генерации случайных чисел"
        },
        {
          "name": "max",
          "value": "Input (того же типа, что и min)",
          "description": "Максимальное значение для генерации случайных чисел"
        },
        {
          "name": "lockMode",
          "value": "ParticleRandomBlockLocks enum",
          "description": "Контролирует, когда генерируется случайное значение: None (каждый кадр), PerParticle (один раз на частицу за кадр), PerSystem (один раз на систему), OncePerParticle (один раз при создании частицы)"
        }
      ]
    },
    {
      "name": "ParticleInputBlock (Color4)",
      "description": "Предоставляет значение Color4. Используется для определения минимального и максимального цветов для генерации случайного цвета.",
      "properties": [
        {
          "name": "value",
          "value": "Color4",
          "description": "Значение цвета (например, new Color4(0.2, 0.5, 1.0, 1.0) для синего)"
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Этот урок демонстрирует использование ParticleRandomBlock для добавления случайности к свойствам частиц. Ключевая концепция - это свойство lockMode, которое определяет, когда генерируются случайные значения. OncePerParticle гарантирует, что каждая частица получает случайное значение при создании, и это значение остается постоянным в течение всей жизни частицы. Это идеально подходит для свойств, таких как цвет и размер, где вы хотите вариативность между частицами, но постоянство для каждой отдельной частицы. Формула для генерации случайных чисел: randomValue = min + Math.random() * (max - min).",
  "homeworkTitle": "Упражнения для Практики",
  "homework": [
    "Попробуйте разные значения lockMode (PerParticle, PerSystem) и наблюдайте различия",
    "Рандомизируйте направление частиц, используя случайные значения Vector3",
    "Создайте систему частиц со случайными цветами по всему спектру",
    "Комбинируйте случайный размер с изменениями размера на основе возраста",
    "Экспериментируйте со случайными значениями Vector2 для масштаба частиц"
  ]
}