{
  "title": "Урок 2: Свойства Частиц",
  "summary": "Научитесь комбинировать и управлять несколькими свойствами частиц (цвет, размер, масштаб) вместе",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь комбинировать несколько свойств частиц (цвет, размер и масштаб) для создания сложных эффектов. Мы будем использовать UpdateColorBlock, UpdateSizeBlock и UpdateScaleBlock вместе, показывая, как комбинировать их с математическими операциями. Вы увидите, как свойства могут взаимодействовать друг с другом и как создавать эффекты неравномерного масштабирования.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Начните с базовой системы частиц из Урока 1",
    "Получите возраст и время жизни частицы, используя ParticleInputBlock",
    "Вычислите соотношение возраста (Возраст / Время жизни) для получения значения от 0 до 1",
    "Создайте сложный градиент цвета, используя ParticleConverterBlock с несколькими компонентами",
    "Объедините соотношение возраста с инвертированным соотношением для создания переходов цвета (красный увеличивается, зеленый/синий затухают)",
    "Добавьте UpdateSizeBlock с расчетом роста: размер растет от базового до базового * (1 + рост * соотношениеВозраста)",
    "Добавьте UpdateScaleBlock с неравномерным масштабированием: X уменьшается, а Y увеличивается",
    "Соедините все блоки обновления вместе: UpdatePosition → UpdateColor → UpdateSize → UpdateScale",
    "Наблюдайте, как все свойства работают вместе для создания целостного эффекта"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "UpdateColorBlock",
      "description": "Обновляет цвет частиц каждый кадр. Вы можете подключить значение цвета для создания затухания, переходов цвета или других цветовых эффектов.",
      "properties": [
        {
          "name": "name",
          "value": "'Update color'",
          "description": "Отображаемое имя блока"
        },
        {
          "name": "color",
          "value": "Color4 input",
          "description": "Цвет для применения к частице. Может быть подключен из ParticleInputBlock (InitialColor, Color) или блока ввода Color4."
        }
      ]
    },
    {
      "name": "UpdateSizeBlock",
      "description": "Обновляет размер частиц. Полезно для создания частиц, которые растут или уменьшаются со временем.",
      "properties": [
        {
          "name": "name",
          "value": "'Update size'",
          "description": "Отображаемое имя блока"
        },
        {
          "name": "size",
          "value": "Float input",
          "description": "Значение размера для применения. Может быть константой или вычислено с помощью математических операций."
        }
      ]
    },
    {
      "name": "UpdateScaleBlock",
      "description": "Обновляет масштаб частиц. Масштаб влияет на визуальный размер частицы независимо от свойства size.",
      "properties": [
        {
          "name": "name",
          "value": "'Update scale'",
          "description": "Отображаемое имя блока"
        },
        {
          "name": "scale",
          "value": "Float or Vector2 input",
          "description": "Значение масштаба. Может быть одним float или Vector2 для разного масштабирования X/Y."
        }
      ]
    },
    {
      "name": "ParticleInputBlock (Age)",
      "description": "Получает текущий возраст частицы. Возраст начинается с 0, когда частица создана, и увеличивается до достижения значения lifetime.",
      "properties": [
        {
          "name": "contextualValue",
          "value": "NodeParticleContextualSources.Age",
          "description": "Тип контекстных данных - Age в данном случае"
        }
      ]
    },
    {
      "name": "ParticleInputBlock (Lifetime)",
      "description": "Получает общее время жизни частицы. Это максимальный возраст, которого может достичь частица перед смертью.",
      "properties": [
        {
          "name": "contextualValue",
          "value": "NodeParticleContextualSources.Lifetime",
          "description": "Тип контекстных данных - Lifetime в данном случае"
        }
      ]
    },
    {
      "name": "ParticleInputBlock (InitialColor)",
      "description": "Получает начальный цвет частицы при её создании. Полезно для создания переходов цвета.",
      "properties": [
        {
          "name": "contextualValue",
          "value": "NodeParticleContextualSources.InitialColor",
          "description": "Тип контекстных данных - InitialColor в данном случае"
        }
      ]
    },
    {
      "name": "ParticleMathBlock (Divide)",
      "description": "Делит два значения. В этом уроке мы используем его для расчета соотношения возраста (Age / Lifetime), что дает нам значение от 0 до 1, представляющее, насколько далеко в своей жизни находится частица.",
      "properties": [
        {
          "name": "operation",
          "value": "ParticleMathBlockOperations.Divide",
          "description": "Математическая операция - Divide"
        }
      ]
    },
    {
      "name": "ParticleMathBlock (Multiply)",
      "description": "Умножает два значения. Используется для расчета конечного размера путем умножения базового размера на множитель.",
      "properties": [
        {
          "name": "operation",
          "value": "ParticleMathBlockOperations.Multiply",
          "description": "Математическая операция - Multiply"
        }
      ]
    },
    {
      "name": "ParticleMathBlock (Add)",
      "description": "Складывает два значения. Используется для создания множителя размера, который увеличивается от 1.0 до 2.0 на основе возраста.",
      "properties": [
        {
          "name": "operation",
          "value": "ParticleMathBlockOperations.Add",
          "description": "Математическая операция - Add"
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Этот урок демонстрирует, как комбинировать несколько свойств частиц вместе. Ключевая концепция заключается в том, что свойства могут вычисляться с использованием того же соотношения возраста, но с разными формулами. Для цвета мы используем соотношениеВозраста напрямую для красного и (1 - соотношениеВозраста) для зеленого/синего. Для размера мы вычисляем: базовыйРазмер * (1 + множительРоста * соотношениеВозраста), создавая рост. Для масштаба мы используем разные формулы для X и Y: масштабX = базовыйX * (1 - соотношениеВозраста), масштабY = базовыйY * (1 + соотношениеВозраста). Это создает неравномерное масштабирование, где частицы становятся шире, но короче со временем. Комбинируя все эти свойства, мы создаем богатые, динамические эффекты.",
  "homeworkTitle": "Упражнения для Практики",
  "homework": [
    "Попробуйте сделать так, чтобы частицы уменьшались, а не росли со временем",
    "Создайте переход цвета от красного к синему, используя математические операции",
    "Экспериментируйте с разными множителями размера",
    "Добавьте вращение, используя UpdateAngleBlock",
    "Попробуйте использовать UpdateAgeBlock для ручного управления временем жизни частиц"
  ]
}