{
  "title": "Урок 9: Продвинутые Математические Операции",
  "summary": "Научитесь использовать несколько тригонометрических и продвинутых математических функций (Sin, Cos, Sqrt, Abs) вместе",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь использовать несколько математических функций вместе для создания сложных эффектов. Вы будете использовать ParticleTrigonometryBlock с различными операциями (Sin, Cos, Sqrt, Abs) и комбинировать их для создания богатых, анимированных цветовых эффектов. Каждая функция создает различный паттерн - синусоидальные волны осциллируют, косинусоидальные волны сдвинуты по фазе, квадратный корень создает плавные кривые, а абсолютное значение удаляет отрицательные значения.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Начните с базовой системы частиц, используя PointShapeBlock",
    "Получите системное время, используя ParticleInputBlock с системным источником Time",
    "Используйте ParticleTrigonometryBlock с операцией Sin для создания синусоидальной волны",
    "Масштабируйте выход синусоидальной волны, используя ParticleMathBlock (Multiply)",
    "Сместите масштабированную синусоидальную волну, чтобы сдвинуть ее в желаемый диапазон (0 до 1)",
    "Используйте осциллирующее значение для управления цветом частиц (красный компонент)",
    "Создайте Color4, используя ParticleConverterBlock с анимированным значением красного",
    "Подключите анимированный цвет к UpdateColorBlock"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "ParticleTrigonometryBlock",
      "description": "Выполняет тригонометрические и продвинутые математические операции над значениями Float. Поддерживает Sin, Cos, Tan, Sqrt, Log, Abs и многие другие операции.",
      "properties": [
        {
          "name": "name",
          "value": "'Sin Time'",
          "description": "Отображаемое имя блока"
        },
        {
          "name": "operation",
          "value": "ParticleTrigonometryBlockOperations.Sin",
          "description": "Математическая операция - Sin для синусоидальной волны"
        },
        {
          "name": "input",
          "value": "Float input",
          "description": "Входное значение (например, время для синусоидальной волны)"
        }
      ]
    },
    {
      "name": "ParticleInputBlock (Time)",
      "description": "Получает системное время. Время увеличивается непрерывно, что делает его идеальным для создания анимированных эффектов, которые изменяются со временем.",
      "properties": [
        {
          "name": "systemSource",
          "value": "NodeParticleSystemSources.Time",
          "description": "Системный источник - Time для системного времени"
        }
      ]
    },
    {
      "name": "ParticleMathBlock (Multiply)",
      "description": "Умножает два значения. Используется для масштабирования выхода синусоидальной волны для управления амплитудой колебаний.",
      "properties": [
        {
          "name": "operation",
          "value": "ParticleMathBlockOperations.Multiply",
          "description": "Математическая операция - Multiply"
        }
      ]
    },
    {
      "name": "ParticleMathBlock (Add)",
      "description": "Складывает два значения. Используется для смещения масштабированной синусоидальной волны, сдвигая ее в желаемый диапазон (например, 0 до 1).",
      "properties": [
        {
          "name": "operation",
          "value": "ParticleMathBlockOperations.Add",
          "description": "Математическая операция - Add"
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Этот урок демонстрирует комбинирование нескольких математических функций. Каждая функция создает различный паттерн: Sin создает осциллирующие волны (красный), Cos создает волны со сдвигом фазы (зеленый), а Sqrt(Abs) создает плавные кривые (синий). Формула нормализации (значение + 1) / 2 отображает функции из [-1, 1] в [0, 1] для цветовых значений. Используя различные функции для различных цветовых компонентов, мы создаем богатые, анимированные эффекты, где каждый цветовой канал следует различному математическому паттерну. Эта техника необходима для создания сложных, органически выглядящих анимаций.",
  "homeworkTitle": "Упражнения для Практики",
  "homework": [
    "Попробуйте разные тригонометрические функции (Cos, Tan) и наблюдайте различия",
    "Используйте синусоидальные волны для анимации размера частиц вместо цвета",
    "Создайте несколько синусоидальных волн с разными частотами и комбинируйте их",
    "Экспериментируйте с Sqrt, Log и другими продвинутыми математическими операциями",
    "Комбинируйте тригонометрические функции с эффектами на основе возраста для сложных анимаций"
  ]
}