{
  "title": "1.3: Временные Свойства",
  "summary": "Научитесь использовать Возраст и Время жизни для создания временных эффектов частиц",
  "introTitle": "Введение",
  "intro": "В этом уроке вы узнаете о Возрасте и Времени жизни - двух фундаментальных концепциях для создания временных эффектов. Возраст представляет, как долго частица была жива, а Время жизни - это ее общая продолжительность жизни. Вычисляя соотношение возраста (Возраст / Время жизни), мы можем создавать эффекты, которые изменяются со временем, например, частицы, которые растут или затухают по мере старения.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте SystemBlock - это корень вашей системы частиц",
    "Создайте CreateParticleBlock для эмиссии частиц",
    "Установите начальный цвет и размер используя ParticleInputBlock",
    "Добавьте PointShapeBlock для эмиссии частиц из одной точки",
    "Добавьте UpdatePositionBlock для обработки движения частиц",
    "Получите Position и ScaledDirection, сложите их и подключите к UpdatePositionBlock",
    "Получите Возраст частицы, используя ParticleInputBlock с контекстным значением Age",
    "Получите Время жизни частицы, используя ParticleInputBlock с контекстным значением Lifetime",
    "Вычислите соотношение возраста: Возраст / Время жизни, используя ParticleMathBlock с операцией Divide",
    "Добавьте UpdateColorBlock и подключите контекстное значение InitialColor к нему",
    "Добавьте UpdateSizeBlock для изменения размера частиц со временем",
    "Вычислите фактор роста: 1 + ageRatio используя ParticleMathBlock (операция Add)",
    "Примените фактор роста к расчету размера: baseSize * (1 + ageRatio)",
    "Подключите итоговый размер к входу size блока UpdateSizeBlock",
    "Соедините блоки: CreateParticle → PointShape → UpdatePosition → UpdateColor → UpdateSize → SystemBlock",
    "Добавьте ParticleTextureSourceBlock для предоставления текстуры",
    "Наблюдайте, как частицы теперь растут со временем в зависимости от их возраста"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "ParticleInputBlock (Age)",
      "description": "Получает текущий возраст частицы. Возраст начинается с 0 при создании частицы и увеличивается каждый кадр, пока не достигнет значения времени жизни. Возраст измеряется в секундах.",
      "properties": [
        {
          "name": "contextualValue",
          "value": "NodeParticleContextualSources.Age",
          "description": "Тип контекстных данных - Age в данном случае"
        }
      ]
    },
    {
      "name": "ParticleInputBlock (Lifetime)",
      "description": "Получает общее время жизни частицы. Время жизни - это постоянное значение, установленное при создании частицы. Оно представляет максимальный возраст, которого может достичь частица перед смертью. Время жизни измеряется в секундах.",
      "properties": [
        {
          "name": "contextualValue",
          "value": "NodeParticleContextualSources.Lifetime",
          "description": "Тип контекстных данных - Lifetime в данном случае"
        }
      ]
    },
    {
      "name": "ParticleMathBlock (Divide)",
      "description": "Делит два значения. В этом уроке мы используем его для вычисления соотношения возраста (Возраст / Время жизни), что дает нам значение от 0 (только что создана) до 1 (вот-вот умрет). Это соотношение является основой для всех временных эффектов.",
      "properties": [
        {
          "name": "operation",
          "value": "ParticleMathBlockOperations.Divide",
          "description": "Математическая операция - Divide"
        }
      ]
    },
    {
      "name": "ParticleMathBlock (Multiply)",
      "description": "Умножает два значения. Используется для вычисления итогового размера путем умножения базового размера на фактор роста.",
      "properties": [
        {
          "name": "operation",
          "value": "ParticleMathBlockOperations.Multiply",
          "description": "Математическая операция - Multiply"
        }
      ]
    },
    {
      "name": "ParticleMathBlock (Add)",
      "description": "Складывает два значения. Используется для создания фактора роста: 1 + ageRatio, который увеличивается от 1.0 до 2.0 по мере старения частицы.",
      "properties": [
        {
          "name": "operation",
          "value": "ParticleMathBlockOperations.Add",
          "description": "Математическая операция - Add"
        }
      ]
    },
    {
      "name": "ParticleMathBlock (Subtract)",
      "description": "Вычитает два значения. Используется для вычисления фактора затухания: 1 - ageRatio, который уменьшается от 1.0 до 0.0 по мере старения частицы.",
      "properties": [
        {
          "name": "operation",
          "value": "ParticleMathBlockOperations.Subtract",
          "description": "Математическая операция - Subtract"
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Этот урок знакомит с временными расчетами с использованием Возраста и Времени жизни. Соотношение возраста (Возраст / Время жизни) - это значение от 0 до 1, которое представляет, насколько далеко прошла жизнь частицы. Когда ageRatio = 0, частица только что создана. Когда ageRatio = 1, частица вот-вот умрет. Мы используем это соотношение для создания эффектов, которые изменяются со временем. Например, size = baseSize * (1 + ageRatio) заставляет частицы расти от baseSize до 2 * baseSize по мере старения. Инвертированное соотношение (1 - ageRatio) полезно для эффектов затухания.",
  "objectivesTitle": "Цели Обучения",
  "objectives": [
    "Понять контекстные значения Age и Lifetime",
    "Вычислять соотношение возраста (Age / Lifetime) для временных эффектов",
    "Использовать соотношение возраста для создания частиц, которые изменяются со временем",
    "Применять математические операции к соотношению возраста для разных эффектов",
    "Понять разницу между формулами роста (1 + ageRatio) и затухания (1 - ageRatio)"
  ],
  "commonMistakesTitle": "Частые Ошибки",
  "commonMistakes": [
    {
      "mistake": "Деление Lifetime на Age вместо Age на Lifetime",
      "explanation": "Соотношение возраста должно быть Age / Lifetime, а не Lifetime / Age. Правильная формула дает значение от 0 до 1.",
      "solution": "Всегда делите Age на Lifetime: ageRatio = Age / Lifetime. Это дает 0, когда частица создана, 1, когда она умирает."
    },
    {
      "mistake": "Использование Age напрямую без вычисления соотношения",
      "explanation": "Age измеряется в секундах и может быть любым значением. Без деления на Lifetime нельзя создать нормализованные эффекты.",
      "solution": "Всегда вычисляйте соотношение сначала: ageRatio = Age / Lifetime. Затем используйте это нормализованное значение (0 до 1) для расчетов."
    },
    {
      "mistake": "Забывание, что ageRatio увеличивается от 0 до 1",
      "explanation": "ageRatio начинается с 0 (только что создана) и увеличивается до 1 (вот-вот умрет). Использование его напрямую заставляет вещи расти, использование (1 - ageRatio) заставляет их затухать.",
      "solution": "Для эффектов роста используйте ageRatio или (1 + ageRatio). Для эффектов затухания используйте (1 - ageRatio). Помните: ageRatio идет от 0 до 1."
    }
  ],
  "homeworkTitle": "Практические Упражнения",
  "homework": [
    "Попробуйте разные формулы роста размера (например, baseSize * ageRatio, baseSize * (2 - ageRatio))",
    "Экспериментируйте с эффектами затухания, используя (1 - ageRatio)",
    "Создайте частицы, которые уменьшаются со временем вместо роста",
    "Попробуйте комбинировать эффекты роста и затухания вместе",
    "Экспериментируйте с разными математическими операциями, чтобы увидеть, как они влияют на поведение частиц"
  ]
}

