{
  "title": "1.3: Временные Свойства",
  "summary": "Научитесь использовать Возраст и Время жизни для создания временных эффектов частиц",
  "introTitle": "Введение",
  "intro": "В этом уроке вы узнаете о Возрасте и Времени жизни - двух фундаментальных концепциях для создания временных эффектов. Возраст представляет, как долго частица была жива, а Время жизни - это ее общая продолжительность жизни. Вычисляя соотношение возраста (Возраст / Время жизни), мы можем создавать эффекты, которые изменяются со временем, например, частицы, которые растут или затухают по мере старения.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте <filter-value>System</filter-value> блок - это корень вашей системы частиц",
    "Добавьте <filter-value>Texture</filter-value> блок для предоставления текстуры частицам и подключите к System блоку",
    "Загрузите <textures>flare.png</textures> с помощью кнопки загрузки в свойствах Texture блока",
    "Добавьте <filter-value>CreateParticle</filter-value> блок для эмиссии частиц и подключите к System блоку",
    "Добавьте <filter-value>Color4</filter-value> блок и установите его значение на оранжевый (R: 1, G: 0.5, B: 0, A: 1)",
    "Подключите выход Color4 блока к входу color блока CreateParticle",
    "Добавьте <filter-value>Float</filter-value> блок и установите его значение на 0.3",
    "Подключите выход Float блока к входу size блока CreateParticle",
    "Добавьте <filter-value>BoxShape</filter-value> блок для эмиссии частиц из объема куба и подключите между CreateParticle и System блоками",
    "Добавьте <filter-value>UpdatePosition</filter-value> блок для обработки движения частиц и подключите между BoxShape и System блоками",
    "Добавьте <filter-value>Position</filter-value> блок для получения текущей позиции",
    "Добавьте <filter-value>ScaledDirection</filter-value> блок для получения масштабированного направления",
    "Добавьте математический <filter-value>Add</filter-value> блок и подключите Position и ScaledDirection блоки к левому и правому входам соответственно",
    "Подключите результат из математического блока к входу position блока UpdatePosition",
    "Добавьте <filter-value>Age</filter-value> блок для получения возраста частицы",
    "Добавьте <filter-value>Lifetime</filter-value> блок для получения времени жизни частицы",
    "Добавьте математический <filter-value>Divide</filter-value> блок для вычисления соотношения возраста и подключите Age блок к левому входу и Lifetime блок к правому входу",
    "Добавьте <filter-value>UpdateColor</filter-value> блок после UpdatePosition блока и подключите между UpdatePosition и System блоками",
    "Добавьте <filter-value>InitialColor</filter-value> блок и подключите его выход к входу color блока UpdateColor",
    "Добавьте <filter-value>UpdateSize</filter-value> блок после UpdateColor блока и подключите между UpdateColor и System блоками",
    "Добавьте <filter-value>Float</filter-value> блок со значением 1.0",
    "Добавьте еще один математический <filter-value>Add</filter-value> блок для вычисления фактора роста и подключите Float(1.0) блок к левому входу и соотношение возраста из Divide блока к правому входу",
    "Добавьте еще один <filter-value>Float</filter-value> блок со значением 0.3 для базового размера",
    "Добавьте математический <filter-value>Multiply</filter-value> блок и подключите Float блок базового размера к левому входу и фактор роста из Add блока к правому входу",
    "Подключите результат из Multiply блока к входу size блока UpdateSize",
    "Наблюдайте, как частицы теперь растут со временем в зависимости от их возраста"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "Input Block (Age)",
      "description": "Получает текущий возраст частицы. Возраст начинается с 0 при создании частицы и увеличивается каждый кадр, пока не достигнет значения времени жизни. Возраст измеряется в секундах. В визуальном редакторе вы можете найти этот блок в списке блоков и установить его контекстное значение на Age в панели свойств справа.",
      "properties": [
        {
          "name": "Contextual Value",
          "value": "Age",
          "description": "Тип контекстных данных - Age в данном случае. Установите это в панели свойств справа от редактора."
        }
      ]
    },
    {
      "name": "Input Block (Lifetime)",
      "description": "Получает общее время жизни частицы. Время жизни - это постоянное значение, установленное при создании частицы. Оно представляет максимальный возраст, которого может достичь частица перед смертью. Время жизни измеряется в секундах. В визуальном редакторе вы можете найти этот блок в списке блоков и установить его контекстное значение на Lifetime в панели свойств справа.",
      "properties": [
        {
          "name": "Contextual Value",
          "value": "Lifetime",
          "description": "Тип контекстных данных - Lifetime в данном случае. Установите это в панели свойств справа от редактора."
        }
      ]
    },
    {
      "name": "Math Block (Divide)",
      "description": "Делит два значения. В этом уроке мы используем его для вычисления соотношения возраста (Возраст / Время жизни), что дает нам значение от 0 (только что создана) до 1 (вот-вот умрет). Это соотношение является основой для всех временных эффектов. В визуальном редакторе вы можете найти этот блок в списке блоков и установить его операцию на Divide в панели свойств справа.",
      "properties": [
        {
          "name": "Operation",
          "value": "Divide",
          "description": "Математическая операция - Divide. Установите это в панели свойств справа от редактора."
        }
      ]
    },
    {
      "name": "Math Block (Multiply)",
      "description": "Умножает два значения. Используется для вычисления итогового размера путем умножения базового размера на фактор роста. В визуальном редакторе вы можете найти этот блок в списке блоков и установить его операцию на Multiply в панели свойств справа.",
      "properties": [
        {
          "name": "Operation",
          "value": "Multiply",
          "description": "Математическая операция - Multiply. Установите это в панели свойств справа от редактора."
        }
      ]
    },
    {
      "name": "Math Block (Add)",
      "description": "Складывает два значения. Используется для создания фактора роста: 1 + ageRatio, который увеличивается от 1.0 до 2.0 по мере старения частицы. В визуальном редакторе вы можете найти этот блок в списке блоков и установить его операцию на Add в панели свойств справа.",
      "properties": [
        {
          "name": "Operation",
          "value": "Add",
          "description": "Математическая операция - Add. Установите это в панели свойств справа от редактора."
        }
      ]
    },
    {
      "name": "Math Block (Subtract)",
      "description": "Вычитает два значения. Используется для вычисления фактора затухания: 1 - ageRatio, который уменьшается от 1.0 до 0.0 по мере старения частицы. В визуальном редакторе вы можете найти этот блок в списке блоков и установить его операцию на Subtract в панели свойств справа.",
      "properties": [
        {
          "name": "Operation",
          "value": "Subtract",
          "description": "Математическая операция - Subtract. Установите это в панели свойств справа от редактора."
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Этот урок знакомит с временными расчетами с использованием Возраста и Времени жизни. Соотношение возраста (Возраст / Время жизни) - это значение от 0 до 1, которое представляет, насколько далеко прошла жизнь частицы. Когда ageRatio = 0, частица только что создана. Когда ageRatio = 1, частица вот-вот умрет. Мы используем это соотношение для создания эффектов, которые изменяются со временем. Например, size = baseSize * (1 + ageRatio) заставляет частицы расти от baseSize до 2 * baseSize по мере старения. Инвертированное соотношение (1 - ageRatio) полезно для эффектов затухания.",
  "objectivesTitle": "Цели Обучения",
  "objectives": [
    "Понять контекстные значения Age и Lifetime в Input блоках",
    "Вычислять соотношение возраста (Age / Lifetime) для временных эффектов",
    "Использовать соотношение возраста для создания частиц, которые изменяются со временем",
    "Применять математические операции к соотношению возраста для разных эффектов",
    "Понять разницу между формулами роста (1 + ageRatio) и затухания (1 - ageRatio)"
  ],
  "commonMistakesTitle": "Частые Ошибки",
  "commonMistakes": [
    {
      "mistake": "Деление Lifetime на Age вместо Age на Lifetime",
      "explanation": "Соотношение возраста должно быть Age / Lifetime, а не Lifetime / Age. Правильная формула дает значение от 0 до 1.",
      "solution": "Всегда делите Age на Lifetime: ageRatio = Age / Lifetime. Это дает 0, когда частица создана, 1, когда она умирает."
    },
    {
      "mistake": "Использование Age напрямую без вычисления соотношения",
      "explanation": "Age измеряется в секундах и может быть любым значением. Без деления на Lifetime нельзя создать нормализованные эффекты.",
      "solution": "Всегда вычисляйте соотношение сначала: ageRatio = Age / Lifetime. Затем используйте это нормализованное значение (0 до 1) для расчетов."
    },
    {
      "mistake": "Забывание, что ageRatio увеличивается от 0 до 1",
      "explanation": "ageRatio начинается с 0 (только что создана) и увеличивается до 1 (вот-вот умрет). Использование его напрямую заставляет вещи расти, использование (1 - ageRatio) заставляет их затухать.",
      "solution": "Для эффектов роста используйте ageRatio или (1 + ageRatio). Для эффектов затухания используйте (1 - ageRatio). Помните: ageRatio идет от 0 до 1."
    }
  ],
  "homeworkTitle": "Практические Упражнения",
  "homework": [
    "Попробуйте разные формулы роста размера (например, baseSize * ageRatio, baseSize * (2 - ageRatio))",
    "Экспериментируйте с эффектами затухания, используя (1 - ageRatio)",
    "Создайте частицы, которые уменьшаются со временем вместо роста",
    "Попробуйте комбинировать эффекты роста и затухания вместе",
    "Экспериментируйте с разными математическими операциями, чтобы увидеть, как они влияют на поведение частиц"
  ]
}

