{
  "title": "2.1: Формы Эмиттеров",
  "summary": "Изучите различные формы эмиттеров: конус, сфера, куб и другие",
  "introTitle": "Введение",
  "intro": "В этом уроке вы узнаете о различных формах эмиттеров, доступных в Редакторе Частиц. Каждая форма создает частицы из разного объема, давая вам контроль над тем, где появляются частицы. Мы сосредоточимся на ConeShapeBlock, который создает направленные эффекты, такие как огонь или фонтаны, и поймем его свойства, такие как радиус, угол, радиусДиапазон и высотаДиапазон.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте SystemBlock - это корень вашей системы частиц",
    "Создайте CreateParticleBlock для эмиссии частиц",
    "Установите начальный цвет и размер используя ParticleInputBlock",
    "Используйте ConeShapeBlock для эмиссии частиц в виде конуса",
    "Подключите ParticleInputBlock для установки радиуса конуса (базовая ширина конуса)",
    "Подключите еще один ParticleInputBlock для установки угла конуса (угол раскрытия в радианах)",
    "Подключите ParticleInputBlock для установки radiusRange для случайного изменения радиуса",
    "Подключите ParticleInputBlock для установки heightRange для случайного изменения высоты",
    "Экспериментируйте с разными значениями радиуса и угла, чтобы увидеть, как это влияет на распределение частиц",
    "Примечание: Также доступны другие формы, такие как SphereShapeBlock, CylinderShapeBlock и PointShapeBlock"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "SphereShapeBlock",
      "description": "Эмитирует частицы из сферической формы. Частицы появляются в объеме сферы, с контролем радиуса и распределения.",
      "properties": [
        {
          "name": "name",
          "value": "'Sphere emitter'",
          "description": "Отображаемое имя эмиттера"
        },
        {
          "name": "radius",
          "value": "Float input (по умолчанию: 1.0)",
          "description": "Радиус сферы. Большие значения создают большую область эмиссии."
        },
        {
          "name": "radiusRange",
          "value": "Float input (по умолчанию: 1.0, диапазон: 0-1)",
          "description": "Контролирует, где появляются частицы внутри сферы. 0 = только центр, 1 = где угодно в сфере."
        },
        {
          "name": "directionRandomizer",
          "value": "Float input (по умолчанию: 0, диапазон: 0-1)",
          "description": "Контролирует случайность направления частиц. 0 = равномерное направление, 1 = полностью случайное."
        }
      ]
    },
    {
      "name": "BoxShapeBlock",
      "description": "Эмитирует частицы из формы куба/коробки. Частицы появляются в объеме куба, определенном шириной, высотой и глубиной.",
      "properties": [
        {
          "name": "name",
          "value": "'Box emitter'",
          "description": "Отображаемое имя эмиттера"
        }
      ]
    },
    {
      "name": "ConeShapeBlock",
      "description": "Эмитирует частицы из конической формы. Полезно для создания направленных эффектов, таких как огонь, дым или фонтаны.",
      "properties": [
        {
          "name": "name",
          "value": "'Cone emitter'",
          "description": "Отображаемое имя эмиттера"
        },
        {
          "name": "radius",
          "value": "Float input",
          "description": "Базовый радиус конуса"
        },
        {
          "name": "angle",
          "value": "Float input",
          "description": "Угол конуса в радианах"
        }
      ]
    },
    {
      "name": "CylinderShapeBlock",
      "description": "Эмитирует частицы из цилиндрической формы. Частицы появляются в цилиндрическом объеме.",
      "properties": [
        {
          "name": "name",
          "value": "'Cylinder emitter'",
          "description": "Отображаемое имя эмиттера"
        },
        {
          "name": "radius",
          "value": "Float input",
          "description": "Радиус цилиндра"
        },
        {
          "name": "height",
          "value": "Float input",
          "description": "Высота цилиндра"
        }
      ]
    },
    {
      "name": "PointShapeBlock",
      "description": "Эмитирует частицы из одной точки. Все частицы появляются из одного и того же места, полезно для концентрированных эффектов.",
      "properties": [
        {
          "name": "name",
          "value": "'Point emitter'",
          "description": "Отображаемое имя эмиттера"
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Различные формы эмиттеров дают вам контроль над пространственным распределением частиц. SphereShapeBlock создает частицы в сферическом объеме, в то время как BoxShapeBlock использует прямоугольный объем. Каждая форма имеет определенные свойства, такие как радиус, высота или угол, которые контролируют область эмиссии. Свойство radiusRange в SphereShapeBlock особенно полезно - оно позволяет контролировать, появляются ли частицы только в центре (0) или по всему объему (1).",
  "objectivesTitle": "Цели Обучения",
  "objectives": [
    "Понять различные формы эмиттеров и их свойства",
    "Научиться контролировать распределение появления частиц с помощью radiusRange",
    "Использовать directionRandomizer для контроля направления эмиссии",
    "Понять, когда использовать каждый тип формы (Point, Box, Sphere, Cone, Cylinder)",
    "Настраивать свойства форм, такие как радиус, угол и высота"
  ],
  "commonMistakesTitle": "Частые Ошибки",
  "commonMistakes": [
    {
      "mistake": "Непонимание поведения radiusRange",
      "explanation": "radiusRange контролирует, где появляются частицы внутри формы. 0 означает, что частицы появляются только в центре, 1 означает где угодно в объеме. Использование неправильных значений создает неожиданные распределения.",
      "solution": "Используйте radiusRange = 0 для концентрированной эмиссии (только центр), radiusRange = 1 для полной объемной эмиссии. Для сферических форм это особенно важно для контроля распространения частиц."
    },
    {
      "mistake": "Использование неправильной формы для желаемого эффекта",
      "explanation": "Каждая форма имеет специфические случаи использования. Использование BoxShapeBlock для эффекта фонтана или ConeShapeBlock для равномерного распределения не даст желаемого результата.",
      "solution": "Используйте PointShapeBlock для концентрированных эффектов, SphereShapeBlock для радиальных эффектов, ConeShapeBlock для направленных эффектов (огонь, фонтаны), BoxShapeBlock для прямоугольных областей, CylinderShapeBlock для цилиндрических объемов."
    },
    {
      "mistake": "Неправильная настройка свойств формы",
      "explanation": "Формы имеют свойства, такие как радиус, угол, высота, которые должны быть установлены правильно. Использование значений по умолчанию или неправильных типов вызывает неправильную эмиссию.",
      "solution": "Всегда явно устанавливайте свойства формы. Для ConeShapeBlock установите и радиус, и угол. Для SphereShapeBlock установите радиус и radiusRange. Проверьте требуемые свойства формы в документации."
    }
  ],
  "homeworkTitle": "Упражнения для Практики",
  "homework": [
    "Попробуйте изменить радиус сферы, чтобы увидеть, как это влияет на распределение частиц",
    "Экспериментируйте со значениями radiusRange от 0 до 1",
    "Замените SphereShapeBlock на ConeShapeBlock и настройте угол",
    "Создайте систему частиц, используя CylinderShapeBlock",
    "Сравните визуальную разницу между PointShapeBlock и SphereShapeBlock с radiusRange = 0"
  ]
}