{
  "title": "2.4: Множественные Эмиттеры",
  "summary": "Научитесь создавать несколько систем частиц с разными эмиттерами в одном наборе",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь создавать несколько систем частиц в одном наборе. Каждая система может иметь свою форму эмиттера, цвет и поведение, позволяя создавать сложные, многослойные эффекты. Вы создадите полную настройку с двумя разными системами частиц - одной с Box эмиттером и другой со Sphere эмиттером.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте первый <filter-value>System</filter-value> блок для Box системы частиц",
    "Добавьте <filter-value>Texture</filter-value> блок для предоставления текстуры частицам и подключите к System блоку",
    "Загрузите <textures>flare.png</textures> с помощью кнопки загрузки в свойствах Texture блока",
    "Добавьте <filter-value>CreateParticle</filter-value> блок для эмиссии частиц и подключите к System блоку",
    "Добавьте <filter-value>Color4</filter-value> блок и установите его значение для базового цвета (например, красный)",
    "Подключите выход блока Color4 к входу color блока CreateParticle",
    "Добавьте <filter-value>Float</filter-value> блок и установите его значение для базового размера",
    "Подключите выход блока Float к входу size блока CreateParticle",
    "Добавьте <filter-value>BoxShape</filter-value> блок для эмиссии частиц из объема куба и подключите между блоками CreateParticle и System",
    "Добавьте блок <filter-value>UpdatePosition</filter-value> и подключите между блоками BoxShape и System",
    "Добавьте блок <filter-value>UpdateColor</filter-value> и подключите между блоками UpdatePosition и System",
    "Добавьте блок <filter-value>UpdateSize</filter-value> и подключите между блоками UpdateColor и System",
    "Создайте второй <filter-value>System</filter-value> блок для Sphere системы частиц",
    "Добавьте еще один <filter-value>Texture</filter-value> блок и подключите ко второму System блоку",
    "Загрузите <textures>flare.png</textures> с помощью кнопки загрузки в свойствах Texture блока",
    "Добавьте еще один <filter-value>CreateParticle</filter-value> блок для эмиссии частиц и подключите ко второму System блоку",
    "Добавьте еще один <filter-value>Color4</filter-value> блок и установите его значение для другого цвета (например, синий)",
    "Подключите выход второго блока Color4 к входу color второго блока CreateParticle",
    "Добавьте еще один <filter-value>Float</filter-value> блок и установите его значение для базового размера",
    "Подключите выход второго блока Float к входу size второго блока CreateParticle",
    "Добавьте <filter-value>SphereShape</filter-value> блок для эмиссии частиц из сферы и подключите между блоками CreateParticle и System",
    "Добавьте <filter-value>Float</filter-value> блок со значением для радиуса (например, 2.0) и подключите к входу radius блока SphereShape",
    "Добавьте блок <filter-value>UpdatePosition</filter-value> и подключите между блоками SphereShape и System",
    "Добавьте блок <filter-value>UpdateColor</filter-value> и подключите между блоками UpdatePosition и System",
    "Добавьте блок <filter-value>UpdateSize</filter-value> и подключите между блоками UpdateColor и System",
    "Наблюдайте, как обе системы работают одновременно, создавая многослойные эффекты"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "System Block (Multiple)",
      "description": "Вы можете иметь несколько System блоков в одном наборе. Каждый System блок представляет отдельную систему частиц, которая работает независимо. Это позволяет создавать сложные, многослойные эффекты. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "Name",
          "value": "'Box Particle System' или 'Sphere Particle System'",
          "description": "Отображаемое имя каждой системы частиц. Установите это в панели свойств справа от редактора."
        }
      ]
    },
    {
      "name": "Box Shape Block",
      "description": "Первый эмиттер: Эмиттирует частицы из объема куба. Используется в первой системе частиц. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": []
    },
    {
      "name": "Sphere Shape Block",
      "description": "Второй эмиттер: Эмиттирует частицы из сферы. Используется во второй системе частиц с входом радиуса. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "Radius",
          "value": "Float input (например, 2.0)",
          "description": "Радиус сферического эмиттера. Подключите Float блок к этому входу."
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение кода",
  "codeCopy": "Несколько систем частиц в одном наборе позволяют создавать сложные, многослойные эффекты. Каждый System блок работает независимо, поэтому вы можете иметь разные цвета, размеры, формы и поведения, происходящие одновременно. Это идеально для эффектов, таких как огонь с дымом (две системы), магические ауры с частицами (несколько систем) или любой сценарий, где вам нужны разные поведения частиц в одной сцене.",
  "objectivesTitle": "Цели обучения",
  "objectives": [
    "Понять, как создавать несколько System блоков в одном наборе",
    "Научиться организовывать несколько систем частиц",
    "Создавать многослойные эффекты с разными эмиттерами",
    "Комбинировать разные поведения частиц в одной сцене",
    "Понять, когда использовать несколько систем вместо одной сложной системы"
  ],
  "commonMistakesTitle": "Распространенные ошибки",
  "commonMistakes": [
    {
      "mistake": "Забывание подключить все System блоки",
      "explanation": "Каждый System блок должен быть правильно подключен к другим блокам. Если вы создаете System блок, но не подключаете к нему блоки обновления, он не будет работать.",
      "solution": "Всегда подключайте все блоки обновления к System блоку. Перетащите соединения от выходов блоков обновления к входу particle System блока."
    },
    {
      "mistake": "Использование одинаковых имен переменных для разных систем",
      "explanation": "Если вы повторно используете имена переменных (например, 'updatePosition' для обеих систем), вторая система перезапишет первую, вызывая ошибки.",
      "solution": "Используйте уникальные имена для блоков каждой системы: updatePosition1, updatePosition2, или updatePositionPoint, updatePositionSphere."
    },
    {
      "mistake": "Непонимание, что системы работают независимо",
      "explanation": "Каждый System блок полностью независим. Они не делят частицы, свойства или состояние. Это сделано намеренно для гибкости.",
      "solution": "Проектируйте каждую систему как самодостаточную. Если вам нужно, чтобы системы взаимодействовали, вам понадобится использовать логику уровня сцены или объединить их в одну систему."
    }
  ],
  "homeworkTitle": "Практические упражнения",
  "homework": [
    "Создайте три разные системы частиц с разными цветами",
    "Попробуйте комбинировать эмиттеры Point, Sphere и Cone в одном наборе",
    "Создайте эффект огня с двумя системами: пламя (оранжевое) и дым (серый)",
    "Экспериментируйте с разными размерами и поведениями для каждой системы",
    "Создайте многослойный магический эффект с несколькими системами"
  ]
}

