{
  "title": "2.3: Эмиттеры из Мезшей",
  "summary": "Научитесь эмиттировать частицы с поверхностей 3D мешей используя MeshShapeBlock",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь использовать Mesh Shape блок для эмиссии частиц с поверхности 3D мешей. Это мощный инструмент для создания эффектов, которые следуют форме объектов, таких как искры от меча, дым от персонажа или частицы, которые появляются из конкретного объекта в вашей сцене. Вы создадите полную систему частиц с нуля, которая демонстрирует эмиссию на основе мешей.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте <filter-value>System</filter-value> блок - это корень вашей системы частиц",
    "Добавьте <filter-value>Texture</filter-value> блок для предоставления текстуры частицам и подключите к System блоку",
    "Загрузите <textures>flare.png</textures> с помощью кнопки загрузки в свойствах Texture блока",
    "Добавьте <filter-value>CreateParticle</filter-value> блок для эмиссии частиц и подключите к System блоку",
    "Добавьте <filter-value>Color4</filter-value> блок и установите его значение на базовый цвет",
    "Подключите выход Color4 блока к входу color блока CreateParticle",
    "Добавьте <filter-value>Float</filter-value> блок и установите его значение для базового размера",
    "Подключите выход Float блока к входу size блока CreateParticle",
    "Добавьте <filter-value>MeshShape</filter-value> блок для эмиссии частиц с поверхности меша и подключите между CreateParticle и System блоками",
    "Примечание: В реальном сценарии вы бы ссылались на реальный меш из вашей сцены в свойствах MeshShape блока",
    "Добавьте <filter-value>UpdatePosition</filter-value> блок для обработки движения частиц и подключите между MeshShape и System блоками",
    "Добавьте <filter-value>Position</filter-value> блок и <filter-value>ScaledDirection</filter-value> блок",
    "Добавьте математический <filter-value>Add</filter-value> блок для объединения позиции и направления",
    "Подключите Position и ScaledDirection блоки к левому и правому входам математического блока соответственно",
    "Подключите результат из математического блока к входу position блока UpdatePosition",
    "Добавьте <filter-value>UpdateColor</filter-value> блок после UpdatePosition блока и подключите между UpdatePosition и System блоками",
    "Добавьте <filter-value>InitialColor</filter-value> блок и подключите его выход к входу color блока UpdateColor",
    "Добавьте <filter-value>UpdateSize</filter-value> блок после UpdateColor блока и подключите между UpdateColor и System блоками",
    "Добавьте еще один <filter-value>Float</filter-value> блок с постоянным значением размера и подключите к входу size блока UpdateSize",
    "Наблюдайте, как частицы эмиттируются с поверхности меша"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "Mesh Shape Block",
      "description": "Эмиттирует частицы с поверхности 3D меша. Частицы появляются на поверхности меша, следуя его форме. Это полезно для создания эффектов, привязанных к конкретным объектам в вашей сцене. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "Name",
          "value": "Mesh emitter",
          "description": "Отображаемое имя эмиттера. Установите это в панели свойств справа от редактора."
        },
        {
          "name": "Mesh",
          "value": "Mesh reference",
          "description": "Ссылка на 3D меш, с которого будут эмиттироваться частицы. Меш должен существовать в сцене. Установите это в панели свойств справа от редактора."
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение кода",
  "codeCopy": "Mesh Shape блок позволяет вам эмиттировать частицы с поверхности любого 3D меша в вашей сцене. Это создает сильную визуальную связь между частицами и объектом, делая это идеальным для эффектов, таких как искры от металла, дым от двигателей или магические ауры вокруг персонажей. Частицы появляются на поверхности меша, следуя его геометрии, что создает естественно выглядящие эффекты, которые адаптируются к форме объекта.",
  "objectivesTitle": "Цели обучения",
  "objectives": [
    "Понять Mesh Shape блок и его варианты использования",
    "Научиться ссылаться на меши из сцены",
    "Создавать эффекты частиц, привязанные к 3D объектам",
    "Понять разницу между эмиссией из мешей и другими формами эмиттеров",
    "Применять эмиссию на основе мешей к реальным сценариям"
  ],
  "commonMistakesTitle": "Распространенные ошибки",
  "commonMistakes": [
    {
      "mistake": "Не ссылаться на валидный меш",
      "explanation": "Mesh Shape блок требует валидную ссылку на меш. Если меш не существует или неправильно ссылается, частицы не будут эмиттироваться корректно.",
      "solution": "Убедитесь, что меш существует в сцене перед использованием Mesh Shape блока. Ссылайтесь на него правильно в панели свойств справа от редактора, используя имя меша или прямую ссылку."
    },
    {
      "mistake": "Использование эмиссии из мешей для эффектов, которые не нуждаются в привязке к объекту",
      "explanation": "Эмиссия из мешей более сложная, чем другие формы. Если вам не нужны частицы, привязанные к конкретному объекту, используйте более простые формы, такие как Box Shape блок или Sphere Shape блок.",
      "solution": "Используйте Mesh Shape блок только когда вам нужны частицы, следующие форме объекта. Для общих эффектов используйте формы Box, Sphere, Cone или Cylinder."
    }
  ],
  "homeworkTitle": "Практические упражнения",
  "homework": [
    "Создайте частицы, которые эмиттируются из модели персонажа",
    "Попробуйте эмиттировать частицы из разных частей меша",
    "Комбинируйте эмиссию из мешей с другими эффектами (изменение цвета, вариации размера)",
    "Экспериментируйте с анимированными мешами, чтобы увидеть, как частицы следуют движению",
    "Создайте эффект следа частиц, используя эмиссию из мешей"
  ]
}

