{
  "title": "2.2: Случайность",
  "summary": "Научитесь добавлять случайность к свойствам частиц, используя ParticleRandomBlock",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь добавлять случайность и вариативность в ваши системы частиц, используя ParticleRandomBlock. Случайность необходима для создания органичных, естественно выглядящих эффектов. Вы научитесь рандомизировать цвета, размеры и другие свойства, а также поймете различные режимы блокировки, которые контролируют, когда генерируются случайные значения.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте SystemBlock - это корень вашей системы частиц",
    "Создайте CreateParticleBlock для эмиссии частиц",
    "Установите начальный цвет и размер используя ParticleInputBlock",
    "Добавьте PointShapeBlock для эмиссии частиц из одной точки",
    "Добавьте UpdateColorBlock для изменения цвета частиц",
    "Создайте два цветовых входа: minColor (синий) и maxColor (оранжевый)",
    "Используйте ParticleRandomBlock для генерации случайного цвета между min и max",
    "Установите lockMode в OncePerParticle, чтобы каждая частица получала фиксированный случайный цвет на всю свою жизнь",
    "Подключите случайный цвет к UpdateColorBlock",
    "Добавьте UpdateSizeBlock для изменения размера частиц",
    "Создайте входы minSize и maxSize",
    "Используйте еще один ParticleRandomBlock для рандомизации размера с режимом блокировки OncePerParticle",
    "Подключите случайный размер к UpdateSizeBlock"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "ParticleRandomBlock",
      "description": "Генерирует случайные значения между минимумом и максимумом. Поддерживает типы Float, Vector2, Vector3 и Color4. Необходим для добавления вариативности в системы частиц.",
      "properties": [
        {
          "name": "name",
          "value": "'Random Color' или 'Random Size'",
          "description": "Отображаемое имя блока"
        },
        {
          "name": "min",
          "value": "Input (того же типа, что и max)",
          "description": "Минимальное значение для генерации случайных чисел"
        },
        {
          "name": "max",
          "value": "Input (того же типа, что и min)",
          "description": "Максимальное значение для генерации случайных чисел"
        },
        {
          "name": "lockMode",
          "value": "ParticleRandomBlockLocks enum",
          "description": "Контролирует, когда генерируется случайное значение: None (каждый кадр), PerParticle (один раз на частицу за кадр), PerSystem (один раз на систему), OncePerParticle (один раз при создании частицы)"
        }
      ]
    },
    {
      "name": "ParticleInputBlock (Color4)",
      "description": "Предоставляет значение Color4. Используется для определения минимального и максимального цветов для генерации случайного цвета.",
      "properties": [
        {
          "name": "value",
          "value": "Color4",
          "description": "Значение цвета (например, new Color4(0.2, 0.5, 1.0, 1.0) для синего)"
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Этот урок демонстрирует использование ParticleRandomBlock для добавления случайности к свойствам частиц. Ключевая концепция - это свойство lockMode, которое определяет, когда генерируются случайные значения. OncePerParticle гарантирует, что каждая частица получает случайное значение при создании, и это значение остается постоянным в течение всей жизни частицы. Это идеально подходит для свойств, таких как цвет и размер, где вы хотите вариативность между частицами, но постоянство для каждой отдельной частицы. Формула для генерации случайных чисел: randomValue = min + Math.random() * (max - min).",
  "objectivesTitle": "Цели Обучения",
  "objectives": [
    "Понять ParticleRandomBlock и его свойство lockMode",
    "Научиться, когда использовать разные значения lockMode (None, PerParticle, PerSystem, OncePerParticle)",
    "Рандомизировать свойства частиц (цвет, размер, направление) для вариативности",
    "Комбинировать случайные значения с другими расчетами",
    "Понять разницу между случайностью на кадр и на частицу"
  ],
  "commonMistakesTitle": "Частые Ошибки",
  "commonMistakes": [
    {
      "mistake": "Использование неправильного lockMode для желаемого эффекта",
      "explanation": "lockMode определяет, когда генерируются случайные значения. Использование None заставляет значения изменяться каждый кадр (мерцание), в то время как OncePerParticle дает каждой частице фиксированное случайное значение на всю жизнь.",
      "solution": "Используйте OncePerParticle для свойств, таких как цвет и размер, где вы хотите вариативность между частицами, но постоянство для каждой отдельной частицы. Используйте None только если вы хотите мерцающие/изменяющиеся значения каждый кадр."
    },
    {
      "mistake": "Неправильная настройка значений min и max",
      "explanation": "ParticleRandomBlock требует оба входа min и max. Если min > max, или если типы не совпадают, генерация случайных чисел не удастся или даст неверные результаты.",
      "solution": "Всегда убеждайтесь, что min < max и что оба входа одного типа (оба Float, оба Color4, оба Vector3 и т.д.). Для цветов используйте значения Color4. Для размеров используйте значения float."
    },
    {
      "mistake": "Использование случайных значений, которые изменяются каждый кадр, для статических свойств",
      "explanation": "Свойства, такие как начальный цвет или размер, должны использовать lockMode OncePerParticle. Использование None или PerParticle заставляет эти свойства мерцать или постоянно изменяться, что обычно нежелательно.",
      "solution": "Для свойств, которые должны быть постоянными для каждой частицы (цвет, начальный размер), используйте OncePerParticle. Используйте None или PerParticle только для свойств, которые должны изменяться со временем (например, анимированные эффекты)."
    }
  ],
  "homeworkTitle": "Упражнения для Практики",
  "homework": [
    "Попробуйте разные значения lockMode (PerParticle, PerSystem) и наблюдайте различия",
    "Рандомизируйте направление частиц, используя случайные значения Vector3",
    "Создайте систему частиц со случайными цветами по всему спектру",
    "Комбинируйте случайный размер с изменениями размера на основе возраста",
    "Экспериментируйте со случайными значениями Vector2 для масштаба частиц"
  ]
}