{
  "title": "2.4: Multiple Emitters",
  "summary": "Learn to create multiple particle systems with different emitters in a single set",
  "introTitle": "Introduction",
  "intro": "In this lesson, you'll learn how to create multiple particle systems within a single NodeParticleSystemSet. Each system can have its own emitter shape, color, and behavior, allowing you to create complex, layered effects. You'll create a complete setup with two different particle systems - one using a Box emitter and another using a Sphere emitter.",
  "stepsTitle": "Step-by-Step Instructions",
  "steps": [
    "Create the first <filter-value>System</filter-value> block for the Box Particle System",
    "Add a <filter-value>Texture</filter-value> block to provide a texture for the particles and connect to System block",
    "Load a <textures>flare.png</textures> by load button in the Texture block properties",
    "Add a <filter-value>CreateParticle</filter-value> block to emit particles and connect to System block",
    "Add a <filter-value>Color4</filter-value> block and set its value to a base color (e.g., red)",
    "Connect the Color4 block's output to CreateParticle block's color input",
    "Add a <filter-value>Float</filter-value> block and set its value for base size",
    "Connect the Float block's output to CreateParticle block's size input",
    "Add a <filter-value>BoxShape</filter-value> block to emit particles from a box volume and connect between CreateParticle and System blocks",
    "Add an <filter-value>UpdatePosition</filter-value> block and connect between BoxShape and System blocks",
    "Add an <filter-value>UpdateColor</filter-value> block and connect between UpdatePosition and System blocks",
    "Add an <filter-value>UpdateSize</filter-value> block and connect between UpdateColor and System blocks",
    "Create a second <filter-value>System</filter-value> block for the Sphere Particle System",
    "Add another <filter-value>Texture</filter-value> block and connect to the second System block",
    "Load a <textures>flare.png</textures> by load button in the Texture block properties",
    "Add another <filter-value>CreateParticle</filter-value> block to emit particles and connect to the second System block",
    "Add another <filter-value>Color4</filter-value> block and set its value to a different color (e.g., blue)",
    "Connect the second Color4 block's output to the second CreateParticle block's color input",
    "Add another <filter-value>Float</filter-value> block and set its value for base size",
    "Connect the second Float block's output to the second CreateParticle block's size input",
    "Add a <filter-value>SphereShape</filter-value> block to emit particles from a sphere and connect between CreateParticle and System blocks",
    "Add a <filter-value>Float</filter-value> block with value for radius (e.g., 2.0) and connect to SphereShape block's radius input",
    "Add an <filter-value>UpdatePosition</filter-value> block and connect between SphereShape and System blocks",
    "Add an <filter-value>UpdateColor</filter-value> block and connect between UpdatePosition and System blocks",
    "Add an <filter-value>UpdateSize</filter-value> block and connect between UpdateColor and System blocks",
    "Observe how both systems run simultaneously, creating layered effects"
  ],
  "blocksTitle": "Blocks Used in This Lesson",
  "blocks": [
    {
      "name": "System Block (Multiple)",
      "description": "You can have multiple System blocks in a single set. Each System block represents a separate particle system that runs independently. This allows you to create complex, multi-layered effects. In the visual editor, you can find this block in the block list and configure its properties in the properties panel on the right.",
      "properties": [
        {
          "name": "Name",
          "value": "'Box Particle System' or 'Sphere Particle System'",
          "description": "The display name of each particle system. Set this in the properties panel on the right side of the editor."
        }
      ]
    },
    {
      "name": "Box Shape Block",
      "description": "First emitter: Emits particles from a box volume. Used in the first particle system. In the visual editor, you can find this block in the block list and configure its properties in the properties panel on the right.",
      "properties": []
    },
    {
      "name": "Sphere Shape Block",
      "description": "Second emitter: Emits particles from a sphere. Used in the second particle system with a radius input. In the visual editor, you can find this block in the block list and configure its properties in the properties panel on the right.",
      "properties": [
        {
          "name": "Radius",
          "value": "Float input (e.g., 2.0)",
          "description": "The radius of the sphere emitter. Connect a Float block to this input."
        }
      ]
    }
  ],
  "properties": "Properties",
  "codeTitle": "Code Explanation",
  "codeCopy": "Multiple particle systems in one set allow you to create complex, layered effects. Each System block runs independently, so you can have different colors, sizes, shapes, and behaviors all happening simultaneously. This is perfect for effects like fire with smoke (two systems), magical auras with particles (multiple systems), or any scenario where you need different particle behaviors in the same scene.",
  "objectivesTitle": "Learning Objectives",
  "objectives": [
    "Understand how to create multiple System blocks in one set",
    "Learn to organize multiple particle systems",
    "Create layered effects with different emitters",
    "Combine different particle behaviors in one scene",
    "Understand when to use multiple systems vs. one complex system"
  ],
  "commonMistakesTitle": "Common Mistakes",
  "commonMistakes": [
    {
      "mistake": "Forgetting to connect all blocks to System blocks",
      "explanation": "Each System block must be properly connected to other blocks. If you create a System block but don't connect update blocks to it, it won't work correctly.",
      "solution": "Always connect all update blocks to the System block. Drag connections from update block outputs to the System block's particle input."
    },
    {
      "mistake": "Using the same variable names for different systems",
      "explanation": "If you reuse variable names (like 'updatePosition' for both systems), the second system will overwrite the first, causing errors.",
      "solution": "Use unique names for each system's blocks: updatePosition1, updatePosition2, or updatePositionBox, updatePositionSphere. Set these in the properties panel on the right side of the editor."
    },
    {
      "mistake": "Not understanding that systems run independently",
      "explanation": "Each System block is completely independent. They don't share particles, properties, or state. This is by design for flexibility.",
      "solution": "Design each system to be self-contained. If you need systems to interact, you'll need to use scene-level logic or combine them into one system."
    }
  ],
  "homeworkTitle": "Practice Exercises",
  "homework": [
    "Create three different particle systems with different colors",
    "Try combining Box, Sphere, and Cone emitters in one set",
    "Create a fire effect with two systems: flames (orange) and smoke (gray)",
    "Experiment with different sizes and behaviors for each system",
    "Create a layered magical effect with multiple systems"
  ]
}

