{
  "title": "2.4: Множественные Эмиттеры",
  "summary": "Научитесь создавать несколько систем частиц с разными эмиттерами в одном наборе",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь создавать несколько систем частиц в одном NodeParticleSystemSet. Каждая система может иметь свою форму эмиттера, цвет и поведение, позволяя создавать сложные, многослойные эффекты. Вы создадите полную настройку с двумя разными системами частиц - одной с точечным эмиттером и другой со сферическим эмиттером.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте первый SystemBlock для системы частиц Point",
    "Создайте CreateParticleBlock с начальным цветом (например, красный) и размером",
    "Добавьте <filter-value>BoxShape</filter-value> блок для эмиссии частиц из объема куба",
    "Добавьте UpdatePositionBlock, UpdateColorBlock и UpdateSizeBlock",
    "Подключите все блоки и добавьте текстуру для первой системы",
    "Создайте второй SystemBlock для системы частиц Sphere",
    "Создайте еще один CreateParticleBlock с другим цветом (например, синий) и размером",
    "Добавьте SphereShapeBlock с входом радиуса",
    "Добавьте UpdatePositionBlock, UpdateColorBlock и UpdateSizeBlock для второй системы",
    "Подключите все блоки и добавьте текстуру для второй системы",
    "Добавьте оба SystemBlock в массив systemBlocks набора",
    "Наблюдайте, как обе системы работают одновременно, создавая многослойные эффекты"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "SystemBlock (Множественный)",
      "description": "Вы можете иметь несколько SystemBlock в одном NodeParticleSystemSet. Каждый SystemBlock представляет отдельную систему частиц, которая работает независимо. Это позволяет создавать сложные, многослойные эффекты.",
      "properties": [
        {
          "name": "name",
          "value": "'Point Particle System' или 'Sphere Particle System'",
          "description": "Отображаемое имя каждой системы частиц"
        }
      ]
    },
    {
      "name": "Box Shape Block",
      "description": "Первый эмиттер: Эмиттирует частицы из объема куба. Используется в первой системе частиц. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": []
    },
    {
      "name": "SphereShapeBlock",
      "description": "Второй эмиттер: Эмиттирует частицы из сферы. Используется во второй системе частиц с входом радиуса.",
      "properties": [
        {
          "name": "radius",
          "value": "Вход Float (например, 2.0)",
          "description": "Радиус сферического эмиттера"
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение кода",
  "codeCopy": "Несколько систем частиц в одном наборе позволяют создавать сложные, многослойные эффекты. Каждый SystemBlock работает независимо, поэтому вы можете иметь разные цвета, размеры, формы и поведения, происходящие одновременно. Это идеально для эффектов, таких как огонь с дымом (две системы), магические ауры с частицами (несколько систем) или любой сценарий, где вам нужны разные поведения частиц в одной сцене.",
  "objectivesTitle": "Цели обучения",
  "objectives": [
    "Понять, как создавать несколько SystemBlock в одном наборе",
    "Научиться организовывать несколько систем частиц",
    "Создавать многослойные эффекты с разными эмиттерами",
    "Комбинировать разные поведения частиц в одной сцене",
    "Понять, когда использовать несколько систем вместо одной сложной системы"
  ],
  "commonMistakesTitle": "Распространенные ошибки",
  "commonMistakes": [
    {
      "mistake": "Забывание добавить все SystemBlock в массив systemBlocks",
      "explanation": "Каждый SystemBlock должен быть добавлен в массив systemBlocks набора. Если вы создаете SystemBlock, но не добавляете его, он не будет работать.",
      "solution": "Всегда добавляйте все SystemBlock в set.systemBlocks.push(systemBlock1, systemBlock2, ...). Каждый созданный SystemBlock должен быть в этом массиве."
    },
    {
      "mistake": "Использование одинаковых имен переменных для разных систем",
      "explanation": "Если вы повторно используете имена переменных (например, 'updatePosition' для обеих систем), вторая система перезапишет первую, вызывая ошибки.",
      "solution": "Используйте уникальные имена для блоков каждой системы: updatePosition1, updatePosition2, или updatePositionPoint, updatePositionSphere."
    },
    {
      "mistake": "Непонимание, что системы работают независимо",
      "explanation": "Каждый SystemBlock полностью независим. Они не делят частицы, свойства или состояние. Это сделано намеренно для гибкости.",
      "solution": "Проектируйте каждую систему как самодостаточную. Если вам нужно, чтобы системы взаимодействовали, вам понадобится использовать логику уровня сцены или объединить их в одну систему."
    }
  ],
  "homeworkTitle": "Практические упражнения",
  "homework": [
    "Создайте три разные системы частиц с разными цветами",
    "Попробуйте комбинировать эмиттеры Point, Sphere и Cone в одном наборе",
    "Создайте эффект огня с двумя системами: пламя (оранжевое) и дым (серый)",
    "Экспериментируйте с разными размерами и поведениями для каждой системы",
    "Создайте многослойный магический эффект с несколькими системами"
  ]
}

