{
  "title": "2.3: Эмиттеры из Мезшей",
  "summary": "Научитесь эмиттировать частицы с поверхностей 3D мешей используя MeshShapeBlock",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь использовать MeshShapeBlock для эмиссии частиц с поверхности 3D мешей. Это мощный инструмент для создания эффектов, которые следуют форме объектов, таких как искры от меча, дым от персонажа или частицы, которые появляются из конкретного объекта в вашей сцене. Вы создадите полную систему частиц с нуля, которая демонстрирует эмиссию на основе мешей.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте SystemBlock - это корень вашей системы частиц",
    "Создайте CreateParticleBlock для эмиссии частиц",
    "Установите начальный цвет и размер используя ParticleInputBlock",
    "Добавьте MeshShapeBlock для эмиссии частиц с поверхности меша",
    "Примечание: В реальном сценарии вы бы ссылались на реальный меш из вашей сцены",
    "Добавьте UpdatePositionBlock для обработки движения частиц",
    "Получите Position и ScaledDirection, сложите их и подключите к UpdatePositionBlock",
    "Добавьте UpdateColorBlock и подключите контекстное значение InitialColor к нему",
    "Добавьте UpdateSizeBlock с постоянным значением размера",
    "Соедините блоки: CreateParticle → MeshShape → UpdatePosition → UpdateColor → UpdateSize → SystemBlock",
    "Добавьте ParticleTextureSourceBlock для предоставления текстуры",
    "Наблюдайте, как частицы эмиттируются с поверхности меша"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "MeshShapeBlock",
      "description": "Эмиттирует частицы с поверхности 3D меша. Частицы появляются на поверхности меша, следуя его форме. Это полезно для создания эффектов, привязанных к конкретным объектам в вашей сцене.",
      "properties": [
        {
          "name": "name",
          "value": "'Эмиттер меша'",
          "description": "Отображаемое имя эмиттера"
        },
        {
          "name": "mesh",
          "value": "Ссылка на меш",
          "description": "Ссылка на 3D меш, с которого будут эмиттироваться частицы. Меш должен существовать в сцене."
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение кода",
  "codeCopy": "MeshShapeBlock позволяет вам эмиттировать частицы с поверхности любого 3D меша в вашей сцене. Это создает сильную визуальную связь между частицами и объектом, делая это идеальным для эффектов, таких как искры от металла, дым от двигателей или магические ауры вокруг персонажей. Частицы появляются на поверхности меша, следуя его геометрии, что создает естественно выглядящие эффекты, которые адаптируются к форме объекта.",
  "objectivesTitle": "Цели обучения",
  "objectives": [
    "Понять MeshShapeBlock и его варианты использования",
    "Научиться ссылаться на меши из сцены",
    "Создавать эффекты частиц, привязанные к 3D объектам",
    "Понять разницу между эмиссией из мешей и другими формами эмиттеров",
    "Применять эмиссию на основе мешей к реальным сценариям"
  ],
  "commonMistakesTitle": "Распространенные ошибки",
  "commonMistakes": [
    {
      "mistake": "Не ссылаться на валидный меш",
      "explanation": "MeshShapeBlock требует валидную ссылку на меш. Если меш не существует или неправильно ссылается, частицы не будут эмиттироваться корректно.",
      "solution": "Убедитесь, что меш существует в сцене перед использованием MeshShapeBlock. Ссылайтесь на него правильно, используя имя меша или прямую ссылку."
    },
    {
      "mistake": "Использование эмиссии из мешей для эффектов, которые не нуждаются в привязке к объекту",
      "explanation": "Эмиссия из мешей более сложная, чем другие формы. Если вам не нужны частицы, привязанные к конкретному объекту, используйте более простые формы, такие как PointShapeBlock или SphereShapeBlock.",
      "solution": "Используйте MeshShapeBlock только когда вам нужны частицы, следующие форме объекта. Для общих эффектов используйте формы Point, Sphere, Cone или Box."
    }
  ],
  "homeworkTitle": "Практические упражнения",
  "homework": [
    "Создайте частицы, которые эмиттируются из модели персонажа",
    "Попробуйте эмиттировать частицы из разных частей меша",
    "Комбинируйте эмиссию из мешей с другими эффектами (изменение цвета, вариации размера)",
    "Экспериментируйте с анимированными мешами, чтобы увидеть, как частицы следуют движению",
    "Создайте эффект следа частиц, используя эмиссию из мешей"
  ]
}

