{
  "title": "2.1: Формы Эмиттеров",
  "summary": "Изучите различные формы эмиттеров: конус, сфера, куб и другие",
  "introTitle": "Введение",
  "intro": "В этом уроке вы узнаете о различных формах эмиттеров, доступных в Редакторе Частиц. Каждая форма создает частицы из разного объема, давая вам контроль над тем, где появляются частицы. Мы сосредоточимся на Cone Shape блоке, который создает направленные эффекты, такие как огонь или фонтаны, и поймем его свойства, такие как радиус, угол, radiusRange и heightRange.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте <filter-value>System</filter-value> блок - это корень вашей системы частиц",
    "Добавьте <filter-value>Texture</filter-value> блок для предоставления текстуры частицам и подключите к System блоку",
    "Загрузите <textures>flare.png</textures> с помощью кнопки загрузки в свойствах Texture блока",
    "Добавьте <filter-value>CreateParticle</filter-value> блок для эмиссии частиц и подключите к System блоку",
    "Добавьте <filter-value>Color4</filter-value> блок и установите его значение на базовый цвет",
    "Подключите выход Color4 блока к входу color блока CreateParticle",
    "Добавьте <filter-value>Float</filter-value> блок и установите его значение для базового размера",
    "Подключите выход Float блока к входу size блока CreateParticle",
    "Добавьте <filter-value>ConeShape</filter-value> блок для эмиссии частиц в виде конуса и подключите между CreateParticle и System блоками",
    "Добавьте <filter-value>Float</filter-value> блок и установите его значение для радиуса конуса (базовая ширина конуса)",
    "Подключите выход Float блока к входу radius блока ConeShape",
    "Добавьте еще один <filter-value>Float</filter-value> блок и установите его значение для угла конуса (угол раскрытия в радианах)",
    "Подключите выход Float блока к входу angle блока ConeShape",
    "Добавьте еще один <filter-value>Float</filter-value> блок и установите его значение для radiusRange (случайное изменение радиуса, диапазон: 0-1)",
    "Подключите выход Float блока к входу radiusRange блока ConeShape",
    "Добавьте еще один <filter-value>Float</filter-value> блок и установите его значение для heightRange (случайное изменение высоты, диапазон: 0-1)",
    "Подключите выход Float блока к входу heightRange блока ConeShape",
    "Добавьте <filter-value>UpdatePosition</filter-value> блок для обработки движения частиц и подключите между ConeShape и System блоками",
    "Добавьте <filter-value>Position</filter-value> блок и <filter-value>ScaledDirection</filter-value> блок",
    "Добавьте математический <filter-value>Add</filter-value> блок для объединения позиции и направления",
    "Подключите результат к входу position блока UpdatePosition",
    "Экспериментируйте с разными значениями радиуса и угла, чтобы увидеть, как это влияет на распределение частиц",
    "Примечание: Также доступны другие формы, такие как <filter-value>SphereShape</filter-value>, <filter-value>CylinderShape</filter-value> и <filter-value>BoxShape</filter-value>"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "Sphere Shape Block",
      "description": "Эмитирует частицы из сферической формы. Частицы появляются в объеме сферы, с контролем радиуса и распределения. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "Name",
          "value": "Sphere emitter",
          "description": "Отображаемое имя эмиттера. Установите это в панели свойств справа от редактора."
        },
        {
          "name": "Radius",
          "value": "Float input (по умолчанию: 1.0)",
          "description": "Радиус сферы. Большие значения создают большую область эмиссии. Подключите Float блок к этому входу."
        },
        {
          "name": "Radius Range",
          "value": "Float input (по умолчанию: 1.0, диапазон: 0-1)",
          "description": "Контролирует, где появляются частицы внутри сферы. 0 = только центр, 1 = где угодно в сфере. Подключите Float блок к этому входу."
        },
        {
          "name": "Direction Randomizer",
          "value": "Float input (по умолчанию: 0, диапазон: 0-1)",
          "description": "Контролирует случайность направления частиц. 0 = равномерное направление, 1 = полностью случайное. Подключите Float блок к этому входу."
        }
      ]
    },
    {
      "name": "Box Shape Block",
      "description": "Эмитирует частицы из формы куба/коробки. Частицы появляются в объеме куба, определенном шириной, высотой и глубиной. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "Name",
          "value": "Box emitter",
          "description": "Отображаемое имя эмиттера. Установите это в панели свойств справа от редактора."
        }
      ]
    },
    {
      "name": "Cone Shape Block",
      "description": "Эмитирует частицы из конической формы. Полезно для создания направленных эффектов, таких как огонь, дым или фонтаны. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "Name",
          "value": "Cone emitter",
          "description": "Отображаемое имя эмиттера. Установите это в панели свойств справа от редактора."
        },
        {
          "name": "Radius",
          "value": "Float input",
          "description": "Базовый радиус конуса. Подключите Float блок к этому входу."
        },
        {
          "name": "Angle",
          "value": "Float input",
          "description": "Угол конуса в радианах. Подключите Float блок к этому входу."
        }
      ]
    },
    {
      "name": "Cylinder Shape Block",
      "description": "Эмитирует частицы из цилиндрической формы. Частицы появляются в цилиндрическом объеме. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "Name",
          "value": "Cylinder emitter",
          "description": "Отображаемое имя эмиттера. Установите это в панели свойств справа от редактора."
        },
        {
          "name": "Radius",
          "value": "Float input",
          "description": "Радиус цилиндра. Подключите Float блок к этому входу."
        },
        {
          "name": "Height",
          "value": "Float input",
          "description": "Высота цилиндра. Подключите Float блок к этому входу."
        }
      ]
    },
    {
      "name": "Box Shape Block (Альтернатива)",
      "description": "Для концентрированных эффектов вы можете использовать Box Shape блок с очень малыми размерами. Все частицы появляются из небольшой области, полезно для концентрированных эффектов. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "Name",
          "value": "Box emitter",
          "description": "Отображаемое имя эмиттера. Установите это в панели свойств справа от редактора."
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Различные формы эмиттеров дают вам контроль над пространственным распределением частиц. Sphere Shape блок создает частицы в сферическом объеме, в то время как Box Shape блок использует прямоугольный объем. Каждая форма имеет определенные свойства, такие как радиус, высота или угол, которые контролируют область эмиссии. Свойство radiusRange в Sphere Shape блоке особенно полезно - оно позволяет контролировать, появляются ли частицы только в центре (0) или по всему объему (1).",
  "objectivesTitle": "Цели Обучения",
  "objectives": [
    "Понять различные формы эмиттеров и их свойства",
    "Научиться контролировать распределение появления частиц с помощью radiusRange",
    "Использовать directionRandomizer для контроля направления эмиссии",
    "Понять, когда использовать каждый тип формы (Box, Sphere, Cone, Cylinder)",
    "Настраивать свойства форм, такие как радиус, угол и высота в панели свойств"
  ],
  "commonMistakesTitle": "Частые Ошибки",
  "commonMistakes": [
    {
      "mistake": "Непонимание поведения radiusRange",
      "explanation": "radiusRange контролирует, где появляются частицы внутри формы. 0 означает, что частицы появляются только в центре, 1 означает где угодно в объеме. Использование неправильных значений создает неожиданные распределения.",
      "solution": "Используйте radiusRange = 0 для концентрированной эмиссии (только центр), radiusRange = 1 для полной объемной эмиссии. Для сферических форм это особенно важно для контроля распространения частиц."
    },
    {
      "mistake": "Использование неправильной формы для желаемого эффекта",
      "explanation": "Каждая форма имеет специфические случаи использования. Использование Box Shape блока для эффекта фонтана или Cone Shape блока для равномерного распределения не даст желаемого результата.",
      "solution": "Используйте Box Shape блок с малыми размерами для концентрированных эффектов, Sphere Shape блок для радиальных эффектов, Cone Shape блок для направленных эффектов (огонь, фонтаны), Box Shape блок для прямоугольных областей, Cylinder Shape блок для цилиндрических объемов."
    },
    {
      "mistake": "Неправильная настройка свойств формы",
      "explanation": "Формы имеют свойства, такие как радиус, угол, высота, которые должны быть установлены правильно. Использование значений по умолчанию или неправильных типов вызывает неправильную эмиссию.",
      "solution": "Всегда явно устанавливайте свойства формы. Для Cone Shape блока подключите Float блоки к входам radius и angle. Для Sphere Shape блока подключите Float блоки к входам radius и radiusRange. Настройте это в панели свойств справа от редактора."
    }
  ],
  "homeworkTitle": "Упражнения для Практики",
  "homework": [
    "Попробуйте изменить радиус сферы, чтобы увидеть, как это влияет на распределение частиц",
    "Экспериментируйте со значениями radiusRange от 0 до 1",
    "Замените Sphere Shape блок на Cone Shape блок и настройте угол",
    "Создайте систему частиц, используя Cylinder Shape блок",
    "Сравните визуальную разницу между Box Shape блоком с малыми размерами и Sphere Shape блоком с radiusRange = 0"
  ]
}