{
  "title": "5.2: Условная Логика",
  "summary": "Научитесь использовать ParticleConditionBlock для создания условных эффектов на основе свойств частиц",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь использовать ParticleConditionBlock для создания условной логики в ваших системах частиц. Условные блоки позволяют принимать решения на основе свойств частиц - например, изменять цвет, когда частица достигает определенного возраста, или применять различные эффекты на основе скорости. Вы научитесь использовать операции сравнения (GreaterThan, LessThan, Equal и т.д.) и комбинировать условия с другими блоками.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте SystemBlock - это корень вашей системы частиц",
    "Создайте CreateParticleBlock для эмиссии частиц",
    "Установите начальный цвет и размер используя ParticleInputBlock",
    "Добавьте PointShapeBlock для эмиссии частиц из одной точки",
    "Получите возраст и время жизни частицы, используя ParticleInputBlock",
    "Вычислите соотношение возраста (Возраст / Время жизни) для получения значения от 0 до 1",
    "Создайте пороговое значение (0.5), используя ParticleInputBlock",
    "Создайте ParticleConditionBlock с тестом GreaterThan",
    "Подключите соотношениеВозраста к левому входу и порог к правому входу",
    "Создайте два цвета: Цвет1 (красный) и Цвет2 (синий)",
    "Подключите Цвет1 к условие.ifTrue и Цвет2 к условие.ifFalse",
    "Используйте выход условия для управления цветом и размером частиц",
    "Наблюдайте, как частицы изменяют цвет и размер, когда они проходят порог"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "ParticleConditionBlock",
      "description": "Оценивает условие и возвращает одно значение, если истинно, другое, если ложно. Поддерживает различные операции сравнения, такие как Equal, NotEqual, LessThan, GreaterThan и т.д.",
      "properties": [
        {
          "name": "test",
          "value": "ParticleConditionBlockTests.GreaterThan",
          "description": "Операция сравнения для выполнения"
        },
        {
          "name": "left",
          "value": "Float input",
          "description": "Левый операнд (например, соотношениеВозраста)"
        },
        {
          "name": "right",
          "value": "Float input",
          "description": "Правый операнд (например, порог)"
        },
        {
          "name": "ifTrue",
          "value": "AutoDetect input",
          "description": "Значение для возврата, если условие истинно (например, Цвет1)"
        },
        {
          "name": "ifFalse",
          "value": "AutoDetect input",
          "description": "Значение для возврата, если условие ложно (например, Цвет2)"
        }
      ]
    },
    {
      "name": "ParticleInputBlock (Age/Lifetime)",
      "description": "Получает возраст и время жизни частицы для условной логики. Соотношение возраста (Возраст / Время жизни) дает нормализованное значение от 0 до 1.",
      "properties": [
        {
          "name": "contextualValue",
          "value": "NodeParticleContextualSources.Age / Lifetime",
          "description": "Контекстный источник - Возраст или Время жизни"
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Этот урок демонстрирует условную логику с использованием ParticleConditionBlock. Блок условия оценивает сравнение (например, соотношениеВозраста > 0.5) и возвращает одно значение, если истинно, другое, если ложно. Это позволяет создавать эффекты, которые изменяются на основе состояния частицы. Например, частицы могут изменять цвет, когда они достигают половины своего времени жизни, или применять различные эффекты на основе скорости, позиции или других свойств. Условная логика необходима для создания сложного, основанного на состоянии поведения частиц.",
  "objectivesTitle": "Цели Обучения",
  "objectives": [
    "Использовать ParticleConditionBlock для условной логики",
    "Понять различные операции сравнения (GreaterThan, LessThan, Equal и т.д.)",
    "Создавать логику if-then-else с входами ifTrue и ifFalse",
    "Комбинировать условия со свойствами частиц (возраст, скорость, позиция)",
    "Применять условные эффекты к свойствам частиц"
  ],
  "commonMistakesTitle": "Частые Ошибки",
  "commonMistakes": [
    {
      "mistake": "Использование неправильной операции сравнения",
      "explanation": "Каждая операция сравнения (GreaterThan, LessThan, Equal и т.д.) проверяет различное отношение. Использование неправильной создает противоположную логику.",
      "solution": "GreaterThan: left > right. LessThan: left < right. Equal: left == right. Выберите операцию, которая соответствует вашему желаемому условию."
    },
    {
      "mistake": "Перестановка значений ifTrue и ifFalse",
      "explanation": "ifTrue возвращается, когда условие истинно, ifFalse когда условие ложно. Перестановка их обращает логику.",
      "solution": "Установите ifTrue на значение, которое вы хотите, когда условие истинно, ifFalse на значение, когда условие ложно. Дважды проверьте, что ваша логика соответствует вашему намерению."
    },
    {
      "mistake": "Не обеспечение того, что ifTrue и ifFalse одного типа",
      "explanation": "ParticleConditionBlock требует, чтобы входы ifTrue и ifFalse были одного типа (оба Color4, оба Float и т.д.). Несовпадающие типы вызывают ошибки.",
      "solution": "Убедитесь, что оба входа ifTrue и ifFalse одного типа. Если один Color4, другой должен быть Color4. Если один Float, другой должен быть Float."
    }
  ],
  "homeworkTitle": "Упражнения для Практики",
  "homework": [
    "Попробуйте различные операции сравнения (LessThan, Equal, NotEqual)",
    "Создайте несколько условий и объедините их, используя операции And/Or",
    "Используйте условия для запуска различных эффектов на разных возрастах частиц",
    "Объедините условную логику с другими эффектами, такими как изменения размера или масштаба",
    "Экспериментируйте с различными пороговыми значениями, чтобы увидеть, как они влияют на поведение частиц"
  ]
}