{
  "title": "5.2: Conditional Logic",
  "summary": "Learn to use ParticleConditionBlock to create conditional effects based on particle properties",
  "introTitle": "Introduction",
  "intro": "In this lesson, you'll learn how to use ParticleConditionBlock to create conditional logic in your particle systems. Conditional blocks allow you to make decisions based on particle properties - for example, changing color when a particle reaches a certain age, or applying different effects based on speed. You'll learn to use comparison operations (GreaterThan, LessThan, Equal, etc.) and combine conditions with other blocks.",
  "stepsTitle": "Step-by-Step Instructions",
  "steps": [
    "Create a SystemBlock - this is the root of your particle system",
    "Create a CreateParticleBlock to emit particles",
    "Set an initial color and size using ParticleInputBlock",
    "Add a <filter-value>BoxShape</filter-value> block to emit particles from a box volume",
    "Get the particle's Age and Lifetime using ParticleInputBlock",
    "Calculate the age ratio (Age / Lifetime) to get a value from 0 to 1",
    "Create a threshold value (0.5) using ParticleInputBlock",
    "Create a ParticleConditionBlock with GreaterThan test",
    "Connect ageRatio to the left input and threshold to the right input",
    "Create two colors: Color1 (red) and Color2 (blue)",
    "Connect Color1 to condition.ifTrue and Color2 to condition.ifFalse",
    "Use the condition output to control particle color and size",
    "Observe how particles change color and size when they pass the threshold"
  ],
  "blocksTitle": "Blocks Used in This Lesson",
  "blocks": [
    {
      "name": "ParticleConditionBlock",
      "description": "Evaluates a condition and returns one value if true, another if false. Supports various comparison operations like Equal, NotEqual, LessThan, GreaterThan, etc.",
      "properties": [
        {
          "name": "test",
          "value": "ParticleConditionBlockTests.GreaterThan",
          "description": "The comparison operation to perform"
        },
        {
          "name": "left",
          "value": "Float input",
          "description": "The left operand (e.g., ageRatio)"
        },
        {
          "name": "right",
          "value": "Float input",
          "description": "The right operand (e.g., threshold)"
        },
        {
          "name": "ifTrue",
          "value": "AutoDetect input",
          "description": "The value to return if condition is true (e.g., Color1)"
        },
        {
          "name": "ifFalse",
          "value": "AutoDetect input",
          "description": "The value to return if condition is false (e.g., Color2)"
        }
      ]
    },
    {
      "name": "ParticleInputBlock (Age/Lifetime)",
      "description": "Retrieves particle age and lifetime for conditional logic. Age ratio (Age / Lifetime) gives a normalized value from 0 to 1.",
      "properties": [
        {
          "name": "contextualValue",
          "value": "NodeParticleContextualSources.Age / Lifetime",
          "description": "The contextual source - Age or Lifetime"
        }
      ]
    }
  ],
  "properties": "Properties",
  "codeTitle": "Code Explanation",
  "codeCopy": "This lesson demonstrates conditional logic using ParticleConditionBlock. The condition block evaluates a comparison (e.g., ageRatio > 0.5) and returns one value if true, another if false. This allows you to create effects that change based on particle state. For example, particles can change color when they reach half their lifetime, or apply different effects based on speed, position, or other properties. Conditional logic is essential for creating complex, state-based particle behaviors.",
  "objectivesTitle": "Learning Objectives",
  "objectives": [
    "Use ParticleConditionBlock for conditional logic",
    "Understand different comparison operations (GreaterThan, LessThan, Equal, etc.)",
    "Create if-then-else logic with ifTrue and ifFalse inputs",
    "Combine conditions with particle properties (age, speed, position)",
    "Apply conditional effects to particle properties"
  ],
  "commonMistakesTitle": "Common Mistakes",
  "commonMistakes": [
    {
      "mistake": "Using wrong comparison operation",
      "explanation": "Each comparison operation (GreaterThan, LessThan, Equal, etc.) tests a different relationship. Using the wrong one creates opposite logic.",
      "solution": "GreaterThan: left > right. LessThan: left < right. Equal: left == right. Choose the operation that matches your desired condition."
    },
    {
      "mistake": "Swapping ifTrue and ifFalse values",
      "explanation": "ifTrue is returned when condition is true, ifFalse when condition is false. Swapping them reverses the logic.",
      "solution": "Set ifTrue to the value you want when condition is true, ifFalse to the value when condition is false. Double-check your logic matches your intent."
    },
    {
      "mistake": "Not ensuring ifTrue and ifFalse are same type",
      "explanation": "ParticleConditionBlock requires ifTrue and ifFalse to be the same type (both Color4, both Float, etc.). Mismatched types cause errors.",
      "solution": "Ensure both ifTrue and ifFalse inputs are the same type. If one is Color4, the other must also be Color4. If one is Float, the other must be Float."
    }
  ],
  "homeworkTitle": "Practice Exercises",
  "homework": [
    "Try different comparison operations (LessThan, Equal, NotEqual)",
    "Create multiple conditions and combine them using And/Or operations",
    "Use conditions to trigger different effects at different particle ages",
    "Combine conditional logic with other effects like size or scale changes",
    "Experiment with different threshold values to see how they affect particle behavior"
  ]
}