{
  "title": "5.2: Conditional Logic",
  "summary": "Learn to use ParticleConditionBlock to create conditional effects based on particle properties",
  "introTitle": "Introduction",
  "intro": "In this lesson, you'll learn how to use ParticleConditionBlock to create conditional logic in your particle systems. Conditional blocks allow you to make decisions based on particle properties - for example, changing color when a particle reaches a certain age, or applying different effects based on speed. You'll learn to use comparison operations (GreaterThan, LessThan, Equal, etc.) and combine conditions with other blocks.",
  "stepsTitle": "Step-by-Step Instructions",
  "steps": [
    "Create a <filter-value>System</filter-value> block - this is the root of your particle system",
    "Add a <filter-value>Texture</filter-value> block to provide a texture for the particles and connect to System block",
    "Load a texture <textures>flare.png</textures> by load button in the Texture block properties",
    "Add a <filter-value>CreateParticle</filter-value> block to emit particles and connect to System block",
    "Add a <filter-value>Color4</filter-value> block and set its value to a base color",
    "Connect the Color4 block's output to CreateParticle block's color input",
    "Add a <filter-value>Float</filter-value> block and set its value for base size",
    "Connect the Float block's output to CreateParticle block's size input",
    "Add a <filter-value>BoxShape</filter-value> block to emit particles from a box volume and connect between CreateParticle and System blocks",
    "Add an <filter-value>Age</filter-value> block to get the particle's current age (set contextualValue to Age in properties)",
    "Add a <filter-value>Lifetime</filter-value> block to get the particle's total lifetime (set contextualValue to Lifetime in properties)",
    "Add a math <filter-value>Divide</filter-value> block to calculate age ratio (Age / Lifetime)",
    "Connect Age block to Divide block's left input and Lifetime block to right input",
    "Add a <filter-value>Float</filter-value> block for threshold value and set it to 0.5",
    "Add a <filter-value>Condition</filter-value> block (ParticleConditionBlock) and set its test to GreaterThan in properties",
    "Connect ageRatio from Divide block to Condition block's left input and threshold Float to right input",
    "Add a <filter-value>Color4</filter-value> block for Color1 (e.g., red) and set its value",
    "Add another <filter-value>Color4</filter-value> block for Color2 (e.g., blue) and set its value",
    "Connect Color1 block's output to Condition block's ifTrue input",
    "Connect Color2 block's output to Condition block's ifFalse input",
    "Add <filter-value>UpdateColor</filter-value> block after BoxShape and connect Condition block's output to UpdateColor block's color input",
    "Add <filter-value>UpdatePosition</filter-value> block after UpdateColor and connect to System block",
    "Observe how particles change color when they pass the threshold (ageRatio > 0.5)"
  ],
  "blocksTitle": "Blocks Used in This Lesson",
  "blocks": [
    {
      "name": "ParticleConditionBlock",
      "description": "Evaluates a condition and returns one value if true, another if false. Supports various comparison operations like Equal, NotEqual, LessThan, GreaterThan, etc. In the visual editor, you can find this block in the block list and configure its properties in the properties panel on the right.",
      "properties": [
        {
          "name": "test",
          "value": "ParticleConditionBlockTests.GreaterThan",
          "description": "The comparison operation to perform. Set this in the properties panel on the right side of the editor."
        },
        {
          "name": "left",
          "value": "Float input",
          "description": "The left operand (e.g., ageRatio). Connect a Float output to this input."
        },
        {
          "name": "right",
          "value": "Float input",
          "description": "The right operand (e.g., threshold). Connect a Float output to this input."
        },
        {
          "name": "ifTrue",
          "value": "AutoDetect input",
          "description": "The value to return if condition is true (e.g., Color1). Connect the appropriate output to this input."
        },
        {
          "name": "ifFalse",
          "value": "AutoDetect input",
          "description": "The value to return if condition is false (e.g., Color2). Connect the appropriate output to this input."
        }
      ]
    },
    {
      "name": "ParticleInputBlock (Age/Lifetime)",
      "description": "Retrieves particle age and lifetime for conditional logic. Age ratio (Age / Lifetime) gives a normalized value from 0 to 1. In the visual editor, you can find this block in the block list and configure its properties in the properties panel on the right.",
      "properties": [
        {
          "name": "contextualValue",
          "value": "NodeParticleContextualSources.Age / Lifetime",
          "description": "The contextual source - Age or Lifetime. Set this in the properties panel on the right side of the editor."
        }
      ]
    }
  ],
  "properties": "Properties",
  "codeTitle": "Code Explanation",
  "codeCopy": "This lesson demonstrates conditional logic using ParticleConditionBlock. The condition block evaluates a comparison (e.g., ageRatio > 0.5) and returns one value if true, another if false. This allows you to create effects that change based on particle state. For example, particles can change color when they reach half their lifetime, or apply different effects based on speed, position, or other properties. Conditional logic is essential for creating complex, state-based particle behaviors.",
  "objectivesTitle": "Learning Objectives",
  "objectives": [
    "Use ParticleConditionBlock for conditional logic",
    "Understand different comparison operations (GreaterThan, LessThan, Equal, etc.)",
    "Create if-then-else logic with ifTrue and ifFalse inputs",
    "Combine conditions with particle properties (age, speed, position)",
    "Apply conditional effects to particle properties"
  ],
  "commonMistakesTitle": "Common Mistakes",
  "commonMistakes": [
    {
      "mistake": "Using wrong comparison operation",
      "explanation": "Each comparison operation (GreaterThan, LessThan, Equal, etc.) tests a different relationship. Using the wrong one creates opposite logic.",
      "solution": "GreaterThan: left > right. LessThan: left < right. Equal: left == right. Choose the operation that matches your desired condition."
    },
    {
      "mistake": "Swapping ifTrue and ifFalse values",
      "explanation": "ifTrue is returned when condition is true, ifFalse when condition is false. Swapping them reverses the logic.",
      "solution": "Set ifTrue to the value you want when condition is true, ifFalse to the value when condition is false. Double-check your logic matches your intent."
    },
    {
      "mistake": "Not ensuring ifTrue and ifFalse are same type",
      "explanation": "ParticleConditionBlock requires ifTrue and ifFalse to be the same type (both Color4, both Float, etc.). Mismatched types cause errors.",
      "solution": "Ensure both ifTrue and ifFalse inputs are the same type. If one is Color4, the other must also be Color4. If one is Float, the other must be Float."
    }
  ],
  "homeworkTitle": "Practice Exercises",
  "homework": [
    "Try different comparison operations (LessThan, Equal, NotEqual)",
    "Create multiple conditions and combine them using And/Or operations",
    "Use conditions to trigger different effects at different particle ages",
    "Combine conditional logic with other effects like size or scale changes",
    "Experiment with different threshold values to see how they affect particle behavior"
  ]
}