{
  "title": "5.1: Продвинутые Математические Операции",
  "summary": "Научитесь использовать несколько тригонометрических и продвинутых математических функций (Sin, Cos, Sqrt, Abs) вместе",
  "introTitle": "Введение",
  "intro": "В этом уроке вы научитесь использовать несколько математических функций вместе для создания сложных эффектов. Вы будете использовать ParticleTrigonometryBlock с различными операциями (Sin, Cos, Sqrt, Abs) и комбинировать их для создания богатых, анимированных цветовых эффектов. Каждая функция создает различный паттерн - синусоидальные волны осциллируют, косинусоидальные волны сдвинуты по фазе, квадратный корень создает плавные кривые, а абсолютное значение удаляет отрицательные значения.",
  "stepsTitle": "Пошаговые Инструкции",
  "steps": [
    "Создайте блок <filter-value>System</filter-value> - это корень вашей системы частиц",
    "Добавьте блок <filter-value>Texture</filter-value> для предоставления текстуры частицам и подключите к блоку System",
    "Загрузите текстуру <textures>flare.png</textures> с помощью кнопки загрузки в свойствах блока Texture",
    "Добавьте блок <filter-value>CreateParticle</filter-value> для эмиссии частиц и подключите к блоку System",
    "Добавьте блок <filter-value>Color4</filter-value> и установите его значение для базового цвета",
    "Подключите выход блока Color4 к входу color блока CreateParticle",
    "Добавьте блок <filter-value>Float</filter-value> и установите его значение для базового размера",
    "Подключите выход блока Float к входу size блока CreateParticle",
    "Добавьте блок <filter-value>CylinderShape</filter-value> для эмиссии частиц из объема цилиндра и подключите между блоками CreateParticle и System",
    "Добавьте блок <filter-value>Time</filter-value> для получения системного времени (установите systemSource в Time в свойствах)",
    "Добавьте блок <filter-value>Float</filter-value> для коэффициента масштабирования времени и установите его значение (например, 0.5)",
    "Добавьте математический блок <filter-value>Multiply</filter-value> для масштабирования времени и подключите блок Time к левому входу, а Float коэффициента к правому входу",
    "ЧАСТЬ 1 - Sin: Добавьте блок <filter-value>Sin</filter-value> (ParticleTrigonometryBlock с операцией Sin) и подключите масштабированное время к его входу",
    "Нормализуйте выход Sin: Добавьте блок <filter-value>Float</filter-value> со значением 1.0 и математический блок <filter-value>Add</filter-value>",
    "Подключите выход Sin к левому входу блока Add и Float(1.0) к правому входу, затем добавьте еще один блок <filter-value>Float</filter-value> со значением 2.0 и блок <filter-value>Divide</filter-value>",
    "Подключите выход Add к левому входу блока Divide и Float(2.0) к правому входу для нормализации Sin к диапазону 0-1",
    "ЧАСТЬ 2 - Cos: Добавьте блок <filter-value>Cos</filter-value> и подключите масштабированное время к его входу, затем нормализуйте тем же методом, что и Sin",
    "ЧАСТЬ 3 - Sqrt: Добавьте блок <filter-value>Abs</filter-value> и подключите масштабированное время к его входу, затем добавьте блок <filter-value>Sqrt</filter-value> и подключите выход Abs к нему",
    "Создайте Color4: Добавьте блок <filter-value>Converter</filter-value> и подключите нормализованный Sin к входу X, нормализованный Cos к входу Y, выход Sqrt к входу Z и Float(1.0) к входу W",
    "Добавьте блок <filter-value>UpdateColor</filter-value> после CylinderShape и подключите выход Color4 блока Converter к входу color блока UpdateColor",
    "Добавьте блок <filter-value>UpdatePosition</filter-value> после UpdateColor и подключите к блоку System"
  ],
  "blocksTitle": "Блоки, Используемые в Этом Уроке",
  "blocks": [
    {
      "name": "ParticleTrigonometryBlock",
      "description": "Выполняет тригонометрические и продвинутые математические операции над значениями Float. Поддерживает Sin, Cos, Tan, Sqrt, Log, Abs и многие другие операции. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "name",
          "value": "'Sin Time'",
          "description": "Отображаемое имя блока. Установите это в панели свойств справа от редактора."
        },
        {
          "name": "operation",
          "value": "ParticleTrigonometryBlockOperations.Sin",
          "description": "Математическая операция - Sin для синусоидальной волны. Установите это в панели свойств справа от редактора."
        },
        {
          "name": "input",
          "value": "Float input",
          "description": "Входное значение (например, время для синусоидальной волны). Подключите выход Float к этому входу."
        }
      ]
    },
    {
      "name": "ParticleInputBlock (Time)",
      "description": "Получает системное время. Время увеличивается непрерывно, что делает его идеальным для создания анимированных эффектов, которые изменяются со временем. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "systemSource",
          "value": "NodeParticleSystemSources.Time",
          "description": "Системный источник - Time для системного времени. Установите это в панели свойств справа от редактора."
        }
      ]
    },
    {
      "name": "ParticleMathBlock (Multiply)",
      "description": "Умножает два значения. Используется для масштабирования выхода синусоидальной волны для управления амплитудой колебаний. В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "operation",
          "value": "ParticleMathBlockOperations.Multiply",
          "description": "Математическая операция - Multiply. Установите это в панели свойств справа от редактора."
        }
      ]
    },
    {
      "name": "ParticleMathBlock (Add)",
      "description": "Складывает два значения. Используется для смещения масштабированной синусоидальной волны, сдвигая ее в желаемый диапазон (например, 0 до 1). В визуальном редакторе вы можете найти этот блок в списке блоков и настроить его свойства в панели свойств справа.",
      "properties": [
        {
          "name": "operation",
          "value": "ParticleMathBlockOperations.Add",
          "description": "Математическая операция - Add. Установите это в панели свойств справа от редактора."
        }
      ]
    }
  ],
  "properties": "Свойства",
  "codeTitle": "Объяснение Кода",
  "codeCopy": "Этот урок демонстрирует комбинирование нескольких математических функций. Каждая функция создает различный паттерн: Sin создает осциллирующие волны (красный), Cos создает волны со сдвигом фазы (зеленый), а Sqrt(Abs) создает плавные кривые (синий). Формула нормализации (значение + 1) / 2 отображает функции из [-1, 1] в [0, 1] для цветовых значений. Используя различные функции для различных цветовых компонентов, мы создаем богатые, анимированные эффекты, где каждый цветовой канал следует различному математическому паттерну. Эта техника необходима для создания сложных, органически выглядящих анимаций.",
  "objectivesTitle": "Цели Обучения",
  "objectives": [
    "Использовать ParticleTrigonometryBlock с разными операциями (Sin, Cos, Sqrt, Abs)",
    "Понять, как тригонометрические функции создают осциллирующие паттерны",
    "Нормализовать выходы функций к диапазону 0-1 для цветовых значений",
    "Комбинировать несколько математических функций для сложных эффектов",
    "Использовать системное время для непрерывных анимаций"
  ],
  "commonMistakesTitle": "Частые Ошибки",
  "commonMistakes": [
    {
      "mistake": "Не нормализация выходов тригонометрических функций",
      "explanation": "Sin и Cos выводят значения от -1 до 1, но цветовые компоненты нуждаются в значениях от 0 до 1. Использование сырых выходов вызывает неправильные цвета.",
      "solution": "Нормализуйте выходы Sin/Cos: normalizedValue = (value + 1) / 2. Это отображает [-1, 1] в [0, 1] для цветовых компонентов."
    },
    {
      "mistake": "Использование неправильного входа для тригонометрических функций",
      "explanation": "Тригонометрические функции ожидают углы в радианах, а не в градусах. Использование градусов или неправильных значений создает неправильные паттерны.",
      "solution": "Для анимаций на основе времени используйте системное время напрямую или масштабированное время. Для расчетов на основе углов конвертируйте градусы в радианы: радианы = градусы * (Math.PI / 180)."
    },
    {
      "mistake": "Не масштабирование времени для контроля скорости анимации",
      "explanation": "Использование сырого системного времени создает очень быстрые анимации. Без масштабирования эффекты изменяются слишком быстро, чтобы их можно было четко увидеть.",
      "solution": "Масштабируйте время, используя умножение: scaledTime = time * speedFactor. Используйте speedFactor < 1 для более медленных анимаций, > 1 для более быстрых анимаций."
    }
  ],
  "homeworkTitle": "Упражнения для Практики",
  "homework": [
    "Попробуйте разные тригонометрические функции (Cos, Tan) и наблюдайте различия",
    "Используйте синусоидальные волны для анимации размера частиц вместо цвета",
    "Создайте несколько синусоидальных волн с разными частотами и комбинируйте их",
    "Экспериментируйте с Sqrt, Log и другими продвинутыми математическими операциями",
    "Комбинируйте тригонометрические функции с эффектами на основе возраста для сложных анимаций"
  ]
}